//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп
		.ФреймворкТестирования()
		.ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование свойств декорации формы")
			.ДобавитьТест("СвойстваДекорацииФормыНадпись", "Свойства элемента ДекорацияФормы вида ""Надпись""")
			.ДобавитьТест("СвойстваДекорацииФормыКартинка", "Свойства элемента ДекорацияФормы вида ""Картинка""")
		.ДобавитьТестовыйНабор("Тестирование событий декорации формы")
			.ДобавитьТест("СобытияДекорацииФормыНадпись", "События элемента ДекорацияФормы вида ""Надпись""")
			.ДобавитьТест("СобытияДекорацииФормыКартинка", "События элемента ДекорацияФормы вида ""Картинка""")
	;
КонецПроцедуры

#Область ТестированиеСвойств

Процедура СвойстваДекорацииФормыНадпись() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Надпись");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеДекорацииФормы";
	ИмяТестируемогоРеквизита = "Декорация_ВидНадпись";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваДекорацииФормыКартинка() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Картинка");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеДекорацииФормы";
	ИмяТестируемогоРеквизита = "Декорация_ВидКартинка";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти

#Область ТестированиеСобытий

Процедура СобытияДекорацииФормыНадпись() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Надпись");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеДекорацииФормы";
	ИмяТестируемогоРеквизита = "Декорация_ВидНадпись";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияДекорацииФормыКартинка() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Картинка");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеДекорацииФормы";
	ИмяТестируемогоРеквизита = "Декорация_ВидКартинка";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти
