#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДеревоФорм = РеквизитФормыВЗначение("ДеревоФормКонфигурации");
	МФИнструментыРазработчика.СформироватьДеревоФорм(ДеревоФорм);
	ЗначениеВРеквизитФормы(ДеревоФорм, "ДеревоФормКонфигурации");
	
	АдресКэшаФорм = ПоместитьВоВременноеХранилище(Новый Соответствие, УникальныйИдентификатор);
	СформироватьКэшФормНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяРедактируемойФормыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ИмяРедактируемойФормыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ДеревоФорм", ДеревоФормКонфигурации);
	ПараметрыПодбора.Вставить("ВыбраннаяФорма", ИмяРедактируемойФормы);
	ПараметрыПодбора.Вставить("ВыбранныеФормы", Новый Массив);
	
	// BSLLS:NestedFunctionInParameters-off
	ОткрытьФорму(
		//"Обработка.МФРаботаСМакетом.Форма.ФормаПодбора", 
		"ОбщаяФорма.МФВыборФормы",
		ПараметрыПодбора, 
		ЭтаФорма, 
		ЭтаФорма, 
		, 
		, 
		Новый ОписаниеОповещения("ПослеВыбораФормыДляМодификации", ЭтаФорма), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	// BSLLS:NestedFunctionInParameters-on
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
// В разделах размещаются процедуры-обработчики таблиц формы и элементов таблиц. Для процедур-обработчиков 
// каждой таблицы должен быть создан свой раздел.
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализироватьФорму(Команда)
	Если ПустаяСтрока(ИмяРедактируемойФормы) Тогда
		Возврат;
	КонецЕсли;
	
	АдресДанныхДляСозданияМодификации = ПоместитьВоВременноеХранилище(Неопределено, ЭтотОбъект.УникальныйИдентификатор);
	МФИнструментыРазработчикаКлиент.СформироватьДанныеДляСозданияМодификации(
		ИмяРедактируемойФормы, 
		АдресДанныхДляСозданияМодификации
	);
	
	СформироватьМодификацию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФормыДляМодификации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРедактируемойФормы = РезультатЗакрытия.ВыбраннаяФорма;
	СписокВыбора = Элементы.ИмяРедактируемойФормы.СписокВыбора;
	Если СписокВыбора.НайтиПоЗначению(ИмяРедактируемойФормы) = Неопределено Тогда
		СписокВыбора.Добавить(ИмяРедактируемойФормы);
		СписокВыбора.СортироватьПоЗначению();
	КонецЕсли;
	
	ДеревоФормКонфигурации.ПолучитьЭлементы().Очистить();
	МФИнструментыРазработчикаКлиентСервер.ЗаполнитьВетки(
		ДеревоФормКонфигурации, 
		РезультатЗакрытия.ДеревоФормКонфигурации
	);
//	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаСервере
Процедура СформироватьКэшФормНаСервере()
	КэшФорм = РегистрыСведений.МФМакеты.КэшФорм(
		"ИмяМакета",
		РегистрыСведений.МФМакеты.РежимОтбораАктуальныеФормы()
	);
	ПоместитьВоВременноеХранилище(КэшФорм, АдресКэшаФорм);
	Элементы.ИмяРедактируемойФормы.СписокВыбора.Очистить();
	Для Каждого Элемент Из КэшФорм Цикл
		Элементы.ИмяРедактируемойФормы.СписокВыбора.Добавить(Элемент.Ключ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СформироватьМодификацию()
	ДанныеДляСозданияМодификации = ПолучитьИзВременногоХранилища(АдресДанныхДляСозданияМодификации);
КонецПроцедуры

#КонецОбласти
