//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп
		.ФреймворкТестирования()
		.ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование свойств поля формы")
			.ДобавитьТест("СвойстваПоляФормыПолеHTMLДокумента", "Свойства элемента ПолеФормы вида ""ПолеHTMLДокумента""")
			.ДобавитьТест("СвойстваПоляФормыПолеPDFДокумента", "Свойства элемента ПолеФормы вида ""ПолеPDFДокумента""")
			.ДобавитьТест("СвойстваПоляФормыПолеВвода", "Свойства элемента ПолеФормы вида ""ПолеВвода""")
			.ДобавитьТест("СвойстваПоляФормыПолеГеографическойСхемы", "Свойства элемента ПолеФормы вида ""ПолеГеографическойСхемы""")
			.ДобавитьТест("СвойстваПоляФормыПолеГрафическойСхемы", "Свойства элемента ПолеФормы вида ""ПолеГрафическойСхемы""")
			.ДобавитьТест("СвойстваПоляФормыПолеДендрограммы", "Свойства элемента ПолеФормы вида ""ПолеДендрограммы""")
			.ДобавитьТест("СвойстваПоляФормыПолеДиаграммы", "Свойства элемента ПолеФормы вида ""ПолеДиаграммы""")
			.ДобавитьТест("СвойстваПоляФормыПолеДиаграммыГанта", "Свойства элемента ПолеФормы вида ""ПолеДиаграммыГанта""")
			.ДобавитьТест("СвойстваПоляФормыПолеИндикатора", "Свойства элемента ПолеФормы вида ""ПолеИндикатора""")
			.ДобавитьТест("СвойстваПоляФормыПолеКалендаря", "Свойства элемента ПолеФормы вида ""ПолеКалендаря""")
			.ДобавитьТест("СвойстваПоляФормыПолеКартинки", "Свойства элемента ПолеФормы вида ""ПолеКартинки""")
			.ДобавитьТест("СвойстваПоляФормыПолеНадписи", "Свойства элемента ПолеФормы вида ""ПолеНадписи""")
			.ДобавитьТест("СвойстваПоляФормыПолеПереключателя", "Свойства элемента ПолеФормы вида ""ПолеПереключателя""")
			.ДобавитьТест("СвойстваПоляФормыПолеПериода", "Свойства элемента ПолеФормы вида ""ПолеПериода""")
			.ДобавитьТест("СвойстваПоляФормыПолеПланировщика", "Свойства элемента ПолеФормы вида ""ПолеПланировщика""")
			.ДобавитьТест("СвойстваПоляФормыПолеПолосыРегулирования", "Свойства элемента ПолеФормы вида ""ПолеПолосыРегулирования""")
			.ДобавитьТест("СвойстваПоляФормыПолеТабличногоДокумента", "Свойства элемента ПолеФормы вида ""ПолеТабличногоДокумента""")
			.ДобавитьТест("СвойстваПоляФормыПолеТекстовогоДокумента", "Свойства элемента ПолеФормы вида ""ПолеТекстовогоДокумента""")
			.ДобавитьТест("СвойстваПоляФормыПолеФлажка", "Свойства элемента ПолеФормы вида ""ПолеФлажка""")
			.ДобавитьТест("СвойстваПоляФормыПолеФорматированногоДокумента", "Свойства элемента ПолеФормы вида ""ПолеФорматированногоДокумента""")
		.ДобавитьТестовыйНабор("Тестирование событий поля формы")
			.ДобавитьТест("СобытияПоляФормыПолеHTMLДокумента", "События элемента ПолеФормы вида ""ПолеHTMLДокумента""")
			.ДобавитьТест("СобытияПоляФормыПолеPDFДокумента", "События элемента ПолеФормы вида ""ПолеPDFДокумента""")
			.ДобавитьТест("СобытияПоляФормыПолеВвода", "События элемента ПолеФормы вида ""ПолеВвода""")
			.ДобавитьТест("СобытияПоляФормыПолеГеографическойСхемы", "События элемента ПолеФормы вида ""ПолеГеографическойСхемы""")
			.ДобавитьТест("СобытияПоляФормыПолеГрафическойСхемы", "События элемента ПолеФормы вида ""ПолеГрафическойСхемы""")
			.ДобавитьТест("СобытияПоляФормыПолеДендрограммы", "События элемента ПолеФормы вида ""ПолеДендрограммы""")
			.ДобавитьТест("СобытияПоляФормыПолеДиаграммы", "События элемента ПолеФормы вида ""ПолеДиаграммы""")
			.ДобавитьТест("СобытияПоляФормыПолеДиаграммыГанта", "События элемента ПолеФормы вида ""ПолеДиаграммыГанта""")
			.ДобавитьТест("СобытияПоляФормыПолеИндикатора", "События элемента ПолеФормы вида ""ПолеИндикатора""")
			.ДобавитьТест("СобытияПоляФормыПолеКалендаря", "События элемента ПолеФормы вида ""ПолеКалендаря""")
			.ДобавитьТест("СобытияПоляФормыПолеКартинки", "События элемента ПолеФормы вида ""ПолеКартинки""")
			.ДобавитьТест("СобытияПоляФормыПолеНадписи", "События элемента ПолеФормы вида ""ПолеНадписи""")
			.ДобавитьТест("СобытияПоляФормыПолеПереключателя", "События элемента ПолеФормы вида ""ПолеПереключателя""")
			.ДобавитьТест("СобытияПоляФормыПолеПериода", "События элемента ПолеФормы вида ""ПолеПериода""")
			.ДобавитьТест("СобытияПоляФормыПолеПланировщика", "События элемента ПолеФормы вида ""ПолеПланировщика""")
			.ДобавитьТест("СобытияПоляФормыПолеПолосыРегулирования", "События элемента ПолеФормы вида ""ПолеПолосыРегулирования""")
			.ДобавитьТест("СобытияПоляФормыПолеТабличногоДокумента", "События элемента ПолеФормы вида ""ПолеТабличногоДокумента""")
			.ДобавитьТест("СобытияПоляФормыПолеТекстовогоДокумента", "События элемента ПолеФормы вида ""ПолеТекстовогоДокумента""")
			.ДобавитьТест("СобытияПоляФормыПолеФлажка", "События элемента ПолеФормы вида ""ПолеФлажка""")
			.ДобавитьТест("СобытияПоляФормыПолеФорматированногоДокумента", "События элемента ПолеФормы вида ""ПолеФорматированногоДокумента""")
	;
КонецПроцедуры

#Область ТестированиеСвойств

Процедура СвойстваПоляФормыПолеHTMLДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеHTMLДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеHTMLДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеPDFДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеPDFДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеPDFДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеВвода() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеВвода");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеВвода";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеГеографическойСхемы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеГеографическойСхемы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеГеографическойСхемы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеГрафическойСхемы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеГрафическойСхемы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеГрафическойСхемы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеДендрограммы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДендрограммы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДендрограммы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеДиаграммы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДиаграммы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДиаграммы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеДиаграммыГанта() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДиаграммыГанта");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДиаграммыГанта";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеИндикатора() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеИндикатора");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеИндикатора";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеКалендаря() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеКалендаря");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеКалендаря";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеКартинки() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеКартинки");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеКартинки";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеНадписи() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеНадписи");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеНадписи";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеПереключателя() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПереключателя");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПереключателя";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеПериода() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПериода");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПериода";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеПланировщика() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПланировщика");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПланировщика";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеПолосыРегулирования() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПолосыРегулирования");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПолосыРегулирования";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеТабличногоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеТабличногоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеТабличногоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеТекстовогоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеТекстовогоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеТекстовогоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеФлажка() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеФлажка");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеФлажка";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваПоляФормыПолеФорматированногоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеФорматированногоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеФорматированногоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти

#Область ТестированиеСобытий

Процедура СобытияПоляФормыПолеHTMLДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеHTMLДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеHTMLДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеPDFДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеPDFДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеPDFДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеВвода() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеВвода");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеВвода";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеГеографическойСхемы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеГеографическойСхемы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеГеографическойСхемы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеГрафическойСхемы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеГрафическойСхемы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеГрафическойСхемы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеДендрограммы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДендрограммы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДендрограммы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеДиаграммы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДиаграммы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДиаграммы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеДиаграммыГанта() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДиаграммыГанта");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДиаграммыГанта";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеИндикатора() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеИндикатора");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеИндикатора";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеКалендаря() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеКалендаря");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеКалендаря";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеКартинки() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеКартинки");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеКартинки";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеНадписи() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеНадписи");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеНадписи";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеПереключателя() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПереключателя");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПереключателя";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеПериода() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПериода");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПериода";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеПланировщика() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПланировщика");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПланировщика";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеПолосыРегулирования() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПолосыРегулирования");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПолосыРегулирования";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеТабличногоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеТабличногоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеТабличногоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеТекстовогоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеТекстовогоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеТекстовогоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеФлажка() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеФлажка");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеФлажка";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияПоляФормыПолеФорматированногоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеФорматированногоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеФорматированногоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти
