//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп
		.ФреймворкТестирования()
		.ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование поля формы")
			.ДобавитьТест("ПолеФормыПолеHTMLДокумента", "Тестирование элемента ПолеФормы вида ""ПолеHTMLДокумента""")
			.ДобавитьТест("ПолеФормыПолеPDFДокумента", "Тестирование элемента ПолеФормы вида ""ПолеPDFДокумента""")
			.ДобавитьТест("ПолеФормыПолеВвода", "Тестирование элемента ПолеФормы вида ""ПолеВвода""")
			.ДобавитьТест("ПолеФормыПолеГеографическойСхемы", "Тестирование элемента ПолеФормы вида ""ПолеГеографическойСхемы""")
			.ДобавитьТест("ПолеФормыПолеГрафическойСхемы", "Тестирование элемента ПолеФормы вида ""ПолеГрафическойСхемы""")
			.ДобавитьТест("ПолеФормыПолеДендрограммы", "Тестирование элемента ПолеФормы вида ""ПолеДендрограммы""")
			.ДобавитьТест("ПолеФормыПолеДиаграммы", "Тестирование элемента ПолеФормы вида ""ПолеДиаграммы""")
			.ДобавитьТест("ПолеФормыПолеДиаграммыГанта", "Тестирование элемента ПолеФормы вида ""ПолеДиаграммыГанта""")
			.ДобавитьТест("ПолеФормыПолеИндикатора", "Тестирование элемента ПолеФормы вида ""ПолеИндикатора""")
			.ДобавитьТест("ПолеФормыПолеКалендаря", "Тестирование элемента ПолеФормы вида ""ПолеКалендаря""")
			.ДобавитьТест("ПолеФормыПолеКартинки", "Тестирование элемента ПолеФормы вида ""ПолеКартинки""")
			.ДобавитьТест("ПолеФормыПолеНадписи", "Тестирование элемента ПолеФормы вида ""ПолеНадписи""")
			.ДобавитьТест("ПолеФормыПолеПереключателя", "Тестирование элемента ПолеФормы вида ""ПолеПереключателя""")
			.ДобавитьТест("ПолеФормыПолеПериода", "Тестирование элемента ПолеФормы вида ""ПолеПериода""")
			.ДобавитьТест("ПолеФормыПолеПланировщика", "Тестирование элемента ПолеФормы вида ""ПолеПланировщика""")
			.ДобавитьТест("ПолеФормыПолеПолосыРегулирования", "Тестирование элемента ПолеФормы вида ""ПолеПолосыРегулирования""")
			.ДобавитьТест("ПолеФормыПолеТабличногоДокумента", "Тестирование элемента ПолеФормы вида ""ПолеТабличногоДокумента""")
			.ДобавитьТест("ПолеФормыПолеТекстовогоДокумента", "Тестирование элемента ПолеФормы вида ""ПолеТекстовогоДокумента""")
			.ДобавитьТест("ПолеФормыПолеФлажка", "Тестирование элемента ПолеФормы вида ""ПолеФлажка""")
			.ДобавитьТест("ПолеФормыПолеФорматированногоДокумента", "Тестирование элемента ПолеФормы вида ""ПолеФорматированногоДокумента""")
	;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ПолеФормыПолеHTMLДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеHTMLДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеHTMLДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеPDFДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеPDFДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеPDFДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеВвода() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеВвода");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеВвода";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеГеографическойСхемы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеГеографическойСхемы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеГеографическойСхемы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеГрафическойСхемы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеГрафическойСхемы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеГрафическойСхемы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеДендрограммы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДендрограммы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДендрограммы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеДиаграммы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДиаграммы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДиаграммы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеДиаграммыГанта() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеДиаграммыГанта");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеДиаграммыГанта";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеИндикатора() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеИндикатора");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеИндикатора";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеКалендаря() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеКалендаря");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеКалендаря";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеКартинки() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеКартинки");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеКартинки";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеНадписи() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеНадписи");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеНадписи";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеПереключателя() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПереключателя");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПереключателя";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеПериода() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПериода");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПериода";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеПланировщика() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПланировщика");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПланировщика";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеПолосыРегулирования() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеПолосыРегулирования");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеПолосыРегулирования";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеТабличногоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеТабличногоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеТабличногоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеТекстовогоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеТекстовогоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеТекстовогоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеФлажка() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеФлажка");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеФлажка";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ПолеФормыПолеФорматированногоДокумента() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ПолеФорматированногоДокумента");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеПоляФормы";
	ИмяТестируемогоРеквизита = "ПолеФормы_ВидПолеФорматированногоДокумента";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти