//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция Значения() Экспорт
	Результат = НовыйЗначения();
	
	ДобавитьСтандартноеПеречисление(Результат, "АвтоИзменениеРегистраПриВводеТекста", ЗначенияАвтоИзменениеРегистраПриВводеТекста());
	ДобавитьСтандартноеПеречисление(Результат, "АвтоИсправлениеПриВводеТекста", ЗначенияАвтоИсправлениеПриВводеТекста());
	
	ДобавитьСтандартноеПеречисление(Результат, "Булево", ЗначенияБулево());
	ДобавитьСтандартноеПеречисление(Результат, МФПовтИсп.ТипБулевоНеопределено(), ЗначенияБулевоНеопределено());
	
	ДобавитьСтандартноеПеречисление(Результат, "ВажностьПриОтображении", ЗначенияВажностьПриОтображении());
	ДобавитьСтандартноеПеречисление(Результат, "ВариантВыравниванияЭлементовИЗаголовков", ЗначенияВариантВыравниванияЭлементовИЗаголовков());
	ДобавитьСтандартноеПеречисление(Результат, "ВариантУправленияВысотойТаблицы", ЗначенияВариантУправленияВысотойТаблицы());
	ДобавитьСтандартноеПеречисление(Результат, "ВариантУправленияВысотойЭлемента", ЗначенияВариантУправленияВысотойЭлемента());
	ДобавитьСтандартноеПеречисление(Результат, "ВертикальноеПоложениеЭлемента", ЗначенияВертикальноеПоложениеЭлемента());
	ДобавитьСтандартноеПеречисление(Результат, "ВидГруппыФормы", ЗначенияВидГруппыФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ВидДекорацииФормы", ЗначенияВидДекорацииФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ВидКнопкиФормы", ЗначенияВидКнопкиФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ВидПереключателя", ЗначенияВидПереключателя());
	ДобавитьСтандартноеПеречисление(Результат, "ВидПоляФормы", ЗначенияВидПоляФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ВидФлажка", ЗначенияВидФлажка());
	
	ДобавитьСтандартноеПеречисление(Результат, "ГоризонтальноеПоложениеЭлемента", ЗначенияГоризонтальноеПоложениеЭлемента());
	ДобавитьСтандартноеПеречисление(Результат, "ГруппировкаКолонок", ЗначенияГруппировкаКолонок());
	ДобавитьСтандартноеПеречисление(Результат, "ГруппировкаПодчиненныхЭлементовФормы", ЗначенияГруппировкаПодчиненныхЭлементовФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ГруппыИЭлементы", ЗначенияГруппыИЭлементы());
	
	ДобавитьСтандартноеПеречисление(Результат, "ИнтервалМеждуЭлементамиФормы", ЗначенияИнтервалМеждуЭлементамиФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ИспользованиеВывода", ЗначенияИспользованиеВывода());
	ДобавитьСтандартноеПеречисление(Результат, "ИспользованиеПолосыПрокрутки", ЗначенияИспользованиеПолосыПрокрутки());
	ДобавитьСтандартноеПеречисление(Результат, "ИспользованиеТекущейСтроки", ЗначенияИспользованиеТекущейСтроки());
	ДобавитьСтандартноеПеречисление(Результат, "ИспользованиеТекущейСтрокиТаблицы", ЗначенияИспользованиеТекущейСтрокиТаблицы());
	ДобавитьСтандартноеПеречисление(Результат, "ИсторияВыбораПриВводе", ЗначенияИсторияВыбораПриВводе());
	
	ДобавитьСтандартноеПеречисление(Результат, "НачальноеОтображениеДерева", ЗначенияНачальноеОтображениеДерева());
	ДобавитьСтандартноеПеречисление(Результат, "НачальноеОтображениеСписка", ЗначенияНачальноеОтображениеСписка());
	
	ДобавитьСтандартноеПеречисление(Результат, "ОбновлениеТекстаРедактирования", ЗначенияОбновлениеТекстаРедактирования());
	ДобавитьСтандартноеПеречисление(Результат, "ОриентацияЭлементаФормы", ЗначенияОриентацияЭлементаФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеГруппыКнопок", ЗначенияОтображениеГруппыКнопок());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеКнопки", ЗначенияОтображениеКнопки());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеКнопкиВыбора", ЗначенияОтображениеКнопкиВыбора());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеОбычнойГруппы", ЗначенияОтображениеОбычнойГруппы());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеПодсказки", ЗначенияОтображениеПодсказки());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеПредупрежденияПриРедактировании", ЗначенияОтображениеПредупрежденияПриРедактировании());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеРазметкиПолосыРегулирования", ЗначенияОтображениеРазметкиПолосыРегулирования());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеТаблицы", ЗначенияОтображениеТаблицы());
	ДобавитьСтандартноеПеречисление(Результат, "ОтображениеФигурыКнопки", ЗначенияОтображениеФигурыКнопки());
	
	ДобавитьСтандартноеПеречисление(Результат, "ПоведениеОбычнойГруппы", ЗначенияПоведениеОбычнойГруппы());
	ДобавитьСтандартноеПеречисление(Результат, "ПоведениеПриНедоступностиОсновногоСервера", ЗначенияПоведениеПриНедоступностиОсновногоСервера());
	ДобавитьСтандартноеПеречисление(Результат, "ПоведениеТаблицыПриСжатииПоГоризонтали", ЗначенияПоведениеТаблицыПриСжатииПоГоризонтали());
	ДобавитьСтандартноеПеречисление(Результат, "ПодсказкаАвтоЗаполненияПоляВвода", ЗначенияПодсказкаАвтоЗаполненияПоляВвода());
	ДобавитьСтандартноеПеречисление(Результат, "ПоискВТаблицеПриВводе", ЗначенияПоискВТаблицеПриВводе());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеЗаголовкаЭлементаФормы", ЗначенияПоложениеЗаголовкаЭлементаФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеКартинкиКнопкиФормы", ЗначенияПоложениеКартинкиКнопкиФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеКнопкиВКоманднойПанели", ЗначенияПоложениеКнопкиВКоманднойПанели());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеКоманднойПанелиЭлементаФормы", ЗначенияПоложениеКоманднойПанелиЭлементаФормы());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеСостоянияПросмотра", ЗначенияПоложениеСостоянияПросмотра());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеСтрокиПоиска", ЗначенияПоложениеСтрокиПоиска());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеТаблицыДиаграммыГанта", ЗначенияПоложениеТаблицыДиаграммыГанта());
	ДобавитьСтандартноеПеречисление(Результат, "ПоложениеУправленияПоиском", ЗначенияПоложениеУправленияПоиском());
	ДобавитьСтандартноеПеречисление(Результат, "ПроверкаПравописанияПриВводеТекста", ЗначенияПроверкаПравописанияПриВводеТекста());
	
	ДобавитьСтандартноеПеречисление(Результат, "РазмерКартинки", ЗначенияРазмерКартинки());
	ДобавитьСтандартноеПеречисление(Результат, "РежимОтображенияВыделения", ЗначенияРежимОтображенияВыделения());
	ДобавитьСтандартноеПеречисление(Результат, "РежимОтображенияВыделенияРисунков", ЗначенияРежимОтображенияВыделенияРисунков());
	ДобавитьСтандартноеПеречисление(Результат, "РежимАвтоОтображенияКнопкиОткрытия", ЗначенияРежимАвтоОтображенияКнопкиОткрытия());
	ДобавитьСтандартноеПеречисление(Результат, "РежимАвтоОтображенияКнопкиОчистки", ЗначенияРежимАвтоОтображенияКнопкиОчистки());
	ДобавитьСтандартноеПеречисление(Результат, "РежимВводаСтрокТаблицы", ЗначенияРежимВводаСтрокТаблицы());
	ДобавитьСтандартноеПеречисление(Результат, "РежимВыбораНезаполненного", ЗначенияРежимВыбораНезаполненного());
	ДобавитьСтандартноеПеречисление(Результат, "РежимВыделенияДаты", ЗначенияРежимВыделенияДаты());
	ДобавитьСтандартноеПеречисление(Результат, "РежимВыделенияЗначенийДиаграммыГанта", ЗначенияРежимВыделенияЗначенийДиаграммыГанта());
	ДобавитьСтандартноеПеречисление(Результат, "РежимВыделенияИнтерваловДиаграммыГанта", ЗначенияРежимВыделенияИнтерваловДиаграммыГанта());
	ДобавитьСтандартноеПеречисление(Результат, "РежимВыделенияСтрокиТаблицы", ЗначенияРежимВыделенияСтрокиТаблицы());
	ДобавитьСтандартноеПеречисление(Результат, "РежимВыделенияТаблицы", ЗначенияРежимВыделенияТаблицы());
	ДобавитьСтандартноеПеречисление(Результат, "РежимМасштабированияПросмотра", ЗначенияРежимМасштабированияПросмотра());
	ДобавитьСтандартноеПеречисление(Результат, "РежимСглаживанияИндикатора", ЗначенияРежимСглаживанияИндикатора());
	
	ДобавитьСтандартноеПеречисление(Результат, "СквозноеВыравнивание", ЗначенияСквозноеВыравнивание());
	ДобавитьСтандартноеПеречисление(Результат, "СпециальныйРежимВводаТекста", ЗначенияСпециальныйРежимВводаТекста());
	ДобавитьСтандартноеПеречисление(Результат, "СпособЗапросаОбновления", ЗначенияСпособЗапросаОбновления());
	ДобавитьСтандартноеПеречисление(Результат, "СпособПеретаскиванияФайлов", ЗначенияСпособПеретаскиванияФайлов());
	
	ДобавитьСтандартноеПеречисление(Результат, "ТекстКнопкиВводаЭкраннойКлавиатуры", ЗначенияТекстКнопкиВводаЭкраннойКлавиатуры());
	ДобавитьСтандартноеПеречисление(Результат, "ТипКурсоровТабличногоДокумента", ЗначенияТипКурсоровТабличногоДокумента());
	ДобавитьСтандартноеПеречисление(Результат, "ТипРамкиЭлементаУправления", ЗначенияТипРамкиЭлементаУправления());
	
	ДобавитьСтандартноеПеречисление(Результат, "ФигураКнопки", ЗначенияФигураКнопки());
	
	СформироватьЗначенияПеречислений(Результат);
	СформироватьПредставленияЗначенийПеречислений(Результат);
	
	Возврат Результат;
КонецФункции

Функция Значения1() Экспорт
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("АвтоИзменениеРегистраПриВводеТекста"), ЗначенияАвтоИзменениеРегистраПриВводеТекста());
	Результат.Вставить(Тип("АвтоИсправлениеПриВводеТекста"), ЗначенияАвтоИсправлениеПриВводеТекста());
	
	Результат.Вставить(Тип("Булево"), ЗначенияБулево());
	Результат.Вставить(МФПовтИсп.ТипБулевоНеопределено(), ЗначенияБулевоНеопределено());
	
	Результат.Вставить(Тип("ВажностьПриОтображении"), ЗначенияВажностьПриОтображении());
	Результат.Вставить(Тип("ВариантВыравниванияЭлементовИЗаголовков"), ЗначенияВариантВыравниванияЭлементовИЗаголовков());
	Результат.Вставить(Тип("ВариантУправленияВысотойТаблицы"), ЗначенияВариантУправленияВысотойТаблицы());
	Результат.Вставить(Тип("ВариантУправленияВысотойЭлемента"), ЗначенияВариантУправленияВысотойЭлемента());
	Результат.Вставить(Тип("ВертикальноеПоложениеЭлемента"), ЗначенияВертикальноеПоложениеЭлемента());
	Результат.Вставить(Тип("ВидГруппыФормы"), ЗначенияВидГруппыФормы());
	Результат.Вставить(Тип("ВидДекорацииФормы"), ЗначенияВидДекорацииФормы());
	Результат.Вставить(Тип("ВидКнопкиФормы"), ЗначенияВидКнопкиФормы());
	Результат.Вставить(Тип("ВидПереключателя"), ЗначенияВидПереключателя());
	Результат.Вставить(Тип("ВидПоляФормы"), ЗначенияВидПоляФормы());
	Результат.Вставить(Тип("ВидФлажка"), ЗначенияВидФлажка());
	
	Результат.Вставить(Тип("ГоризонтальноеПоложениеЭлемента"), ЗначенияГоризонтальноеПоложениеЭлемента());
	Результат.Вставить(Тип("ГруппировкаКолонок"), ЗначенияГруппировкаКолонок());
	Результат.Вставить(Тип("ГруппировкаПодчиненныхЭлементовФормы"), ЗначенияГруппировкаПодчиненныхЭлементовФормы());
	Результат.Вставить(Тип("ГруппыИЭлементы"), ЗначенияГруппыИЭлементы());
	
	Результат.Вставить(Тип("ИнтервалМеждуЭлементамиФормы"), ЗначенияИнтервалМеждуЭлементамиФормы());
	Результат.Вставить(Тип("ИспользованиеВывода"), ЗначенияИспользованиеВывода());
	Результат.Вставить(Тип("ИспользованиеПолосыПрокрутки"), ЗначенияИспользованиеПолосыПрокрутки());
	Результат.Вставить(Тип("ИспользованиеТекущейСтроки"), ЗначенияИспользованиеТекущейСтроки());
	Результат.Вставить(Тип("ИспользованиеТекущейСтрокиТаблицы"), ЗначенияИспользованиеТекущейСтрокиТаблицы());
	Результат.Вставить(Тип("ИсторияВыбораПриВводе"), ЗначенияИсторияВыбораПриВводе());
	
	Результат.Вставить(Тип("НачальноеОтображениеДерева"), ЗначенияНачальноеОтображениеДерева());
	Результат.Вставить(Тип("НачальноеОтображениеСписка"), ЗначенияНачальноеОтображениеСписка());
	
	Результат.Вставить(Тип("ОбновлениеТекстаРедактирования"), ЗначенияОбновлениеТекстаРедактирования());
	Результат.Вставить(Тип("ОриентацияЭлементаФормы"), ЗначенияОриентацияЭлементаФормы());
	Результат.Вставить(Тип("ОтображениеГруппыКнопок"), ЗначенияОтображениеГруппыКнопок());
	Результат.Вставить(Тип("ОтображениеКнопки"), ЗначенияОтображениеКнопки());
	Результат.Вставить(Тип("ОтображениеКнопкиВыбора"), ЗначенияОтображениеКнопкиВыбора());
	Результат.Вставить(Тип("ОтображениеОбычнойГруппы"), ЗначенияОтображениеОбычнойГруппы());
	Результат.Вставить(Тип("ОтображениеПодсказки"), ЗначенияОтображениеПодсказки());
	Результат.Вставить(Тип("ОтображениеПредупрежденияПриРедактировании"), ЗначенияОтображениеПредупрежденияПриРедактировании());
	Результат.Вставить(Тип("ОтображениеРазметкиПолосыРегулирования"), ЗначенияОтображениеРазметкиПолосыРегулирования());
	Результат.Вставить(Тип("ОтображениеТаблицы"), ЗначенияОтображениеТаблицы());
	Результат.Вставить(Тип("ОтображениеФигурыКнопки"), ЗначенияОтображениеФигурыКнопки());
	
	Результат.Вставить(Тип("ПоведениеОбычнойГруппы"), ЗначенияПоведениеОбычнойГруппы());
	Результат.Вставить(Тип("ПоведениеПриНедоступностиОсновногоСервера"), ЗначенияПоведениеПриНедоступностиОсновногоСервера());
	Результат.Вставить(Тип("ПоведениеТаблицыПриСжатииПоГоризонтали"), ЗначенияПоведениеТаблицыПриСжатииПоГоризонтали());
	Результат.Вставить(Тип("ПодсказкаАвтоЗаполненияПоляВвода"), ЗначенияПодсказкаАвтоЗаполненияПоляВвода());
	Результат.Вставить(Тип("ПоискВТаблицеПриВводе"), ЗначенияПоискВТаблицеПриВводе());
	Результат.Вставить(Тип("ПоложениеЗаголовкаЭлементаФормы"), ЗначенияПоложениеЗаголовкаЭлементаФормы());
	Результат.Вставить(Тип("ПоложениеКартинкиКнопкиФормы"), ЗначенияПоложениеКартинкиКнопкиФормы());
	Результат.Вставить(Тип("ПоложениеКнопкиВКоманднойПанели"), ЗначенияПоложениеКнопкиВКоманднойПанели());
	Результат.Вставить(Тип("ПоложениеКоманднойПанелиЭлементаФормы"), ЗначенияПоложениеКоманднойПанелиЭлементаФормы());
	Результат.Вставить(Тип("ПоложениеСостоянияПросмотра"), ЗначенияПоложениеСостоянияПросмотра());
	Результат.Вставить(Тип("ПоложениеСтрокиПоиска"), ЗначенияПоложениеСтрокиПоиска());
	Результат.Вставить(Тип("ПоложениеТаблицыДиаграммыГанта"), ЗначенияПоложениеТаблицыДиаграммыГанта());
	Результат.Вставить(Тип("ПоложениеУправленияПоиском"), ЗначенияПоложениеУправленияПоиском());
	Результат.Вставить(Тип("ПроверкаПравописанияПриВводеТекста"), ЗначенияПроверкаПравописанияПриВводеТекста());
	
	Результат.Вставить(Тип("РазмерКартинки"), ЗначенияРазмерКартинки());
	Результат.Вставить(Тип("РежимОтображенияВыделения"), ЗначенияРежимОтображенияВыделения());
	Результат.Вставить(Тип("РежимОтображенияВыделенияРисунков"), ЗначенияРежимОтображенияВыделенияРисунков());
	Результат.Вставить(Тип("РежимАвтоОтображенияКнопкиОткрытия"), ЗначенияРежимАвтоОтображенияКнопкиОткрытия());
	Результат.Вставить(Тип("РежимАвтоОтображенияКнопкиОчистки"), ЗначенияРежимАвтоОтображенияКнопкиОчистки());
	Результат.Вставить(Тип("РежимВводаСтрокТаблицы"), ЗначенияРежимВводаСтрокТаблицы());
	Результат.Вставить(Тип("РежимВыбораНезаполненного"), ЗначенияРежимВыбораНезаполненного());
	Результат.Вставить(Тип("РежимВыделенияДаты"), ЗначенияРежимВыделенияДаты());
	Результат.Вставить(Тип("РежимВыделенияЗначенийДиаграммыГанта"), ЗначенияРежимВыделенияЗначенийДиаграммыГанта());
	Результат.Вставить(Тип("РежимВыделенияИнтерваловДиаграммыГанта"), ЗначенияРежимВыделенияИнтерваловДиаграммыГанта());
	Результат.Вставить(Тип("РежимВыделенияСтрокиТаблицы"), ЗначенияРежимВыделенияСтрокиТаблицы());
	Результат.Вставить(Тип("РежимВыделенияТаблицы"), ЗначенияРежимВыделенияТаблицы());
	Результат.Вставить(Тип("РежимМасштабированияПросмотра"), ЗначенияРежимМасштабированияПросмотра());
	Результат.Вставить(Тип("РежимСглаживанияИндикатора"), ЗначенияРежимСглаживанияИндикатора());
	
	Результат.Вставить(Тип("СквозноеВыравнивание"), ЗначенияСквозноеВыравнивание());
	Результат.Вставить(Тип("СпециальныйРежимВводаТекста"), ЗначенияСпециальныйРежимВводаТекста());
	Результат.Вставить(Тип("СпособЗапросаОбновления"), ЗначенияСпособЗапросаОбновления());
	Результат.Вставить(Тип("СпособПеретаскиванияФайлов"), ЗначенияСпособПеретаскиванияФайлов());
	
	Результат.Вставить(Тип("ТекстКнопкиВводаЭкраннойКлавиатуры"), ЗначенияТекстКнопкиВводаЭкраннойКлавиатуры());
	Результат.Вставить(Тип("ТипКурсоровТабличногоДокумента"), ЗначенияТипКурсоровТабличногоДокумента());
	Результат.Вставить(Тип("ТипРамкиЭлементаУправления"), ЗначенияТипРамкиЭлементаУправления());
	
	Результат.Вставить(Тип("ФигураКнопки"), ЗначенияФигураКнопки());
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйЗначения()
	Результат = Новый Структура;
	
	Результат.Вставить("ИменаПеречисленийПоТипу", Новый Соответствие);
	Результат.Вставить("ЗначенияПеречисленийПоЯзыкам", Новый Соответствие);
	Результат.Вставить("Значения", Новый Соответствие);
	Результат.Вставить("ПредставленияЗначенийПеречисленийПоЯзыкам", Новый Соответствие);
	//Результат.Вставить("", Неопределено);
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьСтандартноеПеречисление(СтандартныеПеречисления, ИмяТипа, Значения)
	Исключения = Исключения();
	Если Исключения.Найти(ИмяТипа) = Неопределено Тогда
		ТипПеречисления = Тип(ИмяТипа);
	Иначе
		ТипПеречисления = ИмяТипа;
	КонецЕсли;
	// TODO 2025-04-12: Добавить имя перечисления в зависимости от языка.
	СтандартныеПеречисления.ИменаПеречисленийПоТипу.Вставить(ТипПеречисления, ИмяТипа);
	СтандартныеПеречисления.ЗначенияПеречисленийПоЯзыкам.Вставить(ТипПеречисления, Значения);
КонецПроцедуры

Функция Исключения()
	Результат = Новый Массив;
	
	Результат.Добавить(МФПовтИсп.ТипБулевоНеопределено());
	
	Возврат Результат;
КонецФункции

Процедура ДобавитьЗначениеСтандартногоПеречисления(ЗначенияСтандартногоПеречисления, ПредставлениеЗначения, Значение, Язык)
	ЗначенияПоЯзыку = ЗначенияСтандартногоПеречисления.Получить(Язык);
	Если ЗначенияПоЯзыку = Неопределено Тогда
		ЗначенияПоЯзыку = Новый Соответствие;
	КонецЕсли;
	
	ЗначенияПоЯзыку.Вставить(ПредставлениеЗначения, Значение);
	
	ЗначенияСтандартногоПеречисления.Вставить(Язык, ЗначенияПоЯзыку);
КонецПроцедуры

#Область Значения

Функция ЗначенияАвтоИзменениеРегистраПриВводеТекста()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", АвтоИзменениеРегистраПриВводеТекста.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВсеСимволы", АвтоИзменениеРегистраПриВводеТекста.ВсеСимволы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", АвтоИзменениеРегистраПриВводеТекста.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Предложения", АвтоИзменениеРегистраПриВводеТекста.Предложения, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Слова", АвтоИзменениеРегистраПриВводеТекста.Слова, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", АвтоИзменениеРегистраПриВводеТекста.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AllCharacters", АвтоИзменениеРегистраПриВводеТекста.ВсеСимволы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", АвтоИзменениеРегистраПриВводеТекста.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Sentences", АвтоИзменениеРегистраПриВводеТекста.Предложения, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Words", АвтоИзменениеРегистраПриВводеТекста.Слова, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияАвтоИсправлениеПриВводеТекста()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", АвтоИсправлениеПриВводеТекста.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Использовать", АвтоИсправлениеПриВводеТекста.Использовать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", АвтоИсправлениеПриВводеТекста.НеИспользовать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", АвтоИсправлениеПриВводеТекста.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Use", АвтоИсправлениеПриВводеТекста.Использовать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", АвтоИсправлениеПриВводеТекста.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияБулево()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Истина", Истина, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Ложь", Ложь, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Да", Истина, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", Ложь, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "1", Истина, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "0", Ложь, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "True", Истина, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "False", Ложь, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Yes", Истина, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "No", Ложь, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "1", Истина, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "0", Ложь, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияБулевоНеопределено()
	Результат = ЗначенияБулево();
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Неопределено", Неопределено, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Undefined", Неопределено, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВажностьПриОтображении()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ВажностьПриОтображении.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Высокая", ВажностьПриОтображении.Высокая, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Низкая", ВажностьПриОтображении.Низкая, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Обычная", ВажностьПриОтображении.Обычная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОченьВысокая", ВажностьПриОтображении.ОченьВысокая, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОченьНизкая", ВажностьПриОтображении.ОченьНизкая, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ВажностьПриОтображении.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "High", ВажностьПриОтображении.Высокая, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Low", ВажностьПриОтображении.Низкая, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Usual", ВажностьПриОтображении.Обычная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "VeryHigh", ВажностьПриОтображении.ОченьВысокая, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "VeryLow", ВажностьПриОтображении.ОченьНизкая, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВариантВыравниванияЭлементовИЗаголовков()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ВариантВыравниванияЭлементовИЗаголовков.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ВариантВыравниванияЭлементовИЗаголовков.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ЭлементыЛевоЗаголовкиЛево", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиЛево, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ЭлементыЛевоЗаголовкиПраво", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиПраво, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ЭлементыПравоЗаголовкиЛево", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ЭлементыПравоЗаголовкиПраво", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиПраво, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ВариантВыравниванияЭлементовИЗаголовков.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ВариантВыравниванияЭлементовИЗаголовков.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ItemsLeftTitlesLeft", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиЛево, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ItemsLeftTitlesRight", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиПраво, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ItemsRightTitlesLeft", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ItemsRightTitlesRight", ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиПраво, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВариантУправленияВысотойТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ВариантУправленияВысотойТаблицы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВСтрокахТаблицы", ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВСтрокахФормы", ВариантУправленияВысотойТаблицы.ВСтрокахФормы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПоСодержимому", ВариантУправленияВысотойТаблицы.ПоСодержимому, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ВариантУправленияВысотойТаблицы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UseHeightInTableRows", ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UseHeightInFormRows", ВариантУправленияВысотойТаблицы.ВСтрокахФормы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UseContentHeight", ВариантУправленияВысотойТаблицы.ПоСодержимому, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВариантУправленияВысотойЭлемента()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ВариантУправленияВысотойЭлемента.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВСтрокахФормы", ВариантУправленияВысотойЭлемента.ВСтрокахФормы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПоСодержимому", ВариантУправленияВысотойЭлемента.ПоСодержимому, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ВариантУправленияВысотойЭлемента.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UseHeightInFormRows", ВариантУправленияВысотойЭлемента.ВСтрокахФормы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UseContentHeight", ВариантУправленияВысотойЭлемента.ПоСодержимому, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВертикальноеПоложениеЭлемента()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ВертикальноеПоложениеЭлемента.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Верх", ВертикальноеПоложениеЭлемента.Верх, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Низ", ВертикальноеПоложениеЭлемента.Низ, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Центр", ВертикальноеПоложениеЭлемента.Центр, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ВертикальноеПоложениеЭлемента.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Top", ВертикальноеПоложениеЭлемента.Верх, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Bottom", ВертикальноеПоложениеЭлемента.Низ, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Center", ВертикальноеПоложениеЭлемента.Центр, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидГруппыФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ГруппаКнопок", ВидГруппыФормы.ГруппаКнопок, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ГруппаКолонок", ВидГруппыФормы.ГруппаКолонок, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КоманднаяПанель", ВидГруппыФормы.КоманднаяПанель, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КонтекстноеМеню", ВидГруппыФормы.КонтекстноеМеню, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОбычнаяГруппа", ВидГруппыФормы.ОбычнаяГруппа, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Подменю", ВидГруппыФормы.Подменю, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Страница", ВидГруппыФормы.Страница, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Страницы", ВидГруппыФормы.Страницы, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ButtonGroup", ВидГруппыФормы.ГруппаКнопок, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ColumnGroup", ВидГруппыФормы.ГруппаКолонок, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CommandBar", ВидГруппыФормы.КоманднаяПанель, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ContextMenu", ВидГруппыФормы.КонтекстноеМеню, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UsualGroup", ВидГруппыФормы.ОбычнаяГруппа, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Popup", ВидГруппыФормы.Подменю, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Page", ВидГруппыФормы.Страница, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Pages", ВидГруппыФормы.Страницы, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидДекорацииФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Картинка", ВидДекорацииФормы.Картинка, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Надпись", ВидДекорацииФормы.Надпись, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Picture", ВидДекорацииФормы.Картинка, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Label", ВидДекорацииФормы.Надпись, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидКнопкиФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Гиперссылка", ВидКнопкиФормы.Гиперссылка, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ГиперссылкаКоманднойПанели", ВидКнопкиФормы.ГиперссылкаКоманднойПанели, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КнопкаКоманднойПанели", ВидКнопкиФормы.КнопкаКоманднойПанели, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОбычнаяКнопка", ВидКнопкиФормы.ОбычнаяКнопка, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Hyperlink", ВидКнопкиФормы.Гиперссылка, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CommandBarHyperlink", ВидКнопкиФормы.ГиперссылкаКоманднойПанели, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CommandBarButton", ВидКнопкиФормы.КнопкаКоманднойПанели, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UsualButton", ВидКнопкиФормы.ОбычнаяКнопка, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидПереключателя()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ВидПереключателя.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Переключатель", ВидПереключателя.Переключатель, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Тумблер", ВидПереключателя.Тумблер, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ВидПереключателя.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "RadioButton", ВидПереключателя.Переключатель, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Tumbler", ВидПереключателя.Тумблер, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидПоляФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеHTMLДокумента", ВидПоляФормы.ПолеHTMLДокумента, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеPDFДокумента", ВидПоляФормы.ПолеPDFДокумента, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеВвода", ВидПоляФормы.ПолеВвода, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеГеографическойСхемы", ВидПоляФормы.ПолеГеографическойСхемы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеГрафическойСхемы", ВидПоляФормы.ПолеГрафическойСхемы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеДендрограммы", ВидПоляФормы.ПолеДендрограммы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеДиаграммы", ВидПоляФормы.ПолеДиаграммы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеДиаграммыГанта", ВидПоляФормы.ПолеДиаграммыГанта, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеИндикатора", ВидПоляФормы.ПолеИндикатора, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеКалендаря", ВидПоляФормы.ПолеКалендаря, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеКартинки", ВидПоляФормы.ПолеКартинки, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеНадписи", ВидПоляФормы.ПолеНадписи, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеПереключателя", ВидПоляФормы.ПолеПереключателя, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеПериода", ВидПоляФормы.ПолеПериода, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеПланировщика", ВидПоляФормы.ПолеПланировщика, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеПолосыРегулирования", ВидПоляФормы.ПолеПолосыРегулирования, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеТабличногоДокумента", ВидПоляФормы.ПолеТабличногоДокумента, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеТекстовогоДокумента", ВидПоляФормы.ПолеТекстовогоДокумента, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеФлажка", ВидПоляФормы.ПолеФлажка, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолеФорматированногоДокумента", ВидПоляФормы.ПолеФорматированногоДокумента, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "HTMLDocumentField", ВидПоляФормы.ПолеHTMLДокумента, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PDFDocumentField", ВидПоляФормы.ПолеPDFДокумента, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "InputField", ВидПоляФормы.ПолеВвода, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "GeographicalSchemaField", ВидПоляФормы.ПолеГеографическойСхемы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "GraphicalSchemaField", ВидПоляФормы.ПолеГрафическойСхемы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DendrogramField", ВидПоляФормы.ПолеДендрограммы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ChartField", ВидПоляФормы.ПолеДиаграммы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "GanttChartField", ВидПоляФормы.ПолеДиаграммыГанта, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ProgressBarField", ВидПоляФормы.ПолеИндикатора, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CalendarField", ВидПоляФормы.ПолеКалендаря, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PictureField", ВидПоляФормы.ПолеКартинки, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "LabelField", ВидПоляФормы.ПолеНадписи, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "RadioButtonField", ВидПоляФормы.ПолеПереключателя, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PeriodField", ВидПоляФормы.ПолеПериода, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PlannerField", ВидПоляФормы.ПолеПланировщика, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "TrackBarField", ВидПоляФормы.ПолеПолосыРегулирования, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "SpreadsheetDocumentField", ВидПоляФормы.ПолеТабличногоДокумента, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "TextDocumentField", ВидПоляФормы.ПолеТекстовогоДокумента, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CheckBoxField", ВидПоляФормы.ПолеФлажка, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "FormattedDocumentField", ВидПоляФормы.ПолеФорматированногоДокумента, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидФлажка()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ВидФлажка.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Выключатель", ВидФлажка.Выключатель, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Тумблер", ВидФлажка.Тумблер, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Флажок", ВидФлажка.Флажок, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ВидФлажка.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Switch", ВидФлажка.Выключатель, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Tumbler", ВидФлажка.Тумблер, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CheckBox", ВидФлажка.Флажок, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГоризонтальноеПоложениеЭлемента()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ГоризонтальноеПоложениеЭлемента.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Лево", ГоризонтальноеПоложениеЭлемента.Лево, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Право", ГоризонтальноеПоложениеЭлемента.Право, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Центр", ГоризонтальноеПоложениеЭлемента.Центр, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ГоризонтальноеПоложениеЭлемента.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Left", ГоризонтальноеПоложениеЭлемента.Лево, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Right", ГоризонтальноеПоложениеЭлемента.Право, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Center", ГоризонтальноеПоложениеЭлемента.Центр, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГруппировкаКолонок()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Вертикальная", ГруппировкаКолонок.Вертикальная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВЯчейке", ГруппировкаКолонок.ВЯчейке, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Горизонтальная", ГруппировкаКолонок.Горизонтальная, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Vertical", ГруппировкаКолонок.Вертикальная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "InCell", ГруппировкаКолонок.ВЯчейке, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Horizontal", ГруппировкаКолонок.Горизонтальная, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГруппировкаПодчиненныхЭлементовФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Вертикальная", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ГоризонтальнаяВсегда", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ГоризонтальнаяЕслиВозможно", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Vertical", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AlwaysHorizontal", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "HorizontalIfPossible", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГруппыИЭлементы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ГруппыИЭлементы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Группы", ГруппыИЭлементы.Группы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ГруппыИЭлементы", ГруппыИЭлементы.ГруппыИЭлементы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Элементы", ГруппыИЭлементы.Элементы, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ГруппыИЭлементы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Folders", ГруппыИЭлементы.Группы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "FoldersAndItems", ГруппыИЭлементы.ГруппыИЭлементы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Items", ГруппыИЭлементы.Элементы, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИнтервалМеждуЭлементамиФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ИнтервалМеждуЭлементамиФормы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Двойной", ИнтервалМеждуЭлементамиФормы.Двойной, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ИнтервалМеждуЭлементамиФормы.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Одинарный", ИнтервалМеждуЭлементамиФормы.Одинарный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Половинный", ИнтервалМеждуЭлементамиФормы.Половинный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Полуторный", ИнтервалМеждуЭлементамиФормы.Полуторный, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ИнтервалМеждуЭлементамиФормы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Double", ИнтервалМеждуЭлементамиФормы.Двойной, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ИнтервалМеждуЭлементамиФормы.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Single", ИнтервалМеждуЭлементамиФормы.Одинарный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Half", ИнтервалМеждуЭлементамиФормы.Половинный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "OneAndHalf", ИнтервалМеждуЭлементамиФормы.Полуторный, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеВывода()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ИспользованиеВывода.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Запретить", ИспользованиеВывода.Запретить, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Разрешить", ИспользованиеВывода.Разрешить, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ИспользованиеВывода.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Disable", ИспользованиеВывода.Запретить, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Enable", ИспользованиеВывода.Разрешить, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеПолосыПрокрутки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ИспользоватьАвтоматически", ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ИспользоватьВсегда", ИспользованиеПолосыПрокрутки.ИспользоватьВсегда, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", ИспользованиеПолосыПрокрутки.НеИспользовать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AutoUse", ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UseAlways", ИспользованиеПолосыПрокрутки.ИспользоватьВсегда, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", ИспользованиеПолосыПрокрутки.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеТекущейСтроки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ИспользованиеТекущейСтроки.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Использует", ИспользованиеТекущейСтроки.Использует, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользует", ИспользованиеТекущейСтроки.НеИспользует, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ИспользованиеТекущейСтроки.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Use", ИспользованиеТекущейСтроки.Использует, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", ИспользованиеТекущейСтроки.НеИспользует, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеТекущейСтрокиТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ИспользованиеТекущейСтрокиТаблицы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Выбор", ИспользованиеТекущейСтрокиТаблицы.Выбор, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображениеВыделения", ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделения, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображениеВыделенияИВыбор", ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделенияИВыбор, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ИспользованиеТекущейСтрокиТаблицы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Choice", ИспользованиеТекущейСтрокиТаблицы.Выбор, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "SelectionPresentation", ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделения, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "SelectionPresentationAndChoice", ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделенияИВыбор, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИсторияВыбораПриВводе()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ИсторияВыбораПриВводе.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", ИсторияВыбораПриВводе.НеИспользовать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ИсторияВыбораПриВводе.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", ИсторияВыбораПриВводе.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияНачальноеОтображениеДерева()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеРаскрывать", НачальноеОтображениеДерева.НеРаскрывать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "РаскрыватьВерхнийУровень", НачальноеОтображениеДерева.РаскрыватьВерхнийУровень, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "РаскрыватьВсеУровни", НачальноеОтображениеДерева.РаскрыватьВсеУровни, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "NoExpand", НачальноеОтображениеДерева.НеРаскрывать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ExpandTopLevel", НачальноеОтображениеДерева.РаскрыватьВерхнийУровень, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ExpandAllLevels", НачальноеОтображениеДерева.РаскрыватьВсеУровни, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияНачальноеОтображениеСписка()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", НачальноеОтображениеСписка.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Конец", НачальноеОтображениеСписка.Конец, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Начало", НачальноеОтображениеСписка.Начало, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", НачальноеОтображениеСписка.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "End", НачальноеОтображениеСписка.Конец, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Beginning", НачальноеОтображениеСписка.Начало, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОбновлениеТекстаРедактирования()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ОбновлениеТекстаРедактирования.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Всегда", ОбновлениеТекстаРедактирования.Всегда, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", ОбновлениеТекстаРедактирования.НеИспользовать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПриИзмененииЗначения", ОбновлениеТекстаРедактирования.ПриИзмененииЗначения, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ОбновлениеТекстаРедактирования.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Always", ОбновлениеТекстаРедактирования.Всегда, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", ОбновлениеТекстаРедактирования.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "OnValueChange", ОбновлениеТекстаРедактирования.ПриИзмененииЗначения, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОриентацияЭлементаФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Вертикально", ОриентацияЭлементаФормы.Вертикально, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Горизонтально", ОриентацияЭлементаФормы.Горизонтально, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Vertical", ОриентацияЭлементаФормы.Вертикально, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Horizontal", ОриентацияЭлементаФормы.Горизонтально, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеГруппыКнопок()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ОтображениеГруппыКнопок.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Компактное", ОтображениеГруппыКнопок.Компактное, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Обычное", ОтображениеГруппыКнопок.Обычное, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ОтображениеГруппыКнопок.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Compact", ОтображениеГруппыКнопок.Компактное, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Usual", ОтображениеГруппыКнопок.Обычное, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеКнопки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ОтображениеКнопки.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Картинка", ОтображениеКнопки.Картинка, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КартинкаИТекст", ОтображениеКнопки.КартинкаИТекст, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Текст", ОтображениеКнопки.Текст, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ОтображениеКнопки.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Picture", ОтображениеКнопки.Картинка, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PictureAndText", ОтображениеКнопки.КартинкаИТекст, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Text", ОтображениеКнопки.Текст, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеКнопкиВыбора()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ОтображениеКнопкиВыбора.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьВВыпадающемСписке", ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьВВыпадающемСпискеИВПолеВвода", ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьВПолеВвода", ОтображениеКнопкиВыбора.ОтображатьВПолеВвода, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ОтображениеКнопкиВыбора.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowInDropList", ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowInDropListAndInInputField", ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowInInputField", ОтображениеКнопкиВыбора.ОтображатьВПолеВвода, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеОбычнойГруппы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ОтображениеОбычнойГруппы.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОбычноеВыделение", ОтображениеОбычнойГруппы.ОбычноеВыделение, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "СильноеВыделение", ОтображениеОбычнойГруппы.СильноеВыделение, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "СлабоеВыделение", ОтображениеОбычнойГруппы.СлабоеВыделение, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ОтображениеОбычнойГруппы.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "NormalSeparation", ОтображениеОбычнойГруппы.ОбычноеВыделение, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "StrongSeparation", ОтображениеОбычнойГруппы.СильноеВыделение, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "WeakSeparation", ОтображениеОбычнойГруппы.СлабоеВыделение, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеПодсказки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ОтображениеПодсказки.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Всплывающая", ОтображениеПодсказки.Всплывающая, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Кнопка", ОтображениеПодсказки.Кнопка, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ОтображениеПодсказки.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьАвто", ОтображениеПодсказки.ОтображатьАвто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьСверху", ОтображениеПодсказки.ОтображатьСверху, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьСлева", ОтображениеПодсказки.ОтображатьСлева, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьСнизу", ОтображениеПодсказки.ОтображатьСнизу, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтображатьСправа", ОтображениеПодсказки.ОтображатьСправа, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ОтображениеПодсказки.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Balloon", ОтображениеПодсказки.Всплывающая, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Button", ОтображениеПодсказки.Кнопка, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ОтображениеПодсказки.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowAuto", ОтображениеПодсказки.ОтображатьАвто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowTop", ОтображениеПодсказки.ОтображатьСверху, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowLeft", ОтображениеПодсказки.ОтображатьСлева, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowBottom", ОтображениеПодсказки.ОтображатьСнизу, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ShowRight", ОтображениеПодсказки.ОтображатьСправа, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеПредупрежденияПриРедактировании()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ОтображениеПредупрежденияПриРедактировании.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеОтображать", ОтображениеПредупрежденияПриРедактировании.НеОтображать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Отображать", ОтображениеПредупрежденияПриРедактировании.Отображать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ОтображениеПредупрежденияПриРедактировании.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontShow", ОтображениеПредупрежденияПриРедактировании.НеОтображать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Show", ОтображениеПредупрежденияПриРедактировании.Отображать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеРазметкиПолосыРегулирования()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеОтображать", ОтображениеРазметкиПолосыРегулирования.НеОтображать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "СверхуИлиСлева", ОтображениеРазметкиПолосыРегулирования.СверхуИлиСлева, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "СнизуИлиСправа", ОтображениеРазметкиПолосыРегулирования.СнизуИлиСправа, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "СОбоихСторон", ОтображениеРазметкиПолосыРегулирования.СОбоихСторон, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontShow", ОтображениеРазметкиПолосыРегулирования.НеОтображать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "TopLeft", ОтображениеРазметкиПолосыРегулирования.СверхуИлиСлева, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "BottomRight", ОтображениеРазметкиПолосыРегулирования.СнизуИлиСправа, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "BothSides", ОтображениеРазметкиПолосыРегулирования.СОбоихСторон, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Дерево", ОтображениеТаблицы.Дерево, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ИерархическийСписок", ОтображениеТаблицы.ИерархическийСписок, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Список", ОтображениеТаблицы.Список, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Tree", ОтображениеТаблицы.Дерево, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "HierarchicalList", ОтображениеТаблицы.ИерархическийСписок, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "List", ОтображениеТаблицы.Список, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеФигурыКнопки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ОтображениеФигурыКнопки.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Всегда", ОтображениеФигурыКнопки.Всегда, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ОтображениеФигурыКнопки.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПриАктивности", ОтображениеФигурыКнопки.ПриАктивности, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ОтображениеФигурыКнопки.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Always", ОтображениеФигурыКнопки.Всегда, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ОтображениеФигурыКнопки.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "WhenActive", ОтображениеФигурыКнопки.ПриАктивности, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоведениеОбычнойГруппы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоведениеОбычнойГруппы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Всплывающая", ПоведениеОбычнойГруппы.Всплывающая, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Обычное", ПоведениеОбычнойГруппы.Обычное, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Свертываемая", ПоведениеОбычнойГруппы.Свертываемая, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоведениеОбычнойГруппы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PopUp", ПоведениеОбычнойГруппы.Всплывающая, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Usual", ПоведениеОбычнойГруппы.Обычное, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Collapsible", ПоведениеОбычнойГруппы.Свертываемая, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПодсказкаАвтоЗаполненияПоляВвода()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "АдресЭлектроннойПочты", ПодсказкаАвтоЗаполненияПоляВвода.АдресЭлектроннойПочты, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Город", ПодсказкаАвтоЗаполненияПоляВвода.Город, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Имя", ПодсказкаАвтоЗаполненияПоляВвода.Имя, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ИмяПользователя", ПодсказкаАвтоЗаполненияПоляВвода.ИмяПользователя, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Индекс", ПодсказкаАвтоЗаполненияПоляВвода.Индекс, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", ПодсказкаАвтоЗаполненияПоляВвода.НеИспользовать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НовыйПароль", ПодсказкаАвтоЗаполненияПоляВвода.НовыйПароль, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НомерБанковскойКарты", ПодсказкаАвтоЗаполненияПоляВвода.НомерБанковскойКарты, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НомерТелефона", ПодсказкаАвтоЗаполненияПоляВвода.НомерТелефона, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОдноразовыйКод", ПодсказкаАвтоЗаполненияПоляВвода.ОдноразовыйКод, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Отчество", ПодсказкаАвтоЗаполненияПоляВвода.Отчество, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Пароль", ПодсказкаАвтоЗаполненияПоляВвода.Пароль, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПолноеИмя", ПодсказкаАвтоЗаполненияПоляВвода.ПолноеИмя, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПрефиксИмени", ПодсказкаАвтоЗаполненияПоляВвода.ПрефиксИмени, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Регион", ПодсказкаАвтоЗаполненияПоляВвода.Регион, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Страна", ПодсказкаАвтоЗаполненияПоляВвода.Страна, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "СуффиксИмени", ПодсказкаАвтоЗаполненияПоляВвода.СуффиксИмени, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Улица", ПодсказкаАвтоЗаполненияПоляВвода.Улица, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Фамилия", ПодсказкаАвтоЗаполненияПоляВвода.Фамилия, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Email", ПодсказкаАвтоЗаполненияПоляВвода.АдресЭлектроннойПочты, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "City", ПодсказкаАвтоЗаполненияПоляВвода.Город, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "GivenName", ПодсказкаАвтоЗаполненияПоляВвода.Имя, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "UserName", ПодсказкаАвтоЗаполненияПоляВвода.ИмяПользователя, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PostalCode", ПодсказкаАвтоЗаполненияПоляВвода.Индекс, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", ПодсказкаАвтоЗаполненияПоляВвода.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "NewPassword", ПодсказкаАвтоЗаполненияПоляВвода.НовыйПароль, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CreditCardNumber", ПодсказкаАвтоЗаполненияПоляВвода.НомерБанковскойКарты, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PhoneNumber", ПодсказкаАвтоЗаполненияПоляВвода.НомерТелефона, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "OneTimeCode", ПодсказкаАвтоЗаполненияПоляВвода.ОдноразовыйКод, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "MiddleName", ПодсказкаАвтоЗаполненияПоляВвода.Отчество, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Password", ПодсказкаАвтоЗаполненияПоляВвода.Пароль, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "FullName", ПодсказкаАвтоЗаполненияПоляВвода.ПолноеИмя, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "NamePrefix", ПодсказкаАвтоЗаполненияПоляВвода.ПрефиксИмени, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Region", ПодсказкаАвтоЗаполненияПоляВвода.Регион, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Country", ПодсказкаАвтоЗаполненияПоляВвода.Страна, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "NameSuffix", ПодсказкаАвтоЗаполненияПоляВвода.СуффиксИмени, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Street", ПодсказкаАвтоЗаполненияПоляВвода.Улица, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "FamilyName", ПодсказкаАвтоЗаполненияПоляВвода.Фамилия, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоискВТаблицеПриВводе()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоискВТаблицеПриВводе.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Использовать", ПоискВТаблицеПриВводе.Использовать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", ПоискВТаблицеПриВводе.НеИспользовать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоискВТаблицеПриВводе.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Use", ПоискВТаблицеПриВводе.Использовать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", ПоискВТаблицеПриВводе.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПроверкаПравописанияПриВводеТекста()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПроверкаПравописанияПриВводеТекста.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Использовать", ПроверкаПравописанияПриВводеТекста.Использовать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", ПроверкаПравописанияПриВводеТекста.НеИспользовать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПроверкаПравописанияПриВводеТекста.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Use", ПроверкаПравописанияПриВводеТекста.Использовать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", ПроверкаПравописанияПриВводеТекста.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоведениеПриНедоступностиОсновногоСервера()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоведениеПриНедоступностиОсновногоСервера.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИзменятьПоведение", ПоведениеПриНедоступностиОсновногоСервера.НеИзменятьПоведение, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ОтключитьДоступность", ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоведениеПриНедоступностиОсновногоСервера.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontChangeBehavior", ПоведениеПриНедоступностиОсновногоСервера.НеИзменятьПоведение, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "MakeDisable", ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоведениеТаблицыПриСжатииПоГоризонтали()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоведениеТаблицыПриСжатииПоГоризонтали.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПереноситьЭлементыПоВажности", ПоведениеТаблицыПриСжатииПоГоризонтали.ПереноситьЭлементыПоВажности, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "СкрыватьЭлементыПоВажности", ПоведениеТаблицыПриСжатииПоГоризонтали.СкрыватьЭлементыПоВажности, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоведениеТаблицыПриСжатииПоГоризонтали.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "MoveItemsByImportance", ПоведениеТаблицыПриСжатииПоГоризонтали.ПереноситьЭлементыПоВажности, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "HideItemsByImportance", ПоведениеТаблицыПриСжатииПоГоризонтали.СкрыватьЭлементыПоВажности, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеЗаголовкаЭлементаФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеЗаголовкаЭлементаФормы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Верх", ПоложениеЗаголовкаЭлементаФормы.Верх, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Лево", ПоложениеЗаголовкаЭлементаФормы.Лево, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ПоложениеЗаголовкаЭлементаФормы.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Низ", ПоложениеЗаголовкаЭлементаФормы.Низ, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Право", ПоложениеЗаголовкаЭлементаФормы.Право, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеЗаголовкаЭлементаФормы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Top", ПоложениеЗаголовкаЭлементаФормы.Верх, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Left", ПоложениеЗаголовкаЭлементаФормы.Лево, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ПоложениеЗаголовкаЭлементаФормы.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Bottom", ПоложениеЗаголовкаЭлементаФормы.Низ, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Right", ПоложениеЗаголовкаЭлементаФормы.Право, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеКартинкиКнопкиФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеКартинкиКнопкиФормы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Лево", ПоложениеКартинкиКнопкиФормы.Лево, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Право", ПоложениеКартинкиКнопкиФормы.Право, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеКартинкиКнопкиФормы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Left", ПоложениеКартинкиКнопкиФормы.Лево, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Right", ПоложениеКартинкиКнопкиФормы.Право, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеКнопкиВКоманднойПанели()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеКнопкиВКоманднойПанели.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВДополнительномПодменю", ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВКоманднойПанели", ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВКоманднойПанелиИВДополнительномПодменю", ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеКнопкиВКоманднойПанели.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "InAdditionalSubmenu", ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "InCommandBar", ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "InCommandBarAndInAdditionalSubmenu", ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеКоманднойПанелиЭлементаФормы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеКоманднойПанелиЭлементаФормы.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Верх", ПоложениеКоманднойПанелиЭлементаФормы.Верх, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ПоложениеКоманднойПанелиЭлементаФормы.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Низ", ПоложениеКоманднойПанелиЭлементаФормы.Низ, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеКоманднойПанелиЭлементаФормы.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Top", ПоложениеКоманднойПанелиЭлементаФормы.Верх, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ПоложениеКоманднойПанелиЭлементаФормы.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Bottom", ПоложениеКоманднойПанелиЭлементаФормы.Низ, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеСостоянияПросмотра()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеСостоянияПросмотра.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Верх", ПоложениеСостоянияПросмотра.Верх, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ПоложениеСостоянияПросмотра.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Низ", ПоложениеСостоянияПросмотра.Низ, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеСостоянияПросмотра.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Top", ПоложениеСостоянияПросмотра.Верх, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ПоложениеСостоянияПросмотра.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Bottom", ПоложениеСостоянияПросмотра.Низ, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеСтрокиПоиска()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеСтрокиПоиска.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Верх", ПоложениеСтрокиПоиска.Верх, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ЗаголовокФормы", ПоложениеСтрокиПоиска.ЗаголовокФормы, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КоманднаяПанель", ПоложениеСтрокиПоиска.КоманднаяПанель, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ПоложениеСтрокиПоиска.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Низ", ПоложениеСтрокиПоиска.Низ, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПотянутьСверху", ПоложениеСтрокиПоиска.ПотянутьСверху, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеСтрокиПоиска.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Top", ПоложениеСтрокиПоиска.Верх, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "FormCaption", ПоложениеСтрокиПоиска.ЗаголовокФормы, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CommandBar", ПоложениеСтрокиПоиска.КоманднаяПанель, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ПоложениеСтрокиПоиска.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Bottom", ПоложениеСтрокиПоиска.Низ, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PullFromTop", ПоложениеСтрокиПоиска.ПотянутьСверху, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеТаблицыДиаграммыГанта()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеТаблицыДиаграммыГанта.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Лево", ПоложениеТаблицыДиаграммыГанта.Лево, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ПоложениеТаблицыДиаграммыГанта.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Право", ПоложениеТаблицыДиаграммыГанта.Право, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеТаблицыДиаграммыГанта.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Left", ПоложениеТаблицыДиаграммыГанта.Лево, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ПоложениеТаблицыДиаграммыГанта.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Right", ПоложениеТаблицыДиаграммыГанта.Право, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеУправленияПоиском()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ПоложениеУправленияПоиском.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КоманднаяПанель", ПоложениеУправленияПоиском.КоманднаяПанель, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", ПоложениеУправленияПоиском.Нет, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ПоложениеУправленияПоиском.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "CommandBar", ПоложениеУправленияПоиском.КоманднаяПанель, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", ПоложениеУправленияПоиском.Нет, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРазмерКартинки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "АвтоРазмер", РазмерКартинки.АвтоРазмер, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "АвтоРазмерБезУчетаМасштаба", РазмерКартинки.АвтоРазмерБезУчетаМасштаба, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПоРазмеруШрифта", РазмерКартинки.ПоРазмеруШрифта, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Пропорционально", РазмерКартинки.Пропорционально, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Растянуть", РазмерКартинки.Растянуть, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "РеальныйРазмер", РазмерКартинки.РеальныйРазмер, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "РеальныйРазмерБезУчетаМасштаба", РазмерКартинки.РеальныйРазмерБезУчетаМасштаба, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Черепица", РазмерКартинки.Черепица, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AutoSize", РазмерКартинки.АвтоРазмер, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AutoSizeIgnoreScale", РазмерКартинки.АвтоРазмерБезУчетаМасштаба, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ByFontSize", РазмерКартинки.ПоРазмеруШрифта, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Proportionally", РазмерКартинки.Пропорционально, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Stretch", РазмерКартинки.Растянуть, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "RealSize", РазмерКартинки.РеальныйРазмер, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "RealSizeIgnoreScale", РазмерКартинки.РеальныйРазмерБезУчетаМасштаба, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Tile", РазмерКартинки.Черепица, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимОтображенияВыделения()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Всегда", РежимОтображенияВыделения.Всегда, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеОтображать", РежимОтображенияВыделения.НеОтображать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПриАктивности", РежимОтображенияВыделения.ПриАктивности, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПриВыделенииНесколькихЯчеек", РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеек, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПриВыделенииНесколькихЯчеекПриАктивности", РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеекПриАктивности, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Always", РежимОтображенияВыделения.Всегда, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontShow", РежимОтображенияВыделения.НеОтображать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "WhenActive", РежимОтображенияВыделения.ПриАктивности, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "WhenMultipleCellsSelected", РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеек, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "WhenMultipleCellsSelectedWhenActive", РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеекПриАктивности, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимОтображенияВыделенияРисунков()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", РежимОтображенияВыделенияРисунков.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеОтображать", РежимОтображенияВыделенияРисунков.НеОтображать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Отображать", РежимОтображенияВыделенияРисунков.Отображать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", РежимОтображенияВыделенияРисунков.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontShow", РежимОтображенияВыделенияРисунков.НеОтображать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Show", РежимОтображенияВыделенияРисунков.Отображать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимАвтоОтображенияКнопкиОткрытия()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", РежимАвтоОтображенияКнопкиОткрытия.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Всегда", РежимАвтоОтображенияКнопкиОткрытия.Всегда, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ТолькоДляЗаполненного", РежимАвтоОтображенияКнопкиОткрытия.ТолькоДляЗаполненного, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", РежимАвтоОтображенияКнопкиОткрытия.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Always", РежимАвтоОтображенияКнопкиОткрытия.Всегда, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "FilledOnly", РежимАвтоОтображенияКнопкиОткрытия.ТолькоДляЗаполненного, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимАвтоОтображенияКнопкиОчистки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "АвтоРазмер", РежимАвтоОтображенияКнопкиОчистки.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Всегда", РежимАвтоОтображенияКнопкиОчистки.Всегда, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ТолькоДляЗаполненного", РежимАвтоОтображенияКнопкиОчистки.ТолькоДляЗаполненного, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", РежимАвтоОтображенияКнопкиОчистки.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Always", РежимАвтоОтображенияКнопкиОчистки.Всегда, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "FilledOnly", РежимАвтоОтображенияКнопкиОчистки.ТолькоДляЗаполненного, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВводаСтрокТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВКонецОкна", РежимВводаСтрокТаблицы.ВКонецОкна, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ВКонецСписка", РежимВводаСтрокТаблицы.ВКонецСписка, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПередТекущейСтрокой", РежимВводаСтрокТаблицы.ПередТекущейСтрокой, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПослеТекущейСтроки", РежимВводаСтрокТаблицы.ПослеТекущейСтроки, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "EndOfWindow", РежимВводаСтрокТаблицы.ВКонецОкна, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "EndOfList", РежимВводаСтрокТаблицы.ВКонецСписка, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "BeforeCurrentRow", РежимВводаСтрокТаблицы.ПередТекущейСтрокой, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AfterCurrentRow", РежимВводаСтрокТаблицы.ПослеТекущейСтроки, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыбораНезаполненного()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПриАктивизации", РежимВыбораНезаполненного.ПриАктивизации, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПриНажатииEnter", РежимВыбораНезаполненного.ПриНажатииEnter, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "OnActivate", РежимВыбораНезаполненного.ПриАктивизации, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "OnEnterPressed", РежимВыбораНезаполненного.ПриНажатииEnter, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияДаты()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Интервал", РежимВыделенияДаты.Интервал, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Множественный", РежимВыделенияДаты.Множественный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Одиночный", РежимВыделенияДаты.Одиночный, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Interval", РежимВыделенияДаты.Интервал, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Multiple", РежимВыделенияДаты.Множественный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Single", РежимВыделенияДаты.Одиночный, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияЗначенийДиаграммыГанта()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", РежимВыделенияЗначенийДиаграммыГанта.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Множественный", РежимВыделенияЗначенийДиаграммыГанта.Множественный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", РежимВыделенияЗначенийДиаграммыГанта.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Одиночный", РежимВыделенияЗначенийДиаграммыГанта.Одиночный, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", РежимВыделенияЗначенийДиаграммыГанта.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Multiple", РежимВыделенияЗначенийДиаграммыГанта.Множественный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", РежимВыделенияЗначенийДиаграммыГанта.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Single", РежимВыделенияЗначенийДиаграммыГанта.Одиночный, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияИнтерваловДиаграммыГанта()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", РежимВыделенияИнтерваловДиаграммыГанта.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Множественный", РежимВыделенияИнтерваловДиаграммыГанта.Множественный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", РежимВыделенияИнтерваловДиаграммыГанта.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Одиночный", РежимВыделенияИнтерваловДиаграммыГанта.Одиночный, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", РежимВыделенияИнтерваловДиаграммыГанта.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Multiple", РежимВыделенияИнтерваловДиаграммыГанта.Множественный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", РежимВыделенияИнтерваловДиаграммыГанта.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Single", РежимВыделенияИнтерваловДиаграммыГанта.Одиночный, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияСтрокиТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Строка", РежимВыделенияСтрокиТаблицы.Строка, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Ячейка", РежимВыделенияСтрокиТаблицы.Ячейка, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Row", РежимВыделенияСтрокиТаблицы.Строка, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Cell", РежимВыделенияСтрокиТаблицы.Ячейка, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Множественный", РежимВыделенияТаблицы.Множественный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Одиночный", РежимВыделенияТаблицы.Одиночный, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "MultiRow", РежимВыделенияТаблицы.Множественный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "SingleRow", РежимВыделенияТаблицы.Одиночный, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимМасштабированияПросмотра()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", РежимМасштабированияПросмотра.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Крупный", РежимМасштабированияПросмотра.Крупный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Обычный", РежимМасштабированияПросмотра.Обычный, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", РежимМасштабированияПросмотра.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Large", РежимМасштабированияПросмотра.Крупный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Normal", РежимМасштабированияПросмотра.Обычный, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимСглаживанияИндикатора()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Плавный", РежимСглаживанияИндикатора.Плавный, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Прерывистый", РежимСглаживанияИндикатора.Прерывистый, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПрерывистыйНаклонный", РежимСглаживанияИндикатора.ПрерывистыйНаклонный, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Smooth", РежимСглаживанияИндикатора.Плавный, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Broken", РежимСглаживанияИндикатора.Прерывистый, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "BrokenTilt", РежимСглаживанияИндикатора.ПрерывистыйНаклонный, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСквозноеВыравнивание()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", СквозноеВыравнивание.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Использовать", СквозноеВыравнивание.Использовать, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НеИспользовать", СквозноеВыравнивание.НеИспользовать, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", СквозноеВыравнивание.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Use", СквозноеВыравнивание.Использовать, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DontUse", СквозноеВыравнивание.НеИспользовать, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСпециальныйРежимВводаТекста()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Email", СпециальныйРежимВводаТекста.Email, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "URL", СпециальныйРежимВводаТекста.URL, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", СпециальныйРежимВводаТекста.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", СпециальныйРежимВводаТекста.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "НомерТелефона", СпециальныйРежимВводаТекста.НомерТелефона, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Цифры", СпециальныйРежимВводаТекста.Цифры, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ЦифрыИПунктуация", СпециальныйРежимВводаТекста.ЦифрыИПунктуация, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", СпециальныйРежимВводаТекста.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", СпециальныйРежимВводаТекста.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PhoneNumber", СпециальныйРежимВводаТекста.НомерТелефона, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Digits", СпециальныйРежимВводаТекста.Цифры, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DigitsAndPunctuation", СпециальныйРежимВводаТекста.ЦифрыИПунктуация, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСпособЗапросаОбновления()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Нет", СпособЗапросаОбновления.Нет, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПотянутьСверху", СпособЗапросаОбновления.ПотянутьСверху, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПотянутьСверхуИлиСнизу", СпособЗапросаОбновления.ПотянутьСверхуИлиСнизу, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ПотянутьСнизу", СпособЗапросаОбновления.ПотянутьСнизу, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "None", СпособЗапросаОбновления.Нет, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PullFromTop", СпособЗапросаОбновления.ПотянутьСверху, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PullFromTopOrBottom", СпособЗапросаОбновления.ПотянутьСверхуИлиСнизу, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "PullFromBottom", СпособЗапросаОбновления.ПотянутьСнизу, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСпособПеретаскиванияФайлов()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КакСсылкаНаФайл", СпособПеретаскиванияФайлов.КакСсылкаНаФайл, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "КакФайл", СпособПеретаскиванияФайлов.КакФайл, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AsFileRef", СпособПеретаскиванияФайлов.КакСсылкаНаФайл, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "AsFile", СпособПеретаскиванияФайлов.КакФайл, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияТекстКнопкиВводаЭкраннойКлавиатуры()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ТекстКнопкиВводаЭкраннойКлавиатуры.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Ввод", ТекстКнопкиВводаЭкраннойКлавиатуры.Ввод, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Готово", ТекстКнопкиВводаЭкраннойКлавиатуры.Готово, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Далее", ТекстКнопкиВводаЭкраннойКлавиатуры.Далее, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Найти", ТекстКнопкиВводаЭкраннойКлавиатуры.Найти, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Отправить", ТекстКнопкиВводаЭкраннойКлавиатуры.Отправить, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Перейти", ТекстКнопкиВводаЭкраннойКлавиатуры.Перейти, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Подключиться", ТекстКнопкиВводаЭкраннойКлавиатуры.Подключиться, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Продолжить", ТекстКнопкиВводаЭкраннойКлавиатуры.Продолжить, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ТекстКнопкиВводаЭкраннойКлавиатуры.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Return", ТекстКнопкиВводаЭкраннойКлавиатуры.Ввод, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Done", ТекстКнопкиВводаЭкраннойКлавиатуры.Готово, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Next", ТекстКнопкиВводаЭкраннойКлавиатуры.Далее, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Search", ТекстКнопкиВводаЭкраннойКлавиатуры.Найти, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Send", ТекстКнопкиВводаЭкраннойКлавиатуры.Отправить, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Go", ТекстКнопкиВводаЭкраннойКлавиатуры.Перейти, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Join", ТекстКнопкиВводаЭкраннойКлавиатуры.Подключиться, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Continue", ТекстКнопкиВводаЭкраннойКлавиатуры.Продолжить, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияТипКурсоровТабличногоДокумента()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Обычные", ТипКурсоровТабличногоДокумента.Обычные, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Специальные", ТипКурсоровТабличногоДокумента.Специальные, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Regular", ТипКурсоровТабличногоДокумента.Обычные, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Special", ТипКурсоровТабличногоДокумента.Специальные, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияТипРамкиЭлементаУправления()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "БезРамки", ТипРамкиЭлементаУправления.БезРамки, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Вдавленная", ТипРамкиЭлементаУправления.Вдавленная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Выпуклая", ТипРамкиЭлементаУправления.Выпуклая, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Двойная", ТипРамкиЭлементаУправления.Двойная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ДвойноеПодчеркивание", ТипРамкиЭлементаУправления.ДвойноеПодчеркивание, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Одинарная", ТипРамкиЭлементаУправления.Одинарная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Подчеркивание", ТипРамкиЭлементаУправления.Подчеркивание, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Скругленная", ТипРамкиЭлементаУправления.Скругленная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "ЧертаСверху", ТипРамкиЭлементаУправления.ЧертаСверху, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "WithoutBorder", ТипРамкиЭлементаУправления.БезРамки, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Indented", ТипРамкиЭлементаУправления.Вдавленная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Embossed", ТипРамкиЭлементаУправления.Выпуклая, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Double", ТипРамкиЭлементаУправления.Двойная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "DoubleUnderline", ТипРамкиЭлементаУправления.ДвойноеПодчеркивание, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Single", ТипРамкиЭлементаУправления.Одинарная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Underline", ТипРамкиЭлементаУправления.Подчеркивание, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Rounded", ТипРамкиЭлементаУправления.Скругленная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Overline", ТипРамкиЭлементаУправления.ЧертаСверху, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

Функция ЗначенияФигураКнопки()
	Результат = Новый Соответствие;
	
	// русский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Авто", ФигураКнопки.Авто, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Обычная", ФигураКнопки.Обычная, МФПовтИсп.РусскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Овал", ФигураКнопки.Овал, МФПовтИсп.РусскийЯзык());
	
	// английский
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Auto", ФигураКнопки.Авто, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Usual", ФигураКнопки.Обычная, МФПовтИсп.АнглийскийЯзык());
	ДобавитьЗначениеСтандартногоПеречисления(Результат, "Oval", ФигураКнопки.Овал, МФПовтИсп.АнглийскийЯзык());
	
	Возврат Результат;
КонецФункции

#КонецОбласти

Процедура СформироватьЗначенияПеречислений(Значения)
	Для Каждого Элемент Из Значения.ЗначенияПеречисленийПоЯзыкам Цикл
		ТипПеречисления = Элемент.Ключ;
		ЗначенияПеречисления = Новый Соответствие;
		
		Для Каждого Язык Из Элемент.Значение Цикл
			Для Каждого ЗначенияЯзыка Из Язык.Значение Цикл
				ЗначенияПеречисления.Вставить(ВРег(ЗначенияЯзыка.Ключ), ЗначенияЯзыка.Значение);
			КонецЦикла;
		КонецЦикла;
		
		Значения.Значения.Вставить(ТипПеречисления, ЗначенияПеречисления);
	КонецЦикла;
КонецПроцедуры

Процедура СформироватьПредставленияЗначенийПеречислений(Значения)
	Для Каждого Элемент Из Значения.ЗначенияПеречисленийПоЯзыкам Цикл
		ТипПеречисления = Элемент.Ключ;
		
		Для Каждого Язык Из Элемент.Значение Цикл
			ПредставленияЗначений = Значения.ПредставленияЗначенийПеречисленийПоЯзыкам.Получить(Язык.Ключ);
			Если ПредставленияЗначений = Неопределено Тогда
				ПредставленияЗначений = Новый Соответствие;
			КонецЕсли;
			Для Каждого ЗначенияЯзыка Из Язык.Значение Цикл
				ПредставленияЗначений.Вставить(
					ЗначенияЯзыка.Значение,
					СтрШаблон(
						"%1.%2",
						Значения.ИменаПеречисленийПоТипу.Получить(Элемент.Ключ),
						ЗначенияЯзыка.Ключ
					)
				);
			КонецЦикла;
			Значения.ПредставленияЗначенийПеречисленийПоЯзыкам.Вставить(Язык.Ключ, ПредставленияЗначений);
		КонецЦикла;
	КонецЦикла;
	
	Коллекция = Значения.ПредставленияЗначенийПеречисленийПоЯзыкам.Получить(МФПовтИсп.РусскийЯзык());
	Коллекция.Вставить(Неопределено, "Неопределено");
	Коллекция.Вставить(Истина, "Истина");
	Коллекция.Вставить(Ложь, "Ложь");
		
	Коллекция = Значения.ПредставленияЗначенийПеречисленийПоЯзыкам.Получить(МФПовтИсп.АнглийскийЯзык());
	Коллекция.Вставить(Неопределено, "Undefined");
	Коллекция.Вставить(Истина, "True");
	Коллекция.Вставить(Ложь, "False");
КонецПроцедуры

#КонецОбласти
