//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипЭлементаФормы() Экспорт
	Возврат Тип("ПолеФормы");
КонецФункции

Функция Идентификаторы() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("ПОЛЕФОРМЫ");
	
	Возврат Результат;
КонецФункции

Функция ЗависимостиСвойств() Экспорт
	Результат = Новый Структура;
	
	ИмяСвойстваВид = МФОбъектыФормыСлужебный.ИмяСвойстваВид();
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "Независимый", Неопределено, Неопределено);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеHTMLДокумента", ИмяСвойстваВид, ВидПоляФормы.ПолеHTMLДокумента);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеPDFДокумента", ИмяСвойстваВид, ВидПоляФормы.ПолеPDFДокумента);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеВвода", ИмяСвойстваВид, ВидПоляФормы.ПолеВвода);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеГеографическойСхемы", ИмяСвойстваВид, ВидПоляФормы.ПолеГеографическойСхемы);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеГрафическойСхемы", ИмяСвойстваВид, ВидПоляФормы.ПолеГрафическойСхемы);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеДендрограммы", ИмяСвойстваВид, ВидПоляФормы.ПолеДендрограммы);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеДиаграммы", ИмяСвойстваВид, ВидПоляФормы.ПолеДиаграммы);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеДиаграммыГанта", ИмяСвойстваВид, ВидПоляФормы.ПолеДиаграммыГанта);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеИндикатора", ИмяСвойстваВид, ВидПоляФормы.ПолеИндикатора);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеКалендаря", ИмяСвойстваВид, ВидПоляФормы.ПолеКалендаря);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеКартинки", ИмяСвойстваВид, ВидПоляФормы.ПолеКартинки);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеНадписи", ИмяСвойстваВид, ВидПоляФормы.ПолеНадписи);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеПереключателя", ИмяСвойстваВид, ВидПоляФормы.ПолеПереключателя);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеПериода", ИмяСвойстваВид, ВидПоляФормы.ПолеПериода);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеПланировщика", ИмяСвойстваВид, ВидПоляФормы.ПолеПланировщика);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеПолосыРегулирования", ИмяСвойстваВид, ВидПоляФормы.ПолеПолосыРегулирования);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеТабличногоДокумента", ИмяСвойстваВид, ВидПоляФормы.ПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеТекстовогоДокумента", ИмяСвойстваВид, ВидПоляФормы.ПолеТекстовогоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеФлажка", ИмяСвойстваВид, ВидПоляФормы.ПолеФлажка);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПолеФорматированногоДокумента", ИмяСвойстваВид, ВидПоляФормы.ПолеФорматированногоДокумента);
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьРазделОсновные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОсновные();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Заголовок, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Вид, Раздел, Зависимости.Независимый, Тип("ВидПоляФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПутьКДанным, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеЗаголовка, Раздел, Зависимости.Независимый, Тип("ПоложениеЗаголовкаЭлементаФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Видимость, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Доступность, Раздел, Зависимости.Независимый, Тип("Булево"));
	
	ЗависимостьТолькоПросмотр = Новый Массив;
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеФлажка);
	ЗависимостьТолькоПросмотр.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ТолькоПросмотр, Раздел, ЗависимостьТолькоПросмотр, Тип("Булево"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПропускатьПриВводе, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АктивизироватьПоУмолчанию, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВажностьПриОтображении, Раздел, Зависимости.Независимый, Тип("ВажностьПриОтображении"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоведениеПриНедоступностиОсновногоСервера, Раздел, Зависимости.Независимый, Тип("ПоведениеПриНедоступностиОсновногоСервера"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Маска, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	ЗависимостьРежимПароля = Новый Массив;
	ЗависимостьРежимПароля.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьРежимПароля.Добавить(Зависимости.ВидПолеНадписи);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимПароля, Раздел, ЗависимостьРежимПароля, МФПовтИсп.ТипБулевоНеопределено());
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.МногострочныйРежим, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РасширенноеРедактирование, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	
	ЗависимостьФорматРедактирования = Новый Массив;
	ЗависимостьФорматРедактирования.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьФорматРедактирования.Добавить(Зависимости.ВидПолеФлажка);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ФорматРедактирования, Раздел, ЗависимостьФорматРедактирования, Тип("Строка"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КартинкаЗначений, Раздел, Зависимости.ВидПолеКартинки, Тип("Картинка"));
	
	ЗависимостьФормат = Новый Массив;
	ЗависимостьФормат.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьФормат.Добавить(Зависимости.ВидПолеВвода);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Формат, Раздел, ЗависимостьФормат, Тип("Строка"));
	
	ЗависимостьГиперссылка = Новый Массив;
	ЗависимостьГиперссылка.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьГиперссылка.Добавить(Зависимости.ВидПолеНадписи);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Гиперссылка, Раздел, ЗависимостьГиперссылка, Тип("Булево"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВидПереключателя, Раздел, Зависимости.ВидПолеПереключателя, Тип("ВидПереключателя"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВидФлажка, Раздел, Зависимости.ВидПолеФлажка, Тип("ВидФлажка"));
КонецПроцедуры

Процедура ЗаполнитьРазделПредставление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Представление" для поля формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделДанные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделДанные();
	
	ЗависимостьЗначение = Новый Массив;
	ЗависимостьЗначение.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьЗначение.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьЗначение.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.МинимальноеЗначение, Раздел, ЗависимостьЗначение, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.МаксимальноеЗначение, Раздел, ЗависимостьЗначение, Тип("Число"));
КонецПроцедуры

Процедура ЗаполнитьРазделИспользование(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделИспользование();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеПредупрежденияПриРедактировании, Раздел, Зависимости.Независимый, Тип("ОтображениеПредупрежденияПриРедактировании"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПредупреждениеПриРедактировании, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СочетаниеКлавиш, Раздел, Зависимости.Независимый, Тип("СочетаниеКлавиш"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Защита, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьСетку, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьЗаголовки, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЧерноБелыйПросмотр, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимОтображенияВыделения, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("РежимОтображенияВыделения"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимОтображенияВыделенияРисунков, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("РежимОтображенияВыделенияРисунков"));
	
	ЗависимостьВывод = Новый Массив;
	ЗависимостьВывод.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьВывод.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьВывод.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьВывод.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьВывод.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	ЗависимостьВывод.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьВывод.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Вывод, Раздел, ЗависимостьВывод, Тип("ИспользованиеВывода"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаВыпадающегоСписка, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаСпискаВыбора, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаВыбора, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаОчистки, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаРегулирования, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаОткрытия, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаСоздания, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеКнопкиВыбора, Раздел, Зависимости.ВидПолеВвода, Тип("ОтображениеКнопкиВыбора"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыбораИзСписка, Раздел, Зависимости.ВидПолеВвода, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВыбиратьТип, Раздел, Зависимости.ВидПолеВвода, Тип("Булево"));
	
	ЗависимостьСписокВыбора = Новый Массив;
	ЗависимостьСписокВыбора.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьСписокВыбора.Добавить(Зависимости.ВидПолеПереключателя);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СписокВыбора, Раздел, ЗависимостьСписокВыбора, Тип("СписокЗначений"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыбораНезаполненного, Раздел, Зависимости.ВидПолеВвода, Тип("РежимВыбораНезаполненного"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РедактированиеТекста, Раздел, Зависимости.ВидПолеВвода, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОбновлениеТекстаРедактирования, Раздел, Зависимости.ВидПолеВвода, Тип("ОбновлениеТекстаРедактирования"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоПереносСтрок, Раздел, Зависимости.ВидПолеВвода, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоОтметкаНезаполненного, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоВыборНезаполненного, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВыборГруппИЭлементов, Раздел, Зависимости.ВидПолеВвода, Тип("ГруппыИЭлементы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СвязиПараметровВыбора, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипСвязиПараметровВыбора());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПараметрыВыбора, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипПараметрыВыбора());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.БыстрыйВыбор, Раздел, Зависимости.ВидПолеВвода, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИсторияВыбораПриВводе, Раздел, Зависимости.ВидПолеВвода, Тип("ИсторияВыбораПриВводе"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ФормаВыбора, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СвязьПоТипу, Раздел, Зависимости.ВидПолеВвода, Тип("СвязьПоТипу"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоОтображениеКнопкиОчистки, Раздел, Зависимости.ВидПолеВвода, Тип("РежимАвтоОтображенияКнопкиОчистки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоОтображениеКнопкиОткрытия, Раздел, Зависимости.ВидПолеВвода, Тип("РежимАвтоОтображенияКнопкиОткрытия"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоИсправлениеПриВводеТекста, Раздел, Зависимости.ВидПолеВвода, Тип("АвтоИсправлениеПриВводеТекста"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПроверкаПравописанияПриВводеТекста, Раздел, Зависимости.ВидПолеВвода, Тип("ПроверкаПравописанияПриВводеТекста"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоИзменениеРегистраПриВводеТекста, Раздел, Зависимости.ВидПолеВвода, Тип("АвтоИзменениеРегистраПриВводеТекста"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СпециальныйРежимВводаТекста, Раздел, Зависимости.ВидПолеВвода, Тип("СпециальныйРежимВводаТекста"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПодсказкаАвтоЗаполнения, Раздел, Зависимости.ВидПолеВвода, Тип("ПодсказкаАвтоЗаполненияПоляВвода"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ТекстКнопкиВводаЭкраннойКлавиатуры, Раздел, Зависимости.ВидПолеВвода, Тип("ТекстКнопкиВводаЭкраннойКлавиатуры"));
	
	ЗависимостьРедактирование = Новый Массив;
	ЗависимостьРедактирование.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьРедактирование.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Редактирование, Раздел, ЗависимостьРедактирование, Тип("Булево"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыделенияЗначений, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("РежимВыделенияЗначенийДиаграммыГанта"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыделенияИнтервалов, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("РежимВыделенияИнтерваловДиаграммыГанта"));
	
	ЗависимостьОриентация = Новый Массив;
	ЗависимостьОриентация.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьОриентация.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьОриентация.Добавить(Зависимости.ВидПолеPDFДокумента);
	ТипыОриентация = Новый Массив;
	ТипыОриентация.Добавить(Тип("ОриентацияЭлементаФормы"));
	ТипыОриентация.Добавить(Тип("ОриентацияЭлементаФормы"));
	ТипыОриентация.Добавить(Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Ориентация, Раздел, ЗависимостьОриентация, ТипыОриентация);
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Отображение, Раздел, Зависимости.ВидПолеИндикатора, Тип("РежимСглаживанияИндикатора"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьПроценты, Раздел, Зависимости.ВидПолеИндикатора, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыделения, Раздел, Зависимости.ВидПолеКалендаря, Тип("РежимВыделенияДаты"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьТекущуюДату, Раздел, Зависимости.ВидПолеКалендаря, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьПанельМесяцев, Раздел, Зависимости.ВидПолеКалендаря, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПеремещениеПоКалендарю, Раздел, Зависимости.ВидПолеКалендаря, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НачалоПериодаОтображения, Раздел, Зависимости.ВидПолеКалендаря, Тип("Дата"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КонецПериодаОтображения, Раздел, Зависимости.ВидПолеКалендаря, Тип("Дата"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Масштабировать, Раздел, Зависимости.ВидПолеКартинки, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ТекстНевыбраннойКартинки, Раздел, Зависимости.ВидПолеКартинки, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьГруппировки, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Булево"));
	
	ЗависимостьПеретаскивание = Новый Массив;
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьНачалоПеретаскивания, Раздел, ЗависимостьПеретаскивание, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьПеретаскивание, Раздел, ЗависимостьПеретаскивание, Тип("Булево"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СпособПеретаскиванияФайлов, Раздел, Зависимости.ВидПолеКартинки, Тип("СпособПеретаскиванияФайлов"));
	
	ЗависимостьВыделятьОтрицательные = Новый Массив;
	ЗависимостьВыделятьОтрицательные.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьВыделятьОтрицательные.Добавить(Зависимости.ВидПолеВвода);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВыделятьОтрицательные, Раздел, ЗависимостьВыделятьОтрицательные, МФПовтИсп.ТипБулевоНеопределено());
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеРазметки, Раздел, Зависимости.ВидПолеПолосыРегулирования, Тип("ОтображениеРазметкиПолосыРегулирования"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ШагРазметки, Раздел, Зависимости.ВидПолеПолосыРегулирования, Тип("Число"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимМасштабированияПросмотра, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("РежимМасштабированияПросмотра"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьИменаЯчеек, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьИменаСтрокИКолонок, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ТипКурсоров, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("ТипКурсоровТабличногоДокумента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальнаяПолосаПрокрутки, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("ИспользованиеПолосыПрокрутки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальнаяПолосаПрокрутки, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("ИспользованиеПолосыПрокрутки"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Подсказка, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеПодсказки, Раздел, Зависимости.Независимый, Тип("ОтображениеПодсказки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеСостоянияПросмотра, Раздел, Зависимости.ВидПолеPDFДокумента, Тип("ПоложениеСостоянияПросмотра"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПодсказкаВвода, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	ЗависимостьОтображатьВШапке = Новый Массив;
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеФлажка);
	ЗависимостьОтображатьВШапке.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьВШапке, Раздел, ЗависимостьОтображатьВШапке, Тип("Булево"));
КонецПроцедуры

Процедура ЗаполнитьРазделОформление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОформление();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекстаЗаголовка, Раздел, Зависимости.Независимый, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ШрифтЗаголовка, Раздел, Зависимости.Независимый, Тип("Шрифт"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КартинкаКнопкиВыбора, Раздел, Зависимости.ВидПолеВвода, Тип("Картинка"));
	
	ЗависимостьЦветФона = Новый Массив;
	ЗависимостьЦветФона.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьЦветФона.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьЦветФона.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьЦветФона.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	ЗависимостьЦветФона.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьЦветФона.Добавить(Зависимости.ВидПолеФлажка);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветФона, Раздел, ЗависимостьЦветФона, Тип("Цвет"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазмерКартинки, Раздел, Зависимости.ВидПолеКартинки, Тип("РазмерКартинки"));
	
	ЗависимостьЦветТекста = Новый Массив;
	ЗависимостьЦветТекста.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьЦветТекста.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьЦветТекста.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьЦветТекста.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьЦветТекста.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьЦветТекста.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	ЗависимостьЦветТекста.Добавить(Зависимости.ВидПолеФлажка);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекста, Раздел, ЗависимостьЦветТекста, Тип("Цвет"));
	
	ЗависимостьЦветРамки = Новый Массив;
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеФлажка);
	ЗависимостьЦветРамки.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветРамки, Раздел, ЗависимостьЦветРамки, Тип("Цвет"));
	
	ЗависимостьРамка = Новый Массив;
	ЗависимостьРамка.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьРамка.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьРамка.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьРамка.Добавить(Зависимости.ВидПолеПериода);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Рамка, Раздел, ЗависимостьРамка, Тип("Рамка"));
	
	ЗависимостьШрифт = Новый Массив;
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	ЗависимостьШрифт.Добавить(Зависимости.ВидПолеФлажка);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Шрифт, Раздел, ЗависимостьШрифт, Тип("Шрифт"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальныеЛинии, Раздел, Зависимости.ВидПолеДиаграммыГанта, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальныеЛинии, Раздел, Зависимости.ВидПолеДиаграммыГанта, МФПовтИсп.ТипБулевоНеопределено());
КонецПроцедуры

Процедура ЗаполнитьРазделРасположение(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделРасположение();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ВертикальноеПоложениеЭлемента"));
	
	ЗависимостьГоризонтальноеПоложение = Новый Массив;
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеФлажка);
	ЗависимостьГоризонтальноеПоложение.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложение, Раздел, ЗависимостьГоризонтальноеПоложение, Тип("ГоризонтальноеПоложениеЭлемента"));
	
	ЗависимостьВертикальноеПоложение = Новый Массив;
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеФлажка);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьВертикальноеПоложение.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложение, Раздел, ЗависимостьВертикальноеПоложение, Тип("ВертикальноеПоложениеЭлемента"));
	
	ЗависимостьШиринаВысота = Новый Массив;
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	ЗависимостьШиринаВысота.Добавить(Зависимости.ВидПолеПериода);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Ширина, Раздел, ЗависимостьШиринаВысота, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Высота, Раздел, ЗависимостьШиринаВысота, Тип("Число"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ШиринаВМесяцах, Раздел, Зависимости.ВидПолеКалендаря, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаВМесяцах, Раздел, Зависимости.ВидПолеКалендаря, Тип("Число"));
	
	ЗависимостьАвтоМаксимальнаяШиринаВысота = Новый Массив;
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьАвтоМаксимальнаяШиринаВысота.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяШирина, Раздел, ЗависимостьАвтоМаксимальнаяШиринаВысота, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяВысота, Раздел, ЗависимостьАвтоМаксимальнаяШиринаВысота, Тип("Булево"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВариантУправленияВысотой, Раздел, Зависимости.ВидПолеВвода, Тип("ВариантУправленияВысотойЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаСпискаВыбора, Раздел, Зависимости.ВидПолеВвода, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ШиринаВыпадающегоСписка, Раздел, Зависимости.ВидПолеВвода, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГиперссылкаЭлементаШкалыВремени, Раздел, Зависимости.ВидПолеПланировщика, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГиперссылкаЭлементаИзмерения, Раздел, Зависимости.ВидПолеПланировщика, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГиперссылкаПеренесенногоЗаголовкаШкалыВремени, Раздел, Зависимости.ВидПолеПланировщика, Тип("Булево"));
	
	ЗависимостьРастягивать = Новый Массив;
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеИндикатора);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеПолосыРегулирования);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьРастягивать.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	ТипыРастягивать = Новый Массив;
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(МФПовтИсп.ТипБулевоНеопределено());
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(МФПовтИсп.ТипБулевоНеопределено());
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	ТипыРастягивать.Добавить(Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоГоризонтали, Раздел, ЗависимостьРастягивать, ТипыРастягивать);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоВертикали, Раздел, ЗависимостьРастягивать, ТипыРастягивать);
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеТаблицы, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("ПоложениеТаблицыДиаграммыГанта"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КоличествоКолонок, Раздел, Зависимости.ВидПолеПереключателя, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаЗаголовка, Раздел, Зависимости.Независимый, Тип("Число"));
	
	ЗависимостьВысотаЗаголовкаЭлемента = Новый Массив;
	ЗависимостьВысотаЗаголовкаЭлемента.Добавить(Зависимости.ВидПолеПереключателя);
	ЗависимостьВысотаЗаголовкаЭлемента.Добавить(Зависимости.ВидПолеФлажка);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаЗаголовкаЭлемента, Раздел, ЗависимостьВысотаЗаголовкаЭлемента, Тип("Число"));
КонецПроцедуры

Процедура ЗаполнитьРазделСобытия(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделСобытия();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоПодбор, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	ЗависимостьВыбор = Новый Массив;
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеПериода);
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьВыбор.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Выбор, Раздел, ЗависимостьВыбор, Тип("Строка"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ДобавлениеМножественныхЗначений, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ДокументСформирован, Раздел, Зависимости.ВидПолеHTMLДокумента, Тип("Строка"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИзменениеТекстаРедактирования, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	ЗависимостьНажатие = Новый Массив;
	ЗависимостьНажатие.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьНажатие.Добавить(Зависимости.ВидПолеНадписи);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Нажатие, Раздел, ЗависимостьНажатие, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НажатиеНаДействиеПланировщика, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	ЗависимостьНажатиеНаНавигационнойСсылке = Новый Массив;
	ЗависимостьНажатиеНаНавигационнойСсылке.Добавить(Зависимости.ВидПолеPDFДокумента);
	ЗависимостьНажатиеНаНавигационнойСсылке.Добавить(Зависимости.ВидПолеПланировщика);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НажатиеНаНавигационнойСсылке, Раздел, ЗависимостьНажатиеНаНавигационнойСсылке, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НажатиеНаПеренесенномЗаголовкеШкалыВремени, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НажатиеНаЭлементеИзмерения, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НажатиеНаЭлементеШкалыВремени, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НачалоВыбора, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	// ЗависимостьПеретаскивание для событий:
	// * НачалоПеретаскивания
	// * ОкончаниеПеретаскивания,
	// * ПроверкаПеретаскивания
	// * Перетаскивание
	ЗависимостьПеретаскивание = Новый Массив;
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеКалендаря);
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеКартинки);
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьПеретаскивание.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НачалоПеретаскивания, Раздел, ЗависимостьПеретаскивание, Тип("Строка"));
	// Событие НачалоВыбораИзСписка существует только в толстом клиенте
	// МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НачалоВыбораИзСписка, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОбработкаВыбора, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОбработкаДополнительнойРасшифровки, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Строка"));
	ЗависимостьОбработкаНавигационнойСсылки = Новый Массив;
	ЗависимостьОбработкаНавигационнойСсылки.Добавить(Зависимости.ВидПолеНадписи);
	ЗависимостьОбработкаНавигационнойСсылки.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОбработкаНавигационнойСсылки, Раздел, ЗависимостьОбработкаНавигационнойСсылки, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОбработкаНавигационнойСсылкиМножественногоЗначения, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	ЗависимостьОбработкаРасшифровки = Новый Массив;
	ЗависимостьОбработкаРасшифровки.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьОбработкаРасшифровки.Добавить(Зависимости.ВидПолеДендрограммы);
	ЗависимостьОбработкаРасшифровки.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьОбработкаРасшифровки.Добавить(Зависимости.ВидПолеДиаграммыГанта);
	ЗависимостьОбработкаРасшифровки.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОбработкаРасшифровки, Раздел, ЗависимостьОбработкаРасшифровки, Тип("Строка"));
	ЗависимостьОбработкаФормированияКоманд = Новый Массив;
	ЗависимостьОбработкаФормированияКоманд.Добавить(Зависимости.ВидПолеВвода);
	ЗависимостьОбработкаФормированияКоманд.Добавить(Зависимости.ВидПолеПланировщика);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОбработкаФормированияКоманд, Раздел, ЗависимостьОбработкаФормированияКоманд, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОкончаниеВводаТекста, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОкончаниеПеретаскивания, Раздел, ЗависимостьПеретаскивание, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Открытие, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОткрытиеМножественногоЗначения, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Очистка, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	ЗависимостьПередЗаписью = Новый Массив;
	ЗависимостьПередЗаписью.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьПередЗаписью.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьПередЗаписью.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьПередЗаписью.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьПередЗаписью.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередЗаписью, Раздел, ЗависимостьПередЗаписью, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередНачаломБыстрогоРедактирования, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередНачаломРедактирования, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередРазворачиванием, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередРазворачиваниемЭлементаИзмерения, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередСворачиванием, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередСворачиваниемЭлементаИзмерения, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередСозданием, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	ЗависимостьПередПечатью = Новый Массив;
	ЗависимостьПередПечатью.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьПередПечатью.Добавить(Зависимости.ВидПолеГеографическойСхемы);
	ЗависимостьПередПечатью.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьПередПечатью.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьПередПечатью.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьПередПечатью.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьПередПечатью.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередПечатью, Раздел, ЗависимостьПередПечатью, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПередУдалением, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Перетаскивание, Раздел, ЗависимостьПеретаскивание, Тип("Строка"));
	ЗависимостьПослеЗаписи = Новый Массив;
	ЗависимостьПослеЗаписи.Добавить(Зависимости.ВидПолеHTMLДокумента);
	ЗависимостьПослеЗаписи.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьПослеЗаписи.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	ЗависимостьПослеЗаписи.Добавить(Зависимости.ВидПолеТекстовогоДокумента);
	ЗависимостьПослеЗаписи.Добавить(Зависимости.ВидПолеФорматированногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПослеЗаписи, Раздел, ЗависимостьПослеЗаписи, Тип("Строка"));
	ЗависимостьПриАктивизации = Новый Массив;
	ЗависимостьПриАктивизации.Добавить(Зависимости.ВидПолеГрафическойСхемы);
	ЗависимостьПриАктивизации.Добавить(Зависимости.ВидПолеДиаграммы);
	ЗависимостьПриАктивизации.Добавить(Зависимости.ВидПолеПланировщика);
	ЗависимостьПриАктивизации.Добавить(Зависимости.ВидПолеТабличногоДокумента);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриАктивизации, Раздел, ЗависимостьПриАктивизации, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриАктивизацииДаты, Раздел, Зависимости.ВидПолеКалендаря, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриАктивизацииЗначения, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриАктивизацииИнтервала, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриВыводеПериода, Раздел, Зависимости.ВидПолеКалендаря, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриРедактированииЗначения, Раздел, Зависимости.ВидПолеДиаграммы, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриИзменении, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриИзмененииСодержимогоОбласти, Раздел, Зависимости.ВидПолеТабличногоДокумента, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриНажатии, Раздел, Зависимости.ВидПолеHTMLДокумента, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриОкончанииРедактирования, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриОкончанииРедактированияИнтервала, Раздел, Зависимости.ВидПолеДиаграммыГанта, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриРедактированииЗначения, Раздел, Зависимости.ВидПолеДиаграммы, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриСменеТекущегоПериодаОтображения, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПроверкаПеретаскивания, Раздел, ЗависимостьПеретаскивание, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПроверкаПеретаскиванияВнутри, Раздел, Зависимости.ВидПолеПланировщика, Тип("Строка"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Регулирование, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Создание, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.УдалениеМножественныхЗначений, Раздел, Зависимости.ВидПолеВвода, Тип("Строка"));
КонецПроцедуры

Процедура ЗаполнитьОбязательныеСвойства(ОписанияСвойств) Экспорт
	// BSLLS:NestedFunctionInParameters-off
	МФОбъектыФормыСлужебный.ДобавитьОбязательноеСвойство(
		ОписанияСвойств, 
		МФОбъектыФормыСлужебный.ИмяСвойстваВид(), 
		ВидПоляФормы.ПолеВвода
	);
	// BSLLS:NestedFunctionInParameters-on
КонецПроцедуры

Процедура ЗаполнитьСвойстваНедоступныеНаКлиенте(ОписанияСвойств, СинонимыСвойствЭлементов) Экспорт
	Свойства = Новый Массив;
	Свойства.Добавить(СинонимыСвойствЭлементов.ПутьКДанным);
	Свойства.Добавить(СинонимыСвойствЭлементов.АвтоИзменениеРегистраПриВводеТекста);
	Свойства.Добавить(СинонимыСвойствЭлементов.АвтоИсправлениеПриВводеТекста);
	Свойства.Добавить(СинонимыСвойствЭлементов.ПоложениеСостоянияПросмотра);
	Свойства.Добавить(СинонимыСвойствЭлементов.ФормаВыбора);
	
	МФОбъектыФормыСлужебный.СформироватьСвойстваНедоступныеНаКлиенте(
		ОписанияСвойств,
		Свойства
	);
КонецПроцедуры

#КонецОбласти
