//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

&НаКлиенте
Перем Остановить;

&НаКлиенте
Перем Формы;

&НаКлиенте
Перем ТекущаяФорма;

&НаКлиенте
Перем РазмерПорции;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Остановить = Истина;
	ТекущаяФорма = "";
	Элементы.НачатьЗаполнение.Доступность = Истина;
	Элементы.ПродолжитьЗаполнение.Доступность = Ложь;
	Элементы.ОстановитьЗаполнение.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьСписокФормВКэше");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьТекущуюФормуВСписокИсключаемых(Команда)
	Если
		ПустаяСтрока(ТекущаяФорма)
		Или ИсключаемыеФормы.НайтиСтроки(Новый Структура("ИмяФормы", ТекущаяФорма)).Количество() > 0
	Тогда
		Возврат;
	КонецЕсли;
	НоваяСтрока = ИсключаемыеФормы.Добавить();
	НоваяСтрока.ИмяФормы = ТекущаяФорма;
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнение(Команда)
	ЗаписатьВЖР("Начало замера");
	РазмерПорции = 50;
	
	Элементы.НачатьЗаполнение.Доступность = Ложь;
	Элементы.ПродолжитьЗаполнение.Доступность = Ложь;
	Элементы.ОстановитьЗаполнение.Доступность = Истина;
	Элементы.ИсключаемыеФормы.Доступность = Ложь;
	
	УстановитьСтатус(НСтр("ru='Подготовка списка форм конфигурации'"));
	ПодключитьОбработчикОжидания("ПодготовитьСписокФорм", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнение(Команда)
	Остановить = Ложь;
	Элементы.НачатьЗаполнение.Доступность = Ложь;
	Элементы.ПродолжитьЗаполнение.Доступность = Ложь;
	Элементы.ОстановитьЗаполнение.Доступность = Истина;
	Элементы.ИсключаемыеФормы.Доступность = Ложь;
	ПодключитьОбработчикОжидания("ОбработкаФормы", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьЗаполнение(Команда)
	Остановить = Истина;
	ПодключитьОбработчикОжидания("ОбработкаФормы", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьВЖР(ТекстСообщения)
	ЗаписьЖурналаРегистрации(
		"МодификацияФорм.Замер",
		УровеньЖурналаРегистрации.Информация,
		,,
		ТекстСообщения
	);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатус(НовыйСтатус = Неопределено)
	Если НовыйСтатус = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.Статус.Заголовок = НовыйСтатус;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюФорму()
	Если Прогресс >= Формы.Количество() Тогда
		ТекущаяФорма = "";
	Иначе
		ТекущаяФорма = Формы[Прогресс - 1];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОбработкиФормы()
	УстановитьСтатус(СтрШаблон(
		НСтр("ru='Обработка формы ""%1""'"),
		ТекущаяФорма
	));
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьСписокФорм()
	Остановить = Ложь;
	//УстановитьВидимостьДоступностьЭлементов();
	Формы = ФормыКонфигурации();
	Элементы.Прогресс.МаксимальноеЗначение = Формы.Количество();
	Прогресс = 1;
	УстановитьТекущуюФорму();
	УстановитьСтатусОбработкиФормы();
	ПодключитьОбработчикОжидания("ОбработкаФормы", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаФормы()
	Если Не Остановить Тогда
		Для Сч = 1 По РазмерПорции Цикл
			Если ИсключаемыеФормы.НайтиСтроки(Новый Структура("ИмяФормы", ТекущаяФорма)).Количество() = 0 Тогда
				Попытка
					ПолучитьФорму(ТекущаяФорма);
					ОчиститьСообщения();
				Исключение
					// Ничего не делаем
				КонецПопытки;
			КонецЕсли;
			Прогресс = Прогресс + 1;
			УстановитьТекущуюФорму();
			Если ПустаяСтрока(ТекущаяФорма) Тогда
				Остановить = Истина;
				Прервать;
			КонецЕсли;
			УстановитьСтатусОбработкиФормы();
		КонецЦикла;
	КонецЕсли;
	Если Остановить Тогда
		ПодключитьОбработчикОжидания("Завершение", 0.1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработкаФормы", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура Завершение()
	ЗаписатьВЖР("Окончание замера");
	Ждать ПредупреждениеАсинх(НСтр("ru='Заполнение завершено'"), 30);
	
	Элементы.НачатьЗаполнение.Доступность = Истина;
	Элементы.ПродолжитьЗаполнение.Доступность = Истина;
	Элементы.ОстановитьЗаполнение.Доступность = Ложь;
	Элементы.ИсключаемыеФормы.Доступность = Истина;
	//УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФормыКонфигурации()
	Результат = Новый Массив;
	ДобавитьОбщиеФормы(Результат);
	ДобавитьФормы(Результат, "Справочники");
	ДобавитьФормы(Результат, "Документы");
	ДобавитьФормы(Результат, "ЖурналыДокументов");
	ДобавитьФормы(Результат, "Перечисления");
	ДобавитьФормы(Результат, "Отчеты");
	ДобавитьФормы(Результат, "Обработки");
	ДобавитьФормы(Результат, "ПланыВидовХарактеристик");
	ДобавитьФормы(Результат, "ПланыСчетов");
	ДобавитьФормы(Результат, "ПланыВидовРасчета");
	ДобавитьФормы(Результат, "РегистрыСведений");
	ДобавитьФормы(Результат, "РегистрыНакопления");
	ДобавитьФормы(Результат, "РегистрыБухгалтерии");
	ДобавитьФормы(Результат, "РегистрыРасчета");
	ДобавитьФормы(Результат, "БизнесПроцессы");
	ДобавитьФормы(Результат, "Задачи");
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьОбщиеФормы(Формы)
	ДобавитьФормыИзКоллекции(Формы, Метаданные.ОбщиеФормы);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьФормы(Формы, ИмяКоллекции)
	Для Каждого Коллекция Из Метаданные[ИмяКоллекции] Цикл
		КоллекцияФорм = Коллекция.Формы;
		ДобавитьФормыИзКоллекции(Формы, КоллекцияФорм);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьФормыИзКоллекции(Формы, Коллекция)
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Формы.Добавить(ЭлементКоллекции.ПолноеИмя());
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
