//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп.ФреймворкТестирования().ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование общего модуля ""МФПовтИсп""")
			.ДобавитьТест("ЗначенияСтандартныхПеречислений", "Функция ""ЗначенияСтандартныхПеречислений""")
	;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

#Область ЗначенияСтандартныхПеречислений

Процедура ЗначенияСтандартныхПеречислений() Экспорт 
	// Дано
	ПроверяемыеТипы = ПроверяемыеТипы();
	Исключения = Исключения();
	
	// Когда
	Типы = Новый Массив;
	ЗначенияСтандартныхПеречислений = МФПовтИсп.ЗначенияСтандартныхПеречислений().Значения;
	Для Каждого ЭлементКоллекции Из ПроверяемыеТипы Цикл
		Если 
			Исключения.Найти(ЭлементКоллекции.Ключ) = Неопределено 
			И ЗначенияСтандартныхПеречислений.Получить(ЭлементКоллекции.Ключ) = Неопределено
		Тогда
			Типы.Добавить("  * " + ЭлементКоллекции.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	// Тогда
	ТекстОшибки = "Отсутствует описание значений типов:" 
		+ Символы.ПС 
		+ СтрСоединить(Типы, Символы.ПС) 
		+ Символы.ПС 
	;
	
	МФТестированиеКлиентСерверПовтИсп
		.ФреймворкТестирования()
		.ЮТест.ОжидаетЧто(Типы, ТекстОшибки)
			.ИмеетДлину(0)
	;
КонецПроцедуры

Функция ПроверяемыеТипы()
	Результат = Новый Соответствие;
	
	ОписаниеСвойствЭлементовФормы = МФОбъектыФормыПовтИсп.ОписанияСвойствЭлементовФормы();
	Для Каждого ЭлементФормы Из ОписаниеСвойствЭлементовФормы Цикл
		СвойстваЭлемента = ЭлементФормы.Значение.Свойства;
		Для Каждого СвойствоЭлемента Из СвойстваЭлемента Цикл
			ТипыСвойства = СвойствоЭлемента.Значение.ТипыСвойства;
			Для Каждого ТипСвойства Из ТипыСвойства Цикл
				Результат.Вставить(ТипСвойства.Тип, ТипСвойства.Тип);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция Исключения()
	Результат = Новый Массив;
	
	Результат.Добавить(Тип("Строка"));
	Результат.Добавить(Тип("Дата"));
	Результат.Добавить(Тип("ТаблицаФормы"));
	Результат.Добавить(Тип("Число"));
	Результат.Добавить(Тип("СочетаниеКлавиш"));
	Результат.Добавить(Тип("Цвет"));
	Результат.Добавить(Тип("Шрифт"));
	Результат.Добавить(Тип("Картинка"));
	Результат.Добавить(Тип("Рамка"));
	Результат.Добавить(Тип("СписокЗначений"));
	Результат.Добавить(Тип("СвязьПоТипу"));
	Результат.Добавить(МФПовтИсп.ТипСвязиПараметровВыбора());
	Результат.Добавить(МФПовтИсп.ТипПараметрыВыбора());
	Результат.Добавить(МФПовтИсп.ТипДатаНеопределено());
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти
