//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СинонимыСвойствЭлементов() Экспорт
	Возврат МФОбъектыФормыПовтИсп.Тест_СинонимыСвойствОбъектов();
КонецФункции

Функция ОписанияСвойствЭлементаФормы(ТипЭлементаФормы, Знач Зависимость = Неопределено) Экспорт 
	Результат = Новый Структура;
	
	ПолноеОписание = МФОбъектыФормыПовтИсп.ОписанияСвойствЭлементовФормы().Получить(ТипЭлементаФормы);
	Если Зависимость <> Неопределено Тогда
		ИмяПоля = ПолноеОписание.СоответствиеСвойств.Получить(ВРег(Зависимость.ИмяПоля));
		Если ИмяПоля = Неопределено Тогда
			ТекстИсключения = СтрШаблон(
				НСтр("ru='Неизвестное поле ""%1""'"),
				Зависимость.ИмяПоля
			);
			
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		Поле = ПолноеОписание.Свойства.Получить(ИмяПоля);
		ТипПоля = Поле.ТипыСвойства[0].Тип;
		ЗначениеПоля = МФПовтИсп.ЗначенияСтандартныхПеречислений()
			.Значения
			.Получить(ТипПоля)
			.Получить(ВРег(Зависимость.ПредставлениеЗначения)
		);
		Если ЗначениеПоля = Неопределено Тогда
			ТекстИсключения = СтрШаблон(
				НСтр("ru='Неизвестное значения ""%1"" поля ""%2""'"),
				Зависимость.ПредставлениеЗначения,
				Зависимость.ИмяПоля
			);
			
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		Зависимость.Вставить("ИмяПоля", ИмяПоля);
		Зависимость.Вставить("ЗначениеПоля", ЗначениеПоля);
	КонецЕсли;
	Результат.Вставить("СвойстваНедоступныеНаКлиенте", ПолноеОписание.СвойстваНедоступныеНаКлиенте);
	СвойстваЭлемента = Новый Соответствие;
	
	ЗаменяемыеТипы = Новый Соответствие;
	ЗаменяемыеТипы.Вставить(МФПовтИсп.ТипБулевоНеопределено(), Тип("Неопределено"));
	ЗаменяемыеТипы.Вставить(МФПовтИсп.ТипСвязиПараметровВыбора(), Тип("ФиксированныйМассив"));
	ЗаменяемыеТипы.Вставить(МФПовтИсп.ТипПараметрыВыбора(), Тип("ФиксированныйМассив"));
	
	Для Каждого СвойствоЭлемента Из ПолноеОписание.Свойства Цикл
		Если ПолноеОписание.СвойстваНедоступныеНаКлиенте.Найти(СвойствоЭлемента.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТипСвойства = Неопределено;
		Если Зависимость <> Неопределено Тогда
			ЗависимостиСвойства = СвойствоЭлемента.Значение.ТипыСвойства;
			ПропуститьСвойство = Истина;
			Для Каждого ЗависимостьСвойства Из ЗависимостиСвойства Цикл
				Если
					(ЗависимостьСвойства.ИмяПоля = Неопределено)
					Или ((ЗависимостьСвойства.ИмяПоля = Зависимость.ИмяПоля)
					И (ЗависимостьСвойства.ЗначениеПоля = Зависимость.ЗначениеПоля))
				Тогда
					ТипСвойства = ЗависимостьСвойства.Тип;
					ПропуститьСвойство = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ПропуститьСвойство Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если ТипСвойства = Неопределено Тогда
			ТипСвойства = СвойствоЭлемента.Значение.ТипыСвойства[0].Тип;
		КонецЕсли;
		НовыйТип = ЗаменяемыеТипы.Получить(ТипСвойства);
		Если НовыйТип <> Неопределено Тогда
			ТипСвойства = НовыйТип;
		КонецЕсли;
		Если ПолноеОписание.Разделы.Получить(МФПовтИсп.РазделСобытия()).Найти(СвойствоЭлемента.Ключ) = Неопределено Тогда
			СвойстваЭлемента.Вставить(СвойствоЭлемента.Ключ, ТипСвойства);
		КонецЕсли;
	КонецЦикла;
	Результат.Вставить("СвойстваЭлемента", СвойстваЭлемента);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
