//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьВетки(Приемник, Источник) Экспорт
	ВеткиИсточника = Источник.ПолучитьЭлементы();
	ВеткиПриемника = Приемник.ПолучитьЭлементы();
	Для Каждого ВеткаИсточника Из ВеткиИсточника Цикл
		ВеткаПриемника = ВеткиПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(ВеткаПриемника, ВеткаИсточника);
		ЗаполнитьВетки(ВеткаПриемника, ВеткаИсточника);
	КонецЦикла;
КонецПроцедуры

Функция РазличающиесяМакетыОписанийМодификаций() Экспорт
	Результат = НовыйРазличающиесяМакетыОписанийМодификаций();
	
	Протокол = МФСлужебный.Протокол(Неопределено);
	МакетыИзРегистра = РегистрыСведений.МФМакеты.МакетыОписанияМодификаций();
	Для Каждого Элемент Из МакетыИзРегистра Цикл
		ИмяМакета = Элемент.Ключ;
		МакетИзРегистра = Элемент.Значение;
		Попытка
			МакетИзКонфигурации = МФСлужебный
				.МакетОписанияМодификаций(ИмяМакета, Протокол)
				.ПолучитьТекст()
			;
		Исключение
			МакетКУдалению = Новый Соответствие;
			МакетКУдалению.Вставить("ИмяМакета", ИмяМакета);
			МакетКУдалению.Вставить("МакетИзРегистра", МакетИзРегистра);
			Результат.МакетыКУдалению.Добавить(МакетКУдалению);
			
			Продолжить;
		КонецПопытки;
		
		Если МакетИзКонфигурации <> МакетИзРегистра Тогда
			МакетКИзменению = Новый Соответствие;
			МакетКИзменению.Вставить("ИмяМакета", ИмяМакета);
			МакетКИзменению.Вставить("МакетИзРегистра", МакетИзРегистра);
			МакетКИзменению.Вставить("МакетИзКонфигурации", МакетИзКонфигурации);
			Результат.МакетыКИзменению.Добавить(МакетКИзменению);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйРазличающиесяМакетыОписанийМодификаций()
	Результат = Новый Структура;
	
	Результат.Вставить("МакетыКИзменению", Новый Массив);
	Результат.Вставить("МакетыКУдалению", Новый Массив);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
