//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьВетки(Приемник, Источник) Экспорт
	ВеткиИсточника = Источник.ПолучитьЭлементы();
	ВеткиПриемника = Приемник.ПолучитьЭлементы();
	Для Каждого ВеткаИсточника Из ВеткиИсточника Цикл
		ВеткаПриемника = ВеткиПриемника.Добавить();
		ЗаполнитьЗначенияСвойств(ВеткаПриемника, ВеткаИсточника);
		ЗаполнитьВетки(ВеткаПриемника, ВеткаИсточника);
	КонецЦикла;
КонецПроцедуры

Функция ИмяПараметраГенерацияАвтотестов() Экспорт
	Возврат "__YAFM_ЭтоГенерацияАвтотестов";
КонецФункции

Функция ИмяПараметраАдресДанныхДляГенерацииАвтотестов() Экспорт
	Возврат "__YAFM_АдресДанныхДляГенерацииАвтотестов";
КонецФункции

Функция ИмяРасширенияТестирования() Экспорт
	Результат = НСтр("ru='ТестированиеМодификацийФорм'");
	
	МФИнструментыРазработчикаКлиентСерверПереопределяемый
		.УстановитьИмяРасширенияТестирования(Результат)
	;
	
	Возврат Результат;
КонецФункции

Функция ВерсияРасширенияТестирования() Экспорт
	Результат = "0";
	
	МФИнструментыРазработчикаКлиентСерверПереопределяемый
		.УстановитьВерсиюРасширенияТестирования(Результат)
	;
	
	Возврат Результат;
КонецФункции

Функция СоответствиеТиповЭлементовФормыСтроке() Экспорт
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("ГруппаФормы"), "ГруппаФормы");
	Результат.Вставить(Тип("ДекорацияФормы"), "ДекорацияФормы");
	Результат.Вставить(Тип("КнопкаФормы"), "КнопкаФормы");
	Результат.Вставить(Тип("ПолеФормы"), "ПолеФормы");
	Результат.Вставить(Тип("ТаблицаФормы"), "ТаблицаФормы");
	
	Возврат Результат;
КонецФункции

#КонецОбласти
