#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Функция СобытияТестируемогоЭлемента() Экспорт
	Возврат СобытияТестируемогоЭлемента;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИмяТестируемогоРеквизита") Тогда
		ТестированиеСлужебный.ПриСозданииТестовойФормы(ЭтотОбъект, Параметры.ИмяТестируемогоРеквизита);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ПолеФормы_ВидПолеHTMLДокумента

&НаКлиенте
Процедура ПолеФормы_ВидПолеHTMLДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеHTMLДокументаДокументСформирован(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеHTMLДокументаПередЗаписью(Элемент, Копирование, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеHTMLДокументаПослеЗаписи(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеHTMLДокументаПередПечатью(Элемент, ДиалогПечати, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеPDFДокумента

&НаКлиенте
Процедура ПолеФормы_ВидПолеPDFДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеPDFДокументаНажатиеНаНавигационнойСсылке(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеВвода

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаОчистка(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаОткрытие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаСоздание(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаОбработкаФормированияКоманд(Элемент, ПараметрыКоманд, Команды)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаДобавлениеМножественныхЗначений(Элемент, Значения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаУдалениеМножественныхЗначений(Элемент, Идентификаторы, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаОткрытиеМножественногоЗначения(Элемент, Идентификатор, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеВводаОбработкаНавигационнойСсылкиМножественногоЗначения(Элемент, Идентификатор, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеГеографическойСхемы

&НаКлиенте
Процедура ПолеФормы_ВидПолеГеографическойСхемыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеГеографическойСхемыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеГеографическойСхемыПередПечатью(Элемент, ДиалогПечати, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеГрафическойСхемы

&НаКлиенте
Процедура ПолеФормы_ВидПолеГрафическойСхемыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеГрафическойСхемыВыбор(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеГрафическойСхемыПриАктивизации(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеГрафическойСхемыПередЗаписью(Элемент, Копирование, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеГрафическойСхемыПослеЗаписи(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеГрафическойСхемыПередПечатью(Элемент, ДиалогПечати, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеДендрограммы

&НаКлиенте
Процедура ПолеФормы_ВидПолеДендрограммыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДендрограммыВыбор(Элемент, ЗначениеДендрограммы, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДендрограммыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеДиаграммы

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыПриАктивизации(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыПриРедактированииЗначения(Элемент, ЗначениеДиаграммы, СостояниеРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеДиаграммыГанта

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаПриАктивизацииЗначения(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаПриАктивизацииИнтервала(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаПередСворачиванием(Элемент, ИдентификаторЗначения, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеДиаграммыГантаПередРазворачиванием(Элемент, ИдентификаторЗначения, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеИндикатора

&НаКлиенте
Процедура ПолеФормы_ВидПолеИндикатораПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеКалендаря

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряПриАктивизацииДаты(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряВыбор(Элемент, ВыбраннаяДата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряПриВыводеПериода(Элемент, ОформлениеПериода)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ВыбраннаяДата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКалендаряПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, ВыбраннаяДата)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеКартинки

&НаКлиенте
Процедура ПолеФормы_ВидПолеКартинкиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКартинкиНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКартинкиНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКартинкиПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКартинкиОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеКартинкиПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеНадписи

&НаКлиенте
Процедура ПолеФормы_ВидПолеНадписиПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеНадписиНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеНадписиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеПереключателя

&НаКлиенте
Процедура ПолеФормы_ВидПолеПереключателяПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеПериода

&НаКлиенте
Процедура ПолеФормы_ВидПолеПериодаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПериодаВыбор(Элемент, ВыбраннаяДата)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеПланировщика

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПриАктивизации(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаВыбор(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПередУдалением(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаОбработкаФормированияКоманд(Элемент, ПараметрыКоманд, Команды, КомандаПоУмолчанию)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаНажатиеНаЭлементеИзмерения(Элемент, ЭлементИзмерения, ЗначенияИзмерений, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаНажатиеНаЭлементеШкалыВремени(Элемент, ЭлементШкалыВремени, Дата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаНажатиеНаПеренесенномЗаголовкеШкалыВремени(Элемент, Дата)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаНажатиеНаНавигационнойСсылке(Элемент, Источник, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаНажатиеНаДействиеПланировщика(Элемент, ЭлементПланировщика, Действие)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПередСворачиваниемЭлементаИзмерения(Элемент, ЭлементИзмерения, ЗначенияИзмерений, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПередРазворачиваниемЭлементаИзмерения(Элемент, ЭлементИзмерения, ЗначенияИзмерений, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПроверкаПеретаскиванияВнутри(Элемент, ПараметрыПеретаскивания, ВариантИзмененияГраниц, ДействиеПеретаскивания, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, ЗначенияИзмерений)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Дата, ЗначенияИзмерений)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеПланировщикаПередПечатью(Элемент, ДиалогПечати, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеПолосыРегулирования

&НаКлиенте
Процедура ПолеФормы_ВидПолеПолосыРегулированияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеТабличногоДокумента

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаВыбор(Элемент, Область, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПриИзмененииСодержимогоОбласти(Элемент, Область, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПриАктивизации(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПередЗаписью(Элемент, Копирование, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПослеЗаписи(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаПередПечатью(Элемент, ДиалогПечати, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТабличногоДокументаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеТекстовогоДокумента

&НаКлиенте
Процедура ПолеФормы_ВидПолеТекстовогоДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТекстовогоДокументаПередЗаписью(Элемент, Копирование, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТекстовогоДокументаПослеЗаписи(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеТекстовогоДокументаПередПечатью(Элемент, ДиалогПечати, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеФлажка

&НаКлиенте
Процедура ПолеФормы_ВидПолеФлажкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ПолеФормы_ВидПолеФорматированногоДокумента

&НаКлиенте
Процедура ПолеФормы_ВидПолеФорматированногоДокументаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеФорматированногоДокументаПередЗаписью(Элемент, Копирование, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеФорматированногоДокументаПослеЗаписи(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПолеФормы_ВидПолеФорматированногоДокументаПередПечатью(Элемент, ДиалогПечати, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#КонецОбласти
