//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипЭлементаФормы() Экспорт
	Возврат Тип("ДекорацияФормы");
КонецФункции

Функция Идентификаторы() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("ДЕКОРАЦИЯФОРМЫ");
	
	Возврат Результат;
КонецФункции

Функция ЗависимостиСвойств() Экспорт
	Результат = Новый Структура;
	
	ИмяСвойстваВид = МФОбъектыФормыСлужебный.ИмяСвойстваВид();
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "Независимый", Неопределено, Неопределено);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидНадпись", ИмяСвойстваВид, ВидДекорацииФормы.Надпись);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидКартинка", ИмяСвойстваВид, ВидДекорацииФормы.Картинка);
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьРазделОсновные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОсновные();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Заголовок, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Вид, Раздел, Зависимости.Независимый, Тип("ВидДекорацииФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Видимость, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Доступность, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПропускатьПриВводе, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВажностьПриОтображении, Раздел, Зависимости.Независимый, Тип("ВажностьПриОтображении"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоведениеПриНедоступностиОсновногоСервера, Раздел, Зависимости.Независимый, Тип("ПоведениеПриНедоступностиОсновногоСервера"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Картинка, Раздел, Зависимости.ВидКартинка, Тип("Картинка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Гиперссылка, Раздел, Зависимости.Независимый, Тип("Булево"));
КонецПроцедуры

Процедура ЗаполнитьРазделПредставление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Представление" для декорации формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделДанные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Данные" для декорации формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделИспользование(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделИспользование();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СочетаниеКлавиш, Раздел, Зависимости.Независимый, Тип("СочетаниеКлавиш"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Подсказка, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеПодсказки, Раздел, Зависимости.Независимый, Тип("ОтображениеПодсказки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Масштабировать, Раздел, Зависимости.ВидКартинка, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ТекстНевыбраннойКартинки, Раздел, Зависимости.ВидКартинка, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьНачалоПеретаскивания, Раздел, Зависимости.ВидКартинка, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьПеретаскивание, Раздел, Зависимости.ВидКартинка, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СпособПеретаскиванияФайлов, Раздел, Зависимости.ВидКартинка, Тип("СпособПеретаскиванияФайлов"));
КонецПроцедуры

Процедура ЗаполнитьРазделОформление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОформление();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекста, Раздел, Зависимости.Независимый, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Шрифт, Раздел, Зависимости.Независимый, Тип("Шрифт"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветФона, Раздел, Зависимости.ВидНадпись, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазмерКартинки, Раздел, Зависимости.ВидКартинка, Тип("РазмерКартинки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветРамки, Раздел, Зависимости.Независимый, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Рамка, Раздел, Зависимости.Независимый, Тип("Рамка"));
КонецПроцедуры

Процедура ЗаполнитьРазделРасположение(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделРасположение();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Ширина, Раздел, Зависимости.Независимый, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Высота, Раздел, Зависимости.Независимый, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяШирина, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяВысота, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ВертикальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложение, Раздел, Зависимости.ВидНадпись, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложение, Раздел, Зависимости.ВидНадпись, Тип("ВертикальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоГоризонтали, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоВертикали, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаЗаголовка, Раздел, Зависимости.ВидНадпись, Тип("Число"));
КонецПроцедуры

Процедура ЗаполнитьРазделСобытия(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделСобытия();
	
	// TODO: Заполнить (issue: #14)
КонецПроцедуры

Процедура ЗаполнитьОбязательныеСвойства(ОписанияСвойств) Экспорт
	// BSLLS:NestedFunctionInParameters-off
	МФОбъектыФормыСлужебный.ДобавитьОбязательноеСвойство(
		ОписанияСвойств, 
		МФОбъектыФормыСлужебный.ИмяСвойстваВид(), 
		ВидДекорацииФормы.Надпись
	);
	// BSLLS:NestedFunctionInParameters-on
КонецПроцедуры

Процедура ЗаполнитьСвойстваНедоступныеНаКлиенте(ОписанияСвойств, СинонимыСвойствЭлементов) Экспорт
	
КонецПроцедуры

#КонецОбласти
