#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Функция СобытияТестируемогоЭлемента() Экспорт
	Возврат СобытияТестируемогоЭлемента;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИмяТестируемогоРеквизита") Тогда
		ТестированиеСлужебный.ПриСозданииТестовойФормы(ЭтотОбъект, Параметры.ИмяТестируемогоРеквизита);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ГруппаФормы_ВидСтраницы

&НаКлиенте
Процедура ГруппаФормы_ВидСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#КонецОбласти
