//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипЭлементаФормы() Экспорт
	Возврат Тип("ТаблицаФормы");
КонецФункции

Функция Идентификаторы() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("ТАБЛИЦАФОРМЫ");
	
	Возврат Результат;
КонецФункции

Функция ЗависимостиСвойств() Экспорт
	Результат = Новый Структура;
	
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "Независимый", Неопределено, Неопределено);
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьРазделОсновные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОсновные();
	
	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Заголовок, Раздел, Зависимость, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПутьКДанным, Раздел, Зависимость, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеЗаголовка, Раздел, Зависимость, Тип("ПоложениеЗаголовкаЭлементаФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Видимость, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Доступность, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ТолькоПросмотр, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПропускатьПриВводе, Раздел, Зависимость, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АктивизироватьПоУмолчанию, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыбора, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.МножественныйВыбор, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВажностьПриОтображении, Раздел, Зависимость, Тип("ВажностьПриОтображении"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоведениеПриНедоступностиОсновногоСервера , Раздел, Зависимость, Тип("ПоведениеПриНедоступностиОсновногоСервера"));
КонецПроцедуры

Процедура ЗаполнитьРазделПредставление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Представление" для таблицы формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделДанные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Данные" для таблицы формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделИспользование(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделИспользование();
	
	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеКоманднойПанели, Раздел, Зависимость, Тип("ПоложениеКоманднойПанелиЭлементаФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИзменятьСоставСтрок, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИзменятьПорядокСтрок, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Отображение, Раздел, Зависимость, Тип("ОтображениеТаблицы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВводаСтрок, Раздел, Зависимость, Тип("РежимВводаСтрокТаблицы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыделения, Раздел, Зависимость, Тип("РежимВыделенияТаблицы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РежимВыделенияСтроки, Раздел, Зависимость, Тип("РежимВыделенияСтрокиТаблицы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Шапка, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Подвал, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Вывод, Раздел, Зависимость, Тип("ИспользованиеВывода"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоВводНовойСтроки, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоВводНезаполненного, Раздел, Зависимость, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоОтметкаНезаполненного, Раздел, Зависимость, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоискПриВводе, Раздел, Зависимость, Тип("ПоискВТаблицеПриВводе"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СочетаниеКлавиш, Раздел, Зависимость, Тип("СочетаниеКлавиш"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьНачалоПеретаскивания, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьПеретаскивание, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СпособПеретаскиванияФайлов, Раздел, Зависимость, Тип("СпособПеретаскиванияФайлов"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Подсказка, Раздел, Зависимость, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеПодсказки, Раздел, Зависимость, Тип("ОтображениеПодсказки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПутьКДаннымКартинкиСтроки, Раздел, Зависимость, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КартинкаСтрок, Раздел, Зависимость, Тип("Картинка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальнаяПолосаПрокрутки, Раздел, Зависимость, Тип("ИспользованиеПолосыПрокрутки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальнаяПолосаПрокрутки, Раздел, Зависимость, Тип("ИспользованиеПолосыПрокрутки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НачальноеОтображениеСписка, Раздел, Зависимость, Тип("НачальноеОтображениеСписка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.НачальноеОтображениеДерева, Раздел, Зависимость, Тип("НачальноеОтображениеДерева"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеСтрокиПоиска, Раздел, Зависимость, Тип("ПоложениеСтрокиПоиска"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеСостоянияПросмотра, Раздел, Зависимость, Тип("ПоложениеСостоянияПросмотра"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеУправленияПоиском, Раздел, Зависимость, Тип("ПоложениеУправленияПоиском"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЗапросОбновления, Раздел, Зависимость, Тип("СпособЗапросаОбновления"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИспользованиеТекущейСтроки, Раздел, Зависимость, Тип("ИспользованиеТекущейСтрокиТаблицы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоведениеПриСжатииПоГоризонтали, Раздел, Зависимость, Тип("ПоведениеТаблицыПриСжатииПоГоризонтали"));
КонецПроцедуры

Процедура ЗаполнитьРазделОформление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОформление();
	
	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальныеЛинии, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальныеЛинии, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЧередованиеЦветовСтрок, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветФона, Раздел, Зависимость, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекста, Раздел, Зависимость, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветРамки, Раздел, Зависимость, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Шрифт, Раздел, Зависимость, Тип("Шрифт"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекстаЗаголовка, Раздел, Зависимость, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ШрифтЗаголовка, Раздел, Зависимость, Тип("Шрифт"));
КонецПроцедуры

Процедура ЗаполнитьРазделРасположение(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделРасположение();
	
	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Ширина, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяШирина, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВариантУправленияВысотой, Раздел, Зависимость, Тип("ВариантУправленияВысотойТаблицы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Высота, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяВысота, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаВСтрокахТаблицы, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяВысотаВСтрокахТаблицы, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеВГруппе, Раздел, Зависимость, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеВГруппе, Раздел, Зависимость, Тип("ВертикальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоГоризонтали, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоВертикали, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаШапки, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаПодвала, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаЗаголовка, Раздел, Зависимость, Тип("Число"));
КонецПроцедуры

Процедура ЗаполнитьРазделСобытия(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделСобытия();
	
	// TODO: Заполнить (issue: #17)
КонецПроцедуры

Процедура ЗаполнитьОбязательныеСвойства(ОписанияСвойств) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьСвойстваНедоступныеНаКлиенте(ОписанияСвойств, СинонимыСвойствЭлементов) Экспорт
	Свойства = Новый Массив;
	Свойства.Добавить(СинонимыСвойствЭлементов.ПутьКДанным);
	Свойства.Добавить(СинонимыСвойствЭлементов.ПутьКДаннымКартинкиСтроки);
	
	МФОбъектыФормыСлужебный.СформироватьСвойстваНедоступныеНаКлиенте(
		ОписанияСвойств,
		Свойства
	);
КонецПроцедуры

#КонецОбласти
