//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп.ФреймворкТестирования().ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование общего макета ""МФСинонимыСвойствЭлементов""")
			.ДобавитьТест("КоличествоКолонок", "Проверка количества колонок макета")
			.ДобавитьТест("БуквыСинонимовНаСоответствующемЯзыке", "Проверка букв синонимов")
	;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура КоличествоКолонок() Экспорт
	_ЮТест = МФТестированиеКлиентСерверПовтИсп.ФреймворкТестирования().ЮТест;
	// Дано
	
	Синонимы = Синонимы();
	
	// Когда
	СтруктураСинонимов = _ЮТест.Предикат()
		.Реквизит("Поле1")
			.Заполнено()
		.Реквизит("Поле2")
			.Заполнено()
		.Реквизит("Поле3")
			.Заполнено()
		.Получить()
	;
	
	// Тогда
	Для Каждого ОписаниеСинонима Из Синонимы Цикл
		ТекстОшибки = СтрШаблон(
			НСтр("ru='Текст в строке %1 ""%2"" не соответствует шаблону ""<Имя Свойства>;<Синоним английский>;<Синоним русский>""'"),
			ОписаниеСинонима.НомерСтроки,
			ОписаниеСинонима.СтрокаМакета
		);
		
		_ЮТест.ОжидаетЧто(ОписаниеСинонима, ТекстОшибки)
			.СоответствуетПредикату(СтруктураСинонимов)
		;
	КонецЦикла;
КонецПроцедуры

Процедура БуквыСинонимовНаСоответствующемЯзыке() Экспорт
	_ЮТест = МФТестированиеКлиентСерверПовтИсп.ФреймворкТестирования().ЮТест;
	// Дано
	
	Синонимы = Синонимы();
	РусскиеБуквы = "^[а-яА-ЯёЁ]+$";
	АнглийскиеБуквы = "^[a-zA-Z]+$";
	
	// Когда
	СтруктураСинонимов = _ЮТест.Предикат()
		.Реквизит("Поле1")
			.ИмеетТип("Строка")
			.СодержитСтрокуПоШаблону(РусскиеБуквы)
		.Реквизит("Поле2")
			.ИмеетТип("Строка")
			.СодержитСтрокуПоШаблону(АнглийскиеБуквы)
		.Реквизит("Поле3")
			.ИмеетТип("Строка")
			.СодержитСтрокуПоШаблону(РусскиеБуквы)
		.Получить()
	;
	
	// Тогда
	Для Каждого ОписаниеСинонима Из Синонимы Цикл
		ТекстОшибки = СтрШаблон(
			НСтр("ru='Текст в строке %1 ""%2"" не соответствует шаблону ""<Русские буквы>;<Английские буквы>;<Русские буквы>""'"),
			ОписаниеСинонима.НомерСтроки,
			ОписаниеСинонима.СтрокаМакета
		);
		
		_ЮТест.ОжидаетЧто(ОписаниеСинонима, ТекстОшибки)
			.СоответствуетПредикату(СтруктураСинонимов)
		;
	КонецЦикла;
КонецПроцедуры

Функция Синонимы()
	Результат = Новый Массив;
	
	Макет = ПолучитьОбщийМакет("МФСинонимыСвойствЭлементов");
	РазделительПолей = ";";
	Для Индекс = 2 По Макет.КоличествоСтрок() Цикл
		СтрокаМакета = Макет.ПолучитьСтроку(Индекс);
		Если ПустаяСтрока(СтрокаМакета) Или (Лев(СтрокаМакета, 1) = "#") Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеСвойства = СтрРазделить(СтрокаМакета, РазделительПолей);
		Синоним = Новый Структура;
		Синоним.Вставить("НомерСтроки", Индекс);
		Синоним.Вставить("СтрокаМакета", СтрокаМакета);
		Для Сч = 1 По ОписаниеСвойства.Количество() Цикл
			Синоним.Вставить("Поле" + Формат(Сч, "ЧГ="), ОписаниеСвойства[Сч - 1]);
		КонецЦикла;
		Результат.Добавить(Синоним);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
