//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗависимостиСвойств() Экспорт
	Результат = Новый Структура;
	
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "Независимый", Неопределено, Неопределено);
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьРазделОсновные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОсновные();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Заголовок, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Действие, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИзменяетСохраняемыеДанные, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИспользованиеТекущейСтроки, Раздел, Зависимости.Независимый, Тип("ИспользованиеТекущейСтроки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИспользуемаяТаблица, Раздел, Зависимости.Независимый, Тип("ТаблицаФормы"));
КонецПроцедуры

Процедура ЗаполнитьРазделПредставление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделПредставление();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Картинка, Раздел, Зависимости.Независимый, Тип("Картинка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Подсказка, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Отображение, Раздел, Зависимости.Независимый, Тип("ОтображениеКнопки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СочетаниеКлавиш, Раздел, Зависимости.Независимый, Тип("СочетаниеКлавиш"));
КонецПроцедуры

Процедура ЗаполнитьРазделДанные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Данные" для команды формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделИспользование(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Использование" для команды формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделОформление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Оформление" для команды формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделРасположение(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Расположение" для команды формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделСобытия(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Собыития" для команды формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьОбязательныеСвойства(ОписанияСвойств) Экспорт

КонецПроцедуры

Процедура ЗаполнитьСвойстваНедоступныеНаКлиенте(ОписанияСвойств, СинонимыСвойствЭлементов) Экспорт

КонецПроцедуры

#КонецОбласти
