//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипЭлементаФормы() Экспорт
	Возврат Тип("ГруппаФормы");
КонецФункции

Функция Идентификаторы() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("ГРУППАФОРМЫ");
	
	Возврат Результат;
КонецФункции

Функция ЗависимостиСвойств() Экспорт
	Результат = Новый Структура;
	
	ИмяСвойстваВид = МФОбъектыФормыСлужебный.ИмяСвойстваВид();
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "Независимый", Неопределено, Неопределено);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидГруппаКнопок", ИмяСвойстваВид, ВидГруппыФормы.ГруппаКнопок);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидГруппаКолонок", ИмяСвойстваВид, ВидГруппыФормы.ГруппаКолонок);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидКоманднаяПанель", ИмяСвойстваВид, ВидГруппыФормы.КоманднаяПанель);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидКонтекстноеМеню", ИмяСвойстваВид, ВидГруппыФормы.КонтекстноеМеню);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидОбычнаяГруппа", ИмяСвойстваВид, ВидГруппыФормы.ОбычнаяГруппа);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПодменю", ИмяСвойстваВид, ВидГруппыФормы.Подменю);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидСтраница", ИмяСвойстваВид, ВидГруппыФормы.Страница);
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидСтраницы", ИмяСвойстваВид, ВидГруппыФормы.Страницы);
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьРазделОсновные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОсновные();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Заголовок, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Вид, Раздел, Зависимости.Независимый, Тип("ВидГруппыФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Видимость, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Доступность, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ТолькоПросмотр, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьИзменениеСостава, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВажностьПриОтображении, Раздел, Зависимости.Независимый, Тип("ВажностьПриОтображении"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПутьКДаннымШапки, Раздел, Зависимости.ВидГруппаКолонок, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Поведение, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ПоведениеОбычнойГруппы"));
	
	ЗависимостьОтображения = Новый Массив;
	ЗависимостьОтображения.Добавить(Зависимости.ВидГруппаКнопок);
	ЗависимостьОтображения.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьОтображения.Добавить(Зависимости.ВидПодменю);
	ТипыОтображения = Новый Массив;
	ТипыОтображения.Добавить(Тип("ОтображениеГруппыКнопок"));
	ТипыОтображения.Добавить(Тип("ОтображениеОбычнойГруппы"));
	ТипыОтображения.Добавить(Тип("ОтображениеКнопки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Отображение, Раздел, ЗависимостьОтображения, ТипыОтображения);
	
	ЗависимостьГруппировка = Новый Массив;
	ЗависимостьГруппировка.Добавить(Зависимости.ВидГруппаКолонок);
	ЗависимостьГруппировка.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьГруппировка.Добавить(Зависимости.ВидСтраница);
	ТипыГруппировка = Новый Массив;
	ТипыГруппировка.Добавить(Тип("ГруппировкаКолонок"));
	ТипыГруппировка.Добавить(Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	ТипыГруппировка.Добавить(Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Группировка, Раздел, ЗависимостьГруппировка, ТипыГруппировка);
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Объединенная, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СквозноеВыравнивание, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("СквозноеВыравнивание"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПутьКДаннымЗаголовка, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("Строка"));
	
	ЗависимостьИспользованиеТекущейСтроки = Новый Массив;
	ЗависимостьИспользованиеТекущейСтроки.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьИспользованиеТекущейСтроки.Добавить(Зависимости.ВидСтраницы);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИспользованиеТекущейСтроки, Раздел, ЗависимостьИспользованиеТекущейСтроки, Тип("ИспользованиеТекущейСтроки"));
	
	ЗависимостьИспользуемаяТаблица = Новый Массив;
	ЗависимостьИспользуемаяТаблица.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьИспользуемаяТаблица.Добавить(Зависимости.ВидСтраницы);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИспользуемаяТаблица, Раздел, ЗависимостьИспользуемаяТаблица, Тип("ТаблицаФормы"));
КонецПроцедуры

Процедура ЗаполнитьРазделПредставление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Представление" для группы формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделДанные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделДанные();
	
	ЗависимостьФормат = Новый Массив;
	ЗависимостьФормат.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьФормат.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Формат, Раздел, ЗависимостьФормат, Тип("Строка"));
КонецПроцедуры

Процедура ЗаполнитьРазделИспользование(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделИспользование();
	
	ЗависимостьСочетаниеКлавиш = Новый Массив;
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидГруппаКнопок);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидГруппаКолонок);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидПодменю);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидКоманднаяПанель);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидКонтекстноеМеню);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидСтраницы);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СочетаниеКлавиш, Раздел, ЗависимостьСочетаниеКлавиш, Тип("СочетаниеКлавиш"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Подсказка, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеПодсказки, Раздел, Зависимости.Независимый, Тип("ОтображениеПодсказки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложение, Раздел, Зависимости.ВидКоманднаяПанель, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьВШапке, Раздел, Зависимости.ВидГруппаКолонок, Тип("Булево"));
	
	ЗависимостьКартинка = Новый Массив;
	ЗависимостьКартинка.Добавить(Зависимости.ВидСтраница);
	ЗависимостьКартинка.Добавить(Зависимости.ВидПодменю);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Картинка, Раздел, ЗависимостьКартинка, Тип("Картинка"));
	
	ЗависимостьВыравниваниеЭлементовИЗаголовков = Новый Массив;
	ЗависимостьВыравниваниеЭлементовИЗаголовков.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьВыравниваниеЭлементовИЗаголовков.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВыравниваниеЭлементовИЗаголовков, Раздел, ЗависимостьВыравниваниеЭлементовИЗаголовков, Тип("ВариантВыравниванияЭлементовИЗаголовков"));
	
	ЗависимостьОтображатьЗаголовок = Новый Массив;
	ЗависимостьОтображатьЗаголовок.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьОтображатьЗаголовок.Добавить(Зависимости.ВидГруппаКолонок);
	ЗависимостьОтображатьЗаголовок.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьЗаголовок, Раздел, ЗависимостьОтображатьЗаголовок, Тип("Булево"));
КонецПроцедуры

Процедура ЗаполнитьРазделОформление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОформление();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекстаЗаголовка, Раздел, Зависимости.Независимый, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ШрифтЗаголовка, Раздел, Зависимости.Независимый, Тип("Шрифт"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Фигура, Раздел, Зависимости.ВидПодменю, Тип("ФигураКнопки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеФигуры, Раздел, Зависимости.ВидПодменю, Тип("ОтображениеФигурыКнопки"));
	
	ЗависимостьГоризонтальныйИнтервал = Новый Массив;
	ЗависимостьГоризонтальныйИнтервал.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьГоризонтальныйИнтервал.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальныйИнтервал, Раздел, ЗависимостьГоризонтальныйИнтервал, Тип("ИнтервалМеждуЭлементамиФормы"));
	
	ЗависимостьВертикальныйИнтервал = Новый Массив;
	ЗависимостьВертикальныйИнтервал.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьВертикальныйИнтервал.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальныйИнтервал, Раздел, ЗависимостьВертикальныйИнтервал, Тип("ИнтервалМеждуЭлементамиФормы"));
	
	ЗависимостьЦветФона = Новый Массив;
	ЗависимостьЦветФона.Добавить(Зависимости.ВидПодменю);
	ЗависимостьЦветФона.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьЦветФона.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветФона, Раздел, ЗависимостьЦветФона, Тип("Цвет"));
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветРамки, Раздел, Зависимости.ВидПодменю, Тип("Цвет"));
КонецПроцедуры

Процедура ЗаполнитьРазделРасположение(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделРасположение();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Ширина, Раздел, Зависимости.Независимый, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Высота, Раздел, Зависимости.Независимый, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ВертикальноеПоложениеЭлемента"));
	
	ЗависимостьПоложениеПодчиненных = Новый Массив;
	ЗависимостьПоложениеПодчиненных.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьПоложениеПодчиненных.Добавить(Зависимости.ВидСтраница);
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеПодчиненных, Раздел, ЗависимостьПоложениеПодчиненных, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеПодчиненных, Раздел, ЗависимостьПоложениеПодчиненных, Тип("ВертикальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоГоризонтали, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоВертикали, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
КонецПроцедуры

Процедура ЗаполнитьРазделСобытия(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделСобытия();
	
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПриСменеСтраницы, Раздел, Зависимости.ВидСтраницы, Тип("Строка"));
КонецПроцедуры

Процедура ЗаполнитьОбязательныеСвойства(ОписанияСвойств) Экспорт
	// BSLLS:NestedFunctionInParameters-off
	МФОбъектыФормыСлужебный.ДобавитьОбязательноеСвойство(
		ОписанияСвойств, 
		МФОбъектыФормыСлужебный.ИмяСвойстваВид(), 
		ВидГруппыФормы.ОбычнаяГруппа
	);
	// BSLLS:NestedFunctionInParameters-on
КонецПроцедуры

Процедура ЗаполнитьСвойстваНедоступныеНаКлиенте(ОписанияСвойств, СинонимыСвойствЭлементов) Экспорт
	Свойства = Новый Массив;
	Свойства.Добавить(СинонимыСвойствЭлементов.ИспользуемаяТаблица);
	Свойства.Добавить(СинонимыСвойствЭлементов.ПутьКДаннымШапки);
	Свойства.Добавить(СинонимыСвойствЭлементов.ПутьКДаннымЗаголовка);
	
	МФОбъектыФормыСлужебный.СформироватьСвойстваНедоступныеНаКлиенте(
		ОписанияСвойств,
		Свойства
	);
КонецПроцедуры

#КонецОбласти
