//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция Зависимость(ИмяПоля, ПредставлениеЗначения) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ИмяПоля", ИмяПоля);
	Результат.Вставить("ПредставлениеЗначения", ПредставлениеЗначения);
	
	Возврат Результат;
КонецФункции

Процедура ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость) Экспорт
	// Дано
	
	_ЮТест = МФТестированиеКлиентСерверПовтИсп.ФреймворкТестирования().ЮТест;
	СинонимыСвойствЭлементов = ТестированиеСлужебныйВызовСервера.СинонимыСвойствЭлементов();
	Попытка
		ТестируемаяФорма = ПолучитьФорму(ИмяТестируемойФормы);
	Исключение
		ТекстИсключения = СтрШаблон(
			НСтр("ru='Не найдена форма ""%1""'"),
			ИмяТестируемойФормы
		);
		
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	ТестируемыйРеквизит = ТестируемаяФорма.Элементы.Найти(ИмяТестируемогоРеквизита);
	Если ТестируемыйРеквизит = Неопределено Тогда
		ТекстИсключения = СтрШаблон(
			НСтр("ru='На форме ""%1"" не найден реквизит ""%2""'"),
			ИмяТестируемойФормы,
			ИмяТестируемогоРеквизита
		);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Когда
	
	ТипЭлементаФормы = ТипЗнч(ТестируемыйРеквизит);
	ОписанияСвойств = ТестированиеСлужебныйВызовСервера.ОписанияСвойствЭлементаФормы(ТипЭлементаФормы, Зависимость);
	СуществующиеСвойства = Новый Соответствие;
	Для Каждого СвойствоЭлемента Из СинонимыСвойствЭлементов Цикл
		Синонимы = СтрРазделить(СвойствоЭлемента.Значение, ",");
		ИдентификаторСвойства = ВРег(Синонимы[0]);
		Если ОписанияСвойств.СвойстваЭлементаНедоступныеНаКлиенте.Найти(ИдентификаторСвойства) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ЗначениеСвойства = ТестируемыйРеквизит[ИдентификаторСвойства];
			СуществующиеСвойства.Вставить(ИдентификаторСвойства, ТипЗнч(ЗначениеСвойства));
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	СуществующиеСвойстваДляПроверки = ОтсортированныйМассивИзКоллекции(СуществующиеСвойства);
	ОпределенныеСвойстваДляПроверки = ОтсортированныйМассивИзКоллекции(ОписанияСвойств.СвойстваЭлемента);
	
	// Тогда
	
	_ЮТест.ОжидаетЧто(СуществующиеСвойстваДляПроверки)
		.Равно(ОпределенныеСвойстваДляПроверки)
	;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтсортированныйМассивИзКоллекции(Коллекция)
	Результат = Новый Массив;
	
	СписокЗначений = Новый СписокЗначений;
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		СписокЗначений.Добавить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Ключ);
	КонецЦикла;
	СписокЗначений.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	Для Каждого ЭлементСписка Из СписокЗначений Цикл
		Результат.Добавить(Новый Структура(
			"ИмяСвойства, ТипСвойства",
			ЭлементСписка.Значение,
			Коллекция.Получить(ЭлементСписка.Значение)
		));
	КонецЦикла;
	
	Возврат Результат;
КонецФункции


#КонецОбласти
