//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция Зависимость(ИмяПоля, ПредставлениеЗначения) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ИмяПоля", ИмяПоля);
	Результат.Вставить("ПредставлениеЗначения", ПредставлениеЗначения);
	
	Возврат Результат;
КонецФункции

Процедура ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость) Экспорт
	// Дано
	
	_ЮТест = МФТестированиеКлиентСерверПовтИсп.ФреймворкТестирования().ЮТест;
	СинонимыСвойствЭлементов = ТестированиеСлужебныйВызовСервера.СинонимыСвойствЭлементов();
	Попытка
		ТестируемаяФорма = ПолучитьФорму(ИмяТестируемойФормы);
	Исключение
		ТекстИсключения = СтрШаблон(
			НСтр("ru='Не найдена форма ""%1""'"),
			ИмяТестируемойФормы
		);
		
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	ТестируемыйРеквизит = ТестируемаяФорма.Элементы.Найти(ИмяТестируемогоРеквизита);
	Если ТестируемыйРеквизит = Неопределено Тогда
		ТекстИсключения = СтрШаблон(
			НСтр("ru='На форме ""%1"" не найден реквизит ""%2""'"),
			ИмяТестируемойФормы,
			ИмяТестируемогоРеквизита
		);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	// Когда
	
	ТипЭлементаФормы = ТипЗнч(ТестируемыйРеквизит);
	ОписанияСвойств = ТестированиеСлужебныйВызовСервера.ОписанияСвойствЭлементаФормы(ТипЭлементаФормы, Зависимость);
	СуществующиеСвойства = Новый Соответствие;
	Для Каждого СвойствоЭлемента Из СинонимыСвойствЭлементов Цикл
		Синонимы = СтрРазделить(СвойствоЭлемента.Значение, ",");
		ИдентификаторСвойства = ВРег(Синонимы[0]);
		Если ОписанияСвойств.СвойстваЭлементаНедоступныеНаКлиенте.Найти(ИдентификаторСвойства) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			ЗначениеСвойства = ТестируемыйРеквизит[ИдентификаторСвойства];
			СуществующиеСвойства.Вставить(ИдентификаторСвойства, ТипЗнч(ЗначениеСвойства));
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	ОтсортироватьПоКлючу(СуществующиеСвойства);
	ОтсортироватьПоКлючу(ОписанияСвойств.СвойстваЭлемента);
	
	// Тогда
	
	_ЮТест.ОжидаетЧто(СуществующиеСвойства)
		.Равно(ОписанияСвойств.СвойстваЭлемента)
	;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтсортироватьПоКлючу(Коллекция)
	Ключи = Новый Массив;
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Ключи.Добавить(ЭлементКоллекции.Ключ);
	КонецЦикла;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Ключи);
	СписокЗначений.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	Ключи = СписокЗначений.ВыгрузитьЗначения();
	ВременнаяКоллекция = СоздатьКоллекцию(Коллекция);
	Для Каждого Ключ Из Ключи Цикл
		ВременнаяКоллекция.Вставить(Ключ, ЗначениеПоКлючу(Коллекция, Ключ));
	КонецЦикла;
	Коллекция.Очистить();
	Для Каждого Элемент Из ВременнаяКоллекция Цикл
		Коллекция.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
КонецПроцедуры

Функция СоздатьКоллекцию(Коллекция)
	ТипКоллекции = ТипЗнч(Коллекция);
	Если ТипКоллекции = Тип("Структура") Тогда
		Результат = Новый Структура;
	ИначеЕсли ТипКоллекции = Тип("Соответствие") Тогда
		Результат = Новый Соответствие;
	Иначе
		ТекстИсключения = СтрШаблон(
			НСтр("ru='Неизестный тип коллекции: %1'"),
			ТипКоллекции
		);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЗначениеПоКлючу(Коллекция, Ключ)
	Результат = Неопределено;
	ТипКоллекции = ТипЗнч(Коллекция);
	Если ТипКоллекции = Тип("Структура") Тогда
		Результат = Коллекция[Ключ];
	ИначеЕсли ТипКоллекции = Тип("Соответствие") Тогда
		Результат = Коллекция.Получить(Ключ);
	Иначе
		ТекстИсключения = СтрШаблон(
			НСтр("ru='Неизестный тип коллекции: %1'"),
			ТипКоллекции
		);
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
