//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КодСимволаРазделителя = 9;
	Элементы.Описание.Заголовок = НСтр("ru='Рекомендуется в качестве символа-разделителя использовать символ <Табуляция> (код символа: 9)'");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСимволРазделитель();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодСимволаРазделителяПриИзменении(Элемент)
	УстановитьСимволРазделитель();
КонецПроцедуры

&НаКлиенте
Процедура СимволРазделительПриИзменении(Элемент)
	КодСимволаРазделителя = КодСимвола(СимволРазделитель);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура OK(Команда)
	РезультатЗакрытия = Новый Структура(
		"КодСимволаРазделителя, СимволРазделитель",
		КодСимволаРазделителя,
		СимволРазделитель
	);
	Закрыть(РезультатЗакрытия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьСимволРазделитель()
	МаксимальныйКодСимвола = 65535;
	Если КодСимволаРазделителя > МаксимальныйКодСимвола Тогда
		КодСимволаРазделителя = МаксимальныйКодСимвола;
	КонецЕсли;
	СимволРазделитель = Символ(КодСимволаРазделителя);
КонецПроцедуры

#КонецОбласти
