&НаКлиенте
Перем МенеджерСертификатов Экспорт;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Пароль = МенеджерСертификатов.ПарольДоступаКЗакрытомуКлючу;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	МенеджерСертификатов.ПарольДоступаКЗакрытомуКлючу = Пароль;
	Закрыть(КодВозвратаДиалога.ОК);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МодификацияФорм.МодифицироватьФорму(
		ЭтаФорма,
		Отказ,
		"Обработки.ОписанияМодификацийФорм.Справочник_ХранимыеФайлы_ФормаПароля"
	);
КонецПроцедуры
