//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипЭлементаФормы() Экспорт
	Возврат Тип("ГруппаФормы");
КонецФункции

Функция Идентификаторы() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("ГРУППАФОРМЫ");
	
	Возврат Результат;
КонецФункции

Функция ЗависимостиСвойств() Экспорт
	Результат = Новый Структура;
	
	ИмяСвойстваВид = МФЭлементыФормыСлужебный.ИмяСвойстваВид();
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "Независимый", Неопределено, Неопределено);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидГруппаКнопок", ИмяСвойстваВид, ВидГруппыФормы.ГруппаКнопок);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидГруппаКолонок", ИмяСвойстваВид, ВидГруппыФормы.ГруппаКолонок);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидКоманднаяПанель", ИмяСвойстваВид, ВидГруппыФормы.КоманднаяПанель);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидКонтекстноеМеню", ИмяСвойстваВид, ВидГруппыФормы.КонтекстноеМеню);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидОбычнаяГруппа", ИмяСвойстваВид, ВидГруппыФормы.ОбычнаяГруппа);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидПодменю", ИмяСвойстваВид, ВидГруппыФормы.Подменю);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидСтраница", ИмяСвойстваВид, ВидГруппыФормы.Страница);
	МФЭлементыФормыСлужебный.ДобавитьЗависимость(Результат, "ВидСтраницы", ИмяСвойстваВид, ВидГруппыФормы.Страницы);
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьРазделОсновные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОсновные();
	
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Заголовок, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Вид, Раздел, Зависимости.Независимый, Тип("ВидГруппыФормы"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Видимость, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Доступность, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ТолькоПросмотр, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.РазрешитьИзменениеСостава, Раздел, Зависимости.Независимый, Тип("Булево"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ВажностьПриОтображении, Раздел, Зависимости.Независимый, Тип("ВажностьПриОтображении"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ПутьКДаннымШапки, Раздел, Зависимости.ВидГруппаКолонок, Тип("Строка"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Поведение, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ПоведениеОбычнойГруппы"));
	
	ЗависимостьОтображения = Новый Массив;
	ЗависимостьОтображения.Добавить(Зависимости.ВидГруппаКнопок);
	ЗависимостьОтображения.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьОтображения.Добавить(Зависимости.ВидПодменю);
	ТипыОтображения = Новый Массив;
	ТипыОтображения.Добавить(Тип("ОтображениеГруппыКнопок"));
	ТипыОтображения.Добавить(Тип("ОтображениеОбычнойГруппы"));
	ТипыОтображения.Добавить(Тип("ОтображениеКнопки"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Отображение, Раздел, ЗависимостьОтображения, ТипыОтображения);
	
	ЗависимостьГруппировка = Новый Массив;
	ЗависимостьГруппировка.Добавить(Зависимости.ВидГруппаКолонок);
	ЗависимостьГруппировка.Добавить(Зависимости.ВидОбычнаяГруппа);
	ТипыГруппировка = Новый Массив;
	ТипыГруппировка.Добавить(Тип("ГруппировкаКолонок"));
	ТипыГруппировка.Добавить(Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Группировка, Раздел, ЗависимостьГруппировка, ТипыГруппировка);
	
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Объединенная, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("Булево"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.СквозноеВыравнивание, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("СквозноеВыравнивание"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ПутьКДаннымЗаголовка, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("Строка"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ИспользованиеТекущейСтроки, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ИспользованиеТекущейСтроки"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ИспользуемаяТаблица, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ТаблицаФормы"));
КонецПроцедуры

Процедура ЗаполнитьРазделДанные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Данные" для группы формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделИспользование(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделИспользование();
	
	ЗависимостьСочетаниеКлавиш = Новый Массив;
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидОбычнаяГруппа);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидКоманднаяПанель);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидСтраницы);
	ЗависимостьСочетаниеКлавиш.Добавить(Зависимости.ВидСтраница);
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.СочетаниеКлавиш, Раздел, ЗависимостьСочетаниеКлавиш, Тип("СочетаниеКлавиш"));
	
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Подсказка, Раздел, Зависимости.Независимый, Тип("Строка"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеПодсказки, Раздел, Зависимости.Независимый, Тип("ОтображениеПодсказки"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ВыравниваниеЭлементовИЗаголовков, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ВариантВыравниванияЭлементовИЗаголовков"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ОтображатьЗаголовок, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("Булево"));
КонецПроцедуры

Процедура ЗаполнитьРазделОформление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОформление();
	
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекстаЗаголовка, Раздел, Зависимости.Независимый, Тип("Цвет"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ШрифтЗаголовка, Раздел, Зависимости.Независимый, Тип("Шрифт"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальныйИнтервал, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ИнтервалМеждуЭлементамиФормы"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальныйИнтервал, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ИнтервалМеждуЭлементамиФормы"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ЦветФона, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("Цвет"));
КонецПроцедуры

Процедура ЗаполнитьРазделРасположение(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделРасположение();
	
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Ширина, Раздел, Зависимости.Независимый, Тип("Число"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.Высота, Раздел, Зависимости.Независимый, Тип("Число"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеВГруппе, Раздел, Зависимости.Независимый, Тип("ВертикальноеПоложениеЭлемента"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеПодчиненных, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеПодчиненных, Раздел, Зависимости.ВидОбычнаяГруппа, Тип("ВертикальноеПоложениеЭлемента"));
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоГоризонтали, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
	МФЭлементыФормыСлужебный.ДобавитьОписаниеСвойстваЭлементаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоВертикали, Раздел, Зависимости.Независимый, МФПовтИсп.ТипБулевоНеопределено());
КонецПроцедуры

Процедура ЗаполнитьРазделСобытия(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделСобытия();
	
	// TODO: Заполнить (issue: #13)
КонецПроцедуры

Процедура ЗаполнитьОбязательныеСвойства(ОписанияСвойств) Экспорт
	// BSLLS:NestedFunctionInParameters-off
	МФЭлементыФормыСлужебный.ДобавитьОбязательноеСвойство(
		ОписанияСвойств, 
		МФЭлементыФормыСлужебный.ИмяСвойстваВид(), 
		ВидГруппыФормы.ОбычнаяГруппа
	);
	// BSLLS:NestedFunctionInParameters-on
КонецПроцедуры

#КонецОбласти
