//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипЭлементаФормы() Экспорт
	Возврат Тип("КнопкаФормы");
КонецФункции

Функция Идентификаторы() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("КНОПКАФОРМЫ");
	
	Возврат Результат;
КонецФункции

Функция ЗависимостиСвойств() Экспорт
	Результат = Новый Структура;
	
	МФОбъектыФормыСлужебный.ДобавитьЗависимость(Результат, "Независимый", Неопределено, Неопределено);
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьРазделОсновные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОсновные();
	
	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Заголовок, Раздел, Зависимость, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Вид, Раздел, Зависимость, Тип("ВидКнопкиФормы"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ИмяКоманды, Раздел, Зависимость, Тип("Строка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Видимость, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Доступность, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Отображение, Раздел, Зависимость, Тип("ОтображениеКнопки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Картинка, Раздел, Зависимость, Тип("Картинка"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.КнопкаПоУмолчанию, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПропускатьПриВводе, Раздел, Зависимость, МФПовтИсп.ТипБулевоНеопределено());
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АктивизироватьПоУмолчанию, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Пометка, Раздел, Зависимость, Тип("Булево"));
	// Отображение в контекстном меню?
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВажностьПриОтображении, Раздел, Зависимость, Тип("ВажностьПриОтображении"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеВКоманднойПанели, Раздел, Зависимость, Тип("ПоложениеКнопкиВКоманднойПанели"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.УникальностьКоманды, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоведениеПриНедоступностиОсновногоСервера, Раздел, Зависимость, Тип("ПоведениеПриНедоступностиОсновногоСервера"));
КонецПроцедуры

Процедура ЗаполнитьРазделПредставление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Представление" для кнопки формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделДанные(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	// Раздел "Данные" для кнопки формы не заполняется
КонецПроцедуры

Процедура ЗаполнитьРазделИспользование(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделИспользование();

	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеПодсказки, Раздел, Зависимость, Тип("ОтображениеПодсказки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.СочетаниеКлавиш, Раздел, Зависимость, Тип("СочетаниеКлавиш"));
КонецПроцедуры

Процедура ЗаполнитьРазделОформление(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделОформление();
	
	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветФона, Раздел, Зависимость, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветТекста, Раздел, Зависимость, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ЦветРамки, Раздел, Зависимость, Тип("Цвет"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Шрифт, Раздел, Зависимость, Тип("Шрифт"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Фигура, Раздел, Зависимость, Тип("ФигураКнопки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ОтображениеФигуры, Раздел, Зависимость, Тип("ОтображениеФигурыКнопки"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ПоложениеКартинки, Раздел, Зависимость, Тип("ПоложениеКартинкиКнопкиФормы"));
КонецПроцедуры

Процедура ЗаполнитьРазделРасположение(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделРасположение();
	
	Зависимость = Зависимости.Независимый;
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Ширина, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.Высота, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяШирина, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.АвтоМаксимальнаяВысота, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВысотаЗаголовка, Раздел, Зависимость, Тип("Число"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ГоризонтальноеПоложениеВГруппе, Раздел, Зависимость, Тип("ГоризонтальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.ВертикальноеПоложениеВГруппе, Раздел, Зависимость, Тип("ВертикальноеПоложениеЭлемента"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоГоризонтали, Раздел, Зависимость, Тип("Булево"));
	МФОбъектыФормыСлужебный.ДобавитьОписаниеСвойстваОбъектаФормы(ОписанияСвойств, СинонимыСвойств.РастягиватьПоВертикали, Раздел, Зависимость, Тип("Булево"));
КонецПроцедуры

Процедура ЗаполнитьРазделСобытия(ОписанияСвойств, СинонимыСвойств, Зависимости) Экспорт
	Раздел = МФПовтИсп.РазделСобытия();
	
	// TODO: Заполнить (issue: #15)
КонецПроцедуры

Процедура ЗаполнитьОбязательныеСвойства(ОписанияСвойств) Экспорт
	// BSLLS:NestedFunctionInParameters-off
	МФОбъектыФормыСлужебный.ДобавитьОбязательноеСвойство(
		ОписанияСвойств, 
		МФОбъектыФормыСлужебный.ИмяСвойстваВид(), 
		ВидКнопкиФормы.ОбычнаяКнопка
	);
	// BSLLS:NestedFunctionInParameters-on
КонецПроцедуры

Процедура ЗаполнитьСвойстваНедоступныеНаКлиенте(ОписанияСвойств, СинонимыСвойствЭлементов) Экспорт
	
КонецПроцедуры

#КонецОбласти
