//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

// BSLLS:LineLength-off

#Область СлужебныйПрограммныйИнтерфейс

Функция Значения() Экспорт
	Результат = Новый Соответствие;
	
	Результат.Вставить(Тип("АвтоИзменениеРегистраПриВводеТекста"), ЗначенияАвтоИзменениеРегистраПриВводеТекста());
	Результат.Вставить(Тип("АвтоИсправлениеПриВводеТекста"), ЗначенияАвтоИсправлениеПриВводеТекста());
	
	Результат.Вставить(Тип("Булево"), ЗначенияБулево());
	Результат.Вставить(МФПовтИсп.ТипБулевоНеопределено(), ЗначенияБулевоНеопределено());
	
	Результат.Вставить(Тип("ВажностьПриОтображении"), ЗначенияВажностьПриОтображении());
	Результат.Вставить(Тип("ВариантВыравниванияЭлементовИЗаголовков"), ЗначенияВариантВыравниванияЭлементовИЗаголовков());
	Результат.Вставить(Тип("ВариантУправленияВысотойТаблицы"), ЗначенияВариантУправленияВысотойТаблицы());
	Результат.Вставить(Тип("ВариантУправленияВысотойЭлемента"), ЗначенияВариантУправленияВысотойЭлемента());
	Результат.Вставить(Тип("ВертикальноеПоложениеЭлемента"), ЗначенияВертикальноеПоложениеЭлемента());
	Результат.Вставить(Тип("ВидГруппыФормы"), ЗначенияВидГруппыФормы());
	Результат.Вставить(Тип("ВидДекорацииФормы"), ЗначенияВидДекорацииФормы());
	Результат.Вставить(Тип("ВидКнопкиФормы"), ЗначенияВидКнопкиФормы());
	Результат.Вставить(Тип("ВидПереключателя"), ЗначенияВидПереключателя());
	Результат.Вставить(Тип("ВидПоляФормы"), ЗначенияВидПоляФормы());
	Результат.Вставить(Тип("ВидФлажка"), ЗначенияВидФлажка());
	
	Результат.Вставить(Тип("ГоризонтальноеПоложениеЭлемента"), ЗначенияГоризонтальноеПоложениеЭлемента());
	Результат.Вставить(Тип("ГруппировкаКолонок"), ЗначенияГруппировкаКолонок());
	Результат.Вставить(Тип("ГруппировкаПодчиненныхЭлементовФормы"), ЗначенияГруппировкаПодчиненныхЭлементовФормы());
	Результат.Вставить(Тип("ГруппыИЭлементы"), ЗначенияГруппыИЭлементы());
	
	Результат.Вставить(Тип("ИнтервалМеждуЭлементамиФормы"), ЗначенияИнтервалМеждуЭлементамиФормы());
	Результат.Вставить(Тип("ИспользованиеВывода"), ЗначенияИспользованиеВывода());
	Результат.Вставить(Тип("ИспользованиеПолосыПрокрутки"), ЗначенияИспользованиеПолосыПрокрутки());
	Результат.Вставить(Тип("ИспользованиеТекущейСтроки"), ЗначенияИспользованиеТекущейСтроки());
	Результат.Вставить(Тип("ИспользованиеТекущейСтрокиТаблицы"), ЗначенияИспользованиеТекущейСтрокиТаблицы());
	Результат.Вставить(Тип("ИсторияВыбораПриВводе"), ЗначенияИсторияВыбораПриВводе());
	
	Результат.Вставить(Тип("НачальноеОтображениеДерева"), ЗначенияНачальноеОтображениеДерева());
	Результат.Вставить(Тип("НачальноеОтображениеСписка"), ЗначенияНачальноеОтображениеСписка());
	
	Результат.Вставить(Тип("ОбновлениеТекстаРедактирования"), ЗначенияОбновлениеТекстаРедактирования());
	Результат.Вставить(Тип("ОриентацияЭлементаФормы"), ЗначенияОриентацияЭлементаФормы());
	Результат.Вставить(Тип("ОтображениеГруппыКнопок"), ЗначенияОтображениеГруппыКнопок());
	Результат.Вставить(Тип("ОтображениеКнопки"), ЗначенияОтображениеКнопки());
	Результат.Вставить(Тип("ОтображениеКнопкиВыбора"), ЗначенияОтображениеКнопкиВыбора());
	Результат.Вставить(Тип("ОтображениеОбычнойГруппы"), ЗначенияОтображениеОбычнойГруппы());
	Результат.Вставить(Тип("ОтображениеПодсказки"), ЗначенияОтображениеПодсказки());
	Результат.Вставить(Тип("ОтображениеПредупрежденияПриРедактировании"), ЗначенияОтображениеПредупрежденияПриРедактировании());
	Результат.Вставить(Тип("ОтображениеРазметкиПолосыРегулирования"), ЗначенияОтображениеРазметкиПолосыРегулирования());
	Результат.Вставить(Тип("ОтображениеТаблицы"), ЗначенияОтображениеТаблицы());
	Результат.Вставить(Тип("ОтображениеФигурыКнопки"), ЗначенияОтображениеФигурыКнопки());
	
	Результат.Вставить(Тип("ПоведениеОбычнойГруппы"), ЗначенияПоведениеОбычнойГруппы());
	Результат.Вставить(Тип("ПоведениеПриНедоступностиОсновногоСервера"), ЗначенияПоведениеПриНедоступностиОсновногоСервера());
	Результат.Вставить(Тип("ПоведениеТаблицыПриСжатииПоГоризонтали"), ЗначенияПоведениеТаблицыПриСжатииПоГоризонтали());
	Результат.Вставить(Тип("ПодсказкаАвтоЗаполненияПоляВвода"), ЗначенияПодсказкаАвтоЗаполненияПоляВвода());
	Результат.Вставить(Тип("ПоискВТаблицеПриВводе"), ЗначенияПоискВТаблицеПриВводе());
	Результат.Вставить(Тип("ПоложениеЗаголовкаЭлементаФормы"), ЗначенияПоложениеЗаголовкаЭлементаФормы());
	Результат.Вставить(Тип("ПоложениеКартинкиКнопкиФормы"), ЗначенияПоложениеКартинкиКнопкиФормы());
	Результат.Вставить(Тип("ПоложениеКнопкиВКоманднойПанели"), ЗначенияПоложениеКнопкиВКоманднойПанели());
	Результат.Вставить(Тип("ПоложениеКоманднойПанелиЭлементаФормы"), ЗначенияПоложениеКоманднойПанелиЭлементаФормы());
	Результат.Вставить(Тип("ПоложениеСостоянияПросмотра"), ЗначенияПоложениеСостоянияПросмотра());
	Результат.Вставить(Тип("ПоложениеСтрокиПоиска"), ЗначенияПоложениеСтрокиПоиска());
	Результат.Вставить(Тип("ПоложениеТаблицыДиаграммыГанта"), ЗначенияПоложениеТаблицыДиаграммыГанта());
	Результат.Вставить(Тип("ПоложениеУправленияПоиском"), ЗначенияПоложениеУправленияПоиском());
	Результат.Вставить(Тип("ПроверкаПравописанияПриВводеТекста"), ЗначенияПроверкаПравописанияПриВводеТекста());
	
	Результат.Вставить(Тип("РазмерКартинки"), ЗначенияРазмерКартинки());
	Результат.Вставить(Тип("РежимОтображенияВыделения"), ЗначенияРежимОтображенияВыделения());
	Результат.Вставить(Тип("РежимОтображенияВыделенияРисунков"), ЗначенияРежимОтображенияВыделенияРисунков());
	Результат.Вставить(Тип("РежимАвтоОтображенияКнопкиОткрытия"), ЗначенияРежимАвтоОтображенияКнопкиОткрытия());
	Результат.Вставить(Тип("РежимАвтоОтображенияКнопкиОчистки"), ЗначенияРежимАвтоОтображенияКнопкиОчистки());
	Результат.Вставить(Тип("РежимВводаСтрокТаблицы"), ЗначенияРежимВводаСтрокТаблицы());
	Результат.Вставить(Тип("РежимВыбораНезаполненного"), ЗначенияРежимВыбораНезаполненного());
	Результат.Вставить(Тип("РежимВыделенияДаты"), ЗначенияРежимВыделенияДаты());
	Результат.Вставить(Тип("РежимВыделенияЗначенийДиаграммыГанта"), ЗначенияРежимВыделенияЗначенийДиаграммыГанта());
	Результат.Вставить(Тип("РежимВыделенияИнтерваловДиаграммыГанта"), ЗначенияРежимВыделенияИнтерваловДиаграммыГанта());
	Результат.Вставить(Тип("РежимВыделенияСтрокиТаблицы"), ЗначенияРежимВыделенияСтрокиТаблицы());
	Результат.Вставить(Тип("РежимВыделенияТаблицы"), ЗначенияРежимВыделенияТаблицы());
	Результат.Вставить(Тип("РежимМасштабированияПросмотра"), ЗначенияРежимМасштабированияПросмотра());
	Результат.Вставить(Тип("РежимСглаживанияИндикатора"), ЗначенияРежимСглаживанияИндикатора());
	
	Результат.Вставить(Тип("СквозноеВыравнивание"), ЗначенияСквозноеВыравнивание());
	Результат.Вставить(Тип("СпециальныйРежимВводаТекста"), ЗначенияСпециальныйРежимВводаТекста());
	Результат.Вставить(Тип("СпособЗапросаОбновления"), ЗначенияСпособЗапросаОбновления());
	Результат.Вставить(Тип("СпособПеретаскиванияФайлов"), ЗначенияСпособПеретаскиванияФайлов());
	
	Результат.Вставить(Тип("ТекстКнопкиВводаЭкраннойКлавиатуры"), ЗначенияТекстКнопкиВводаЭкраннойКлавиатуры());
	Результат.Вставить(Тип("ТипКурсоровТабличногоДокумента"), ЗначенияТипКурсоровТабличногоДокумента());
	Результат.Вставить(Тип("ТипРамкиЭлементаУправления"), ЗначенияТипРамкиЭлементаУправления());
	
	Результат.Вставить(Тип("ФигураКнопки"), ЗначенияФигураКнопки());
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначенияАвтоИзменениеРегистраПриВводеТекста()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), АвтоИзменениеРегистраПриВводеТекста.Авто);
	Результат.Вставить(ВРег("ВсеСимволы"), АвтоИзменениеРегистраПриВводеТекста.ВсеСимволы);
	Результат.Вставить(ВРег("Нет"), АвтоИзменениеРегистраПриВводеТекста.Нет);
	Результат.Вставить(ВРег("Предложения"), АвтоИзменениеРегистраПриВводеТекста.Предложения);
	Результат.Вставить(ВРег("Слова"), АвтоИзменениеРегистраПриВводеТекста.Слова);
	
	// английский
	Результат.Вставить(ВРег("Auto"), АвтоИзменениеРегистраПриВводеТекста.Авто);
	Результат.Вставить(ВРег("AllCharacters"), АвтоИзменениеРегистраПриВводеТекста.ВсеСимволы);
	Результат.Вставить(ВРег("None"), АвтоИзменениеРегистраПриВводеТекста.Нет);
	Результат.Вставить(ВРег("Sentences"), АвтоИзменениеРегистраПриВводеТекста.Предложения);
	Результат.Вставить(ВРег("Words"), АвтоИзменениеРегистраПриВводеТекста.Слова);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияАвтоИсправлениеПриВводеТекста()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), АвтоИсправлениеПриВводеТекста.Авто);
	Результат.Вставить(ВРег("Использовать"), АвтоИсправлениеПриВводеТекста.Использовать);
	Результат.Вставить(ВРег("НеИспользовать"), АвтоИсправлениеПриВводеТекста.НеИспользовать);
	
	// английский
	Результат.Вставить(ВРег("Auto"), АвтоИсправлениеПриВводеТекста.Авто);
	Результат.Вставить(ВРег("Use"), АвтоИсправлениеПриВводеТекста.Использовать);
	Результат.Вставить(ВРег("DontUse"), АвтоИсправлениеПриВводеТекста.НеИспользовать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияБулево()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Истина"), Истина);
	Результат.Вставить(ВРег("Ложь"), Ложь);
	Результат.Вставить(ВРег("Да"), Истина);
	Результат.Вставить(ВРег("Нет"), Ложь);
	
	// английский
	Результат.Вставить(ВРег("True"), Истина);
	Результат.Вставить(ВРег("False"), Ложь);
	Результат.Вставить(ВРег("Yes"), Истина);
	Результат.Вставить(ВРег("No"), Ложь);
	
	// Числа
	Результат.Вставить("1", Истина);
	Результат.Вставить("0", Ложь);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияБулевоНеопределено()
	Результат = ЗначенияБулево();
	
	// русский
	Результат.Вставить(ВРег("Неопределено"), Неопределено);
	
	// английский
	Результат.Вставить(ВРег("Undefined"), Неопределено);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВажностьПриОтображении()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ВажностьПриОтображении.Авто);
	Результат.Вставить(ВРег("Высокая"), ВажностьПриОтображении.Высокая);
	Результат.Вставить(ВРег("Низкая"), ВажностьПриОтображении.Низкая);
	Результат.Вставить(ВРег("Обычная"), ВажностьПриОтображении.Обычная);
	Результат.Вставить(ВРег("ОченьВысокая"), ВажностьПриОтображении.ОченьВысокая);
	Результат.Вставить(ВРег("ОченьНизкая"), ВажностьПриОтображении.ОченьНизкая);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ВажностьПриОтображении.Авто);
	Результат.Вставить(ВРег("High"), ВажностьПриОтображении.Высокая);
	Результат.Вставить(ВРег("Low"), ВажностьПриОтображении.Низкая);
	Результат.Вставить(ВРег("Usual"), ВажностьПриОтображении.Обычная);
	Результат.Вставить(ВРег("VeryHigh"), ВажностьПриОтображении.ОченьВысокая);
	Результат.Вставить(ВРег("VeryLow"), ВажностьПриОтображении.ОченьНизкая);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВариантВыравниванияЭлементовИЗаголовков()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ВариантВыравниванияЭлементовИЗаголовков.Авто);
	Результат.Вставить(ВРег("Нет"), ВариантВыравниванияЭлементовИЗаголовков.Нет);
	Результат.Вставить(ВРег("ЭлементыЛевоЗаголовкиЛево"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиЛево);
	Результат.Вставить(ВРег("ЭлементыЛевоЗаголовкиПраво"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиПраво);
	Результат.Вставить(ВРег("ЭлементыПравоЗаголовкиЛево"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево);
	Результат.Вставить(ВРег("ЭлементыПравоЗаголовкиПраво"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиПраво);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ВариантВыравниванияЭлементовИЗаголовков.Авто);
	Результат.Вставить(ВРег("None"), ВариантВыравниванияЭлементовИЗаголовков.Нет);
	Результат.Вставить(ВРег("ItemsLeftTitlesLeft"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиЛево);
	Результат.Вставить(ВРег("ItemsLeftTitlesRight"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиПраво);
	Результат.Вставить(ВРег("ItemsRightTitlesLeft"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево);
	Результат.Вставить(ВРег("ItemsRightTitlesRight"), ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиПраво);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВариантУправленияВысотойТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ВариантУправленияВысотойТаблицы.Авто);
	Результат.Вставить(ВРег("ВСтрокахТаблицы"), ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы);
	Результат.Вставить(ВРег("ВСтрокахФормы"), ВариантУправленияВысотойТаблицы.ВСтрокахФормы);
	Результат.Вставить(ВРег("ПоСодержимому"), ВариантУправленияВысотойТаблицы.ПоСодержимому);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ВариантУправленияВысотойТаблицы.Авто);
	Результат.Вставить(ВРег("UseHeightInTableRows"), ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы);
	Результат.Вставить(ВРег("UseHeightInFormRows"), ВариантУправленияВысотойТаблицы.ВСтрокахФормы);
	Результат.Вставить(ВРег("UseContentHeight"), ВариантУправленияВысотойТаблицы.ПоСодержимому);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВариантУправленияВысотойЭлемента()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ВариантУправленияВысотойЭлемента.Авто);
	Результат.Вставить(ВРег("ВСтрокахФормы"), ВариантУправленияВысотойЭлемента.ВСтрокахФормы);
	Результат.Вставить(ВРег("ПоСодержимому"), ВариантУправленияВысотойЭлемента.ПоСодержимому);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ВариантУправленияВысотойЭлемента.Авто);
	Результат.Вставить(ВРег("UseHeightInFormRows"), ВариантУправленияВысотойЭлемента.ВСтрокахФормы);
	Результат.Вставить(ВРег("UseContentHeight"), ВариантУправленияВысотойЭлемента.ПоСодержимому);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВертикальноеПоложениеЭлемента()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ВертикальноеПоложениеЭлемента.Авто);
	Результат.Вставить(ВРег("Верх"), ВертикальноеПоложениеЭлемента.Верх);
	Результат.Вставить(ВРег("Низ"), ВертикальноеПоложениеЭлемента.Низ);
	Результат.Вставить(ВРег("Центр"), ВертикальноеПоложениеЭлемента.Центр);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ВертикальноеПоложениеЭлемента.Авто);
	Результат.Вставить(ВРег("Top"), ВертикальноеПоложениеЭлемента.Верх);
	Результат.Вставить(ВРег("Bottom"), ВертикальноеПоложениеЭлемента.Низ);
	Результат.Вставить(ВРег("Center"), ВертикальноеПоложениеЭлемента.Центр);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидГруппыФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("ГруппаКнопок"), ВидГруппыФормы.ГруппаКнопок);
	Результат.Вставить(ВРег("ГруппаКолонок"), ВидГруппыФормы.ГруппаКолонок);
	Результат.Вставить(ВРег("КоманднаяПанель"), ВидГруппыФормы.КоманднаяПанель);
	Результат.Вставить(ВРег("КонтекстноеМеню"), ВидГруппыФормы.КонтекстноеМеню);
	Результат.Вставить(ВРег("ОбычнаяГруппа"), ВидГруппыФормы.ОбычнаяГруппа);
	Результат.Вставить(ВРег("Подменю"), ВидГруппыФормы.Подменю);
	Результат.Вставить(ВРег("Страница"), ВидГруппыФормы.Страница);
	Результат.Вставить(ВРег("Страницы"), ВидГруппыФормы.Страницы);
	
	// английский
	Результат.Вставить(ВРег("ButtonGroup"), ВидГруппыФормы.ГруппаКнопок);
	Результат.Вставить(ВРег("ColumnGroup"), ВидГруппыФормы.ГруппаКолонок);
	Результат.Вставить(ВРег("CommandBar"), ВидГруппыФормы.КоманднаяПанель);
	Результат.Вставить(ВРег("ContextMenu"), ВидГруппыФормы.КонтекстноеМеню);
	Результат.Вставить(ВРег("UsualGroup"), ВидГруппыФормы.ОбычнаяГруппа);
	Результат.Вставить(ВРег("Popup"), ВидГруппыФормы.Подменю);
	Результат.Вставить(ВРег("Page"), ВидГруппыФормы.Страница);
	Результат.Вставить(ВРег("Pages"), ВидГруппыФормы.Страницы);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидДекорацииФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Картинка"), ВидДекорацииФормы.Картинка);
	Результат.Вставить(ВРег("Надпись"), ВидДекорацииФормы.Надпись);
	
	// английский
	Результат.Вставить(ВРег("Picture"), ВидДекорацииФормы.Картинка);
	Результат.Вставить(ВРег("Label"), ВидДекорацииФормы.Надпись);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидКнопкиФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Гиперссылка"), ВидКнопкиФормы.Гиперссылка);
	Результат.Вставить(ВРег("ГиперссылкаКоманднойПанели"), ВидКнопкиФормы.ГиперссылкаКоманднойПанели);
	Результат.Вставить(ВРег("КнопкаКоманднойПанели"), ВидКнопкиФормы.КнопкаКоманднойПанели);
	Результат.Вставить(ВРег("ОбычнаяКнопка"), ВидКнопкиФормы.ОбычнаяКнопка);
	
	// английский
	Результат.Вставить(ВРег("Hyperlink"), ВидКнопкиФормы.Гиперссылка);
	Результат.Вставить(ВРег("CommandBarHyperlink"), ВидКнопкиФормы.ГиперссылкаКоманднойПанели);
	Результат.Вставить(ВРег("CommandBarButton"), ВидКнопкиФормы.КнопкаКоманднойПанели);
	Результат.Вставить(ВРег("UsualButton"), ВидКнопкиФормы.ОбычнаяКнопка);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидПереключателя()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ВидПереключателя.Авто);
	Результат.Вставить(ВРег("Переключатель"), ВидПереключателя.Переключатель);
	Результат.Вставить(ВРег("Тумблер"), ВидПереключателя.Тумблер);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ВидПереключателя.Авто);
	Результат.Вставить(ВРег("RadioButton"), ВидПереключателя.Переключатель);
	Результат.Вставить(ВРег("Tumbler"), ВидПереключателя.Тумблер);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидПоляФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("ПолеHTMLДокумента"), ВидПоляФормы.ПолеHTMLДокумента);
	Результат.Вставить(ВРег("ПолеPDFДокумента"), ВидПоляФормы.ПолеPDFДокумента);
	Результат.Вставить(ВРег("ПолеВвода"), ВидПоляФормы.ПолеВвода);
	Результат.Вставить(ВРег("ПолеГеографическойСхемы"), ВидПоляФормы.ПолеГеографическойСхемы);
	Результат.Вставить(ВРег("ПолеГрафическойСхемы"), ВидПоляФормы.ПолеГрафическойСхемы);
	Результат.Вставить(ВРег("ПолеДендрограммы"), ВидПоляФормы.ПолеДендрограммы);
	Результат.Вставить(ВРег("ПолеДиаграммы"), ВидПоляФормы.ПолеДиаграммы);
	Результат.Вставить(ВРег("ПолеДиаграммыГанта"), ВидПоляФормы.ПолеДиаграммыГанта);
	Результат.Вставить(ВРег("ПолеИндикатора"), ВидПоляФормы.ПолеИндикатора);
	Результат.Вставить(ВРег("ПолеКалендаря"), ВидПоляФормы.ПолеКалендаря);
	Результат.Вставить(ВРег("ПолеКартинки"), ВидПоляФормы.ПолеКартинки);
	Результат.Вставить(ВРег("ПолеНадписи"), ВидПоляФормы.ПолеНадписи);
	Результат.Вставить(ВРег("ПолеПереключателя"), ВидПоляФормы.ПолеПереключателя);
	Результат.Вставить(ВРег("ПолеПериода"), ВидПоляФормы.ПолеПериода);
	Результат.Вставить(ВРег("ПолеПланировщика"), ВидПоляФормы.ПолеПланировщика);
	Результат.Вставить(ВРег("ПолеПолосыРегулирования"), ВидПоляФормы.ПолеПолосыРегулирования);
	Результат.Вставить(ВРег("ПолеТабличногоДокумента"), ВидПоляФормы.ПолеТабличногоДокумента);
	Результат.Вставить(ВРег("ПолеТекстовогоДокумента"), ВидПоляФормы.ПолеТекстовогоДокумента);
	Результат.Вставить(ВРег("ПолеФлажка"), ВидПоляФормы.ПолеФлажка);
	Результат.Вставить(ВРег("ПолеФорматированногоДокумента"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	// английский
	Результат.Вставить(ВРег("HTMLDocumentField"), ВидПоляФормы.ПолеHTMLДокумента);
	Результат.Вставить(ВРег("PDFDocumentField"), ВидПоляФормы.ПолеPDFДокумента);
	Результат.Вставить(ВРег("InputField"), ВидПоляФормы.ПолеВвода);
	Результат.Вставить(ВРег("GeographicalSchemaField"), ВидПоляФормы.ПолеГеографическойСхемы);
	Результат.Вставить(ВРег("GraphicalSchemaField"), ВидПоляФормы.ПолеГрафическойСхемы);
	Результат.Вставить(ВРег("DendrogramField"), ВидПоляФормы.ПолеДендрограммы);
	Результат.Вставить(ВРег("ChartField"), ВидПоляФормы.ПолеДиаграммы);
	Результат.Вставить(ВРег("GanttChartField"), ВидПоляФормы.ПолеДиаграммыГанта);
	Результат.Вставить(ВРег("ProgressBarField"), ВидПоляФормы.ПолеИндикатора);
	Результат.Вставить(ВРег("CalendarField"), ВидПоляФормы.ПолеКалендаря);
	Результат.Вставить(ВРег("PictureField"), ВидПоляФормы.ПолеКартинки);
	Результат.Вставить(ВРег("LabelField"), ВидПоляФормы.ПолеНадписи);
	Результат.Вставить(ВРег("RadioButtonField"), ВидПоляФормы.ПолеПереключателя);
	Результат.Вставить(ВРег("PeriodField"), ВидПоляФормы.ПолеПериода);
	Результат.Вставить(ВРег("PlannerField"), ВидПоляФормы.ПолеПланировщика);
	Результат.Вставить(ВРег("TrackBarField"), ВидПоляФормы.ПолеПолосыРегулирования);
	Результат.Вставить(ВРег("SpreadsheetDocumentField"), ВидПоляФормы.ПолеТабличногоДокумента);
	Результат.Вставить(ВРег("TextDocumentField"), ВидПоляФормы.ПолеТекстовогоДокумента);
	Результат.Вставить(ВРег("CheckBoxField"), ВидПоляФормы.ПолеФлажка);
	Результат.Вставить(ВРег("FormattedDocumentField"), ВидПоляФормы.ПолеФорматированногоДокумента);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияВидФлажка()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ВидФлажка.Авто);
	Результат.Вставить(ВРег("Выключатель"), ВидФлажка.Выключатель);
	Результат.Вставить(ВРег("Тумблер"), ВидФлажка.Тумблер);
	Результат.Вставить(ВРег("Флажок"), ВидФлажка.Флажок);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ВидФлажка.Авто);
	Результат.Вставить(ВРег("Switch"), ВидФлажка.Выключатель);
	Результат.Вставить(ВРег("Tumbler"), ВидФлажка.Тумблер);
	Результат.Вставить(ВРег("CheckBox"), ВидФлажка.Флажок);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГоризонтальноеПоложениеЭлемента()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ГоризонтальноеПоложениеЭлемента.Авто);
	Результат.Вставить(ВРег("Лево"), ГоризонтальноеПоложениеЭлемента.Лево);
	Результат.Вставить(ВРег("Право"), ГоризонтальноеПоложениеЭлемента.Право);
	Результат.Вставить(ВРег("Центр"), ГоризонтальноеПоложениеЭлемента.Центр);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ГоризонтальноеПоложениеЭлемента.Авто);
	Результат.Вставить(ВРег("Left"), ГоризонтальноеПоложениеЭлемента.Лево);
	Результат.Вставить(ВРег("Right"), ГоризонтальноеПоложениеЭлемента.Право);
	Результат.Вставить(ВРег("Center"), ГоризонтальноеПоложениеЭлемента.Центр);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГруппировкаКолонок()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Вертикальная"), ГруппировкаКолонок.Вертикальная);
	Результат.Вставить(ВРег("ВЯчейке"), ГруппировкаКолонок.ВЯчейке);
	Результат.Вставить(ВРег("Горизонтальная"), ГруппировкаКолонок.Горизонтальная);
	
	// английский
	Результат.Вставить(ВРег("Vertical"), ГруппировкаКолонок.Вертикальная);
	Результат.Вставить(ВРег("InCell"), ГруппировкаКолонок.ВЯчейке);
	Результат.Вставить(ВРег("Horizontal"), ГруппировкаКолонок.Горизонтальная);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГруппировкаПодчиненныхЭлементовФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Вертикальная"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	Результат.Вставить(ВРег("ГоризонтальнаяВсегда"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	Результат.Вставить(ВРег("ГоризонтальнаяЕслиВозможно"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	// английский
	Результат.Вставить(ВРег("Vertical"), ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	Результат.Вставить(ВРег("AlwaysHorizontal"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	Результат.Вставить(ВРег("HorizontalIfPossible"), ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияГруппыИЭлементы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ГруппыИЭлементы.Авто);
	Результат.Вставить(ВРег("Группы"), ГруппыИЭлементы.Группы);
	Результат.Вставить(ВРег("ГруппыИЭлементы"), ГруппыИЭлементы.ГруппыИЭлементы);
	Результат.Вставить(ВРег("Элементы"), ГруппыИЭлементы.Элементы);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ГруппыИЭлементы.Авто);
	Результат.Вставить(ВРег("Folders"), ГруппыИЭлементы.Группы);
	Результат.Вставить(ВРег("FoldersAndItems"), ГруппыИЭлементы.ГруппыИЭлементы);
	Результат.Вставить(ВРег("Items"), ГруппыИЭлементы.Элементы);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИнтервалМеждуЭлементамиФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ИнтервалМеждуЭлементамиФормы.Авто);
	Результат.Вставить(ВРег("Двойной"), ИнтервалМеждуЭлементамиФормы.Двойной);
	Результат.Вставить(ВРег("Нет"), ИнтервалМеждуЭлементамиФормы.Нет);
	Результат.Вставить(ВРег("Одинарный"), ИнтервалМеждуЭлементамиФормы.Одинарный);
	Результат.Вставить(ВРег("Половинный"), ИнтервалМеждуЭлементамиФормы.Половинный);
	Результат.Вставить(ВРег("Полуторный"), ИнтервалМеждуЭлементамиФормы.Полуторный);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ИнтервалМеждуЭлементамиФормы.Авто);
	Результат.Вставить(ВРег("Double"), ИнтервалМеждуЭлементамиФормы.Двойной);
	Результат.Вставить(ВРег("None"), ИнтервалМеждуЭлементамиФормы.Нет);
	Результат.Вставить(ВРег("Single"), ИнтервалМеждуЭлементамиФормы.Одинарный);
	Результат.Вставить(ВРег("Half"), ИнтервалМеждуЭлементамиФормы.Половинный);
	Результат.Вставить(ВРег("OneAndHalf"), ИнтервалМеждуЭлементамиФормы.Полуторный);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеВывода()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ИспользованиеВывода.Авто);
	Результат.Вставить(ВРег("Запретить"), ИспользованиеВывода.Запретить);
	Результат.Вставить(ВРег("Разрешить"), ИспользованиеВывода.Разрешить);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ИспользованиеВывода.Авто);
	Результат.Вставить(ВРег("Disable"), ИспользованиеВывода.Запретить);
	Результат.Вставить(ВРег("Enable"), ИспользованиеВывода.Разрешить);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеПолосыПрокрутки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("ИспользоватьАвтоматически"), ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически);
	Результат.Вставить(ВРег("ИспользоватьВсегда"), ИспользованиеПолосыПрокрутки.ИспользоватьВсегда);
	Результат.Вставить(ВРег("НеИспользовать"), ИспользованиеПолосыПрокрутки.НеИспользовать);
	
	// английский
	Результат.Вставить(ВРег("AutoUse"), ИспользованиеПолосыПрокрутки.ИспользоватьАвтоматически);
	Результат.Вставить(ВРег("UseAlways"), ИспользованиеПолосыПрокрутки.ИспользоватьВсегда);
	Результат.Вставить(ВРег("DontUse"), ИспользованиеПолосыПрокрутки.НеИспользовать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеТекущейСтроки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ИспользованиеТекущейСтроки.Авто);
	Результат.Вставить(ВРег("Использует"), ИспользованиеТекущейСтроки.Использует);
	Результат.Вставить(ВРег("НеИспользует"), ИспользованиеТекущейСтроки.НеИспользует);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ИспользованиеТекущейСтроки.Авто);
	Результат.Вставить(ВРег("Use"), ИспользованиеТекущейСтроки.Использует);
	Результат.Вставить(ВРег("DontUse"), ИспользованиеТекущейСтроки.НеИспользует);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИспользованиеТекущейСтрокиТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ИспользованиеТекущейСтрокиТаблицы.Авто);
	Результат.Вставить(ВРег("Выбор"), ИспользованиеТекущейСтрокиТаблицы.Выбор);
	Результат.Вставить(ВРег("ОтображениеВыделения"), ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделения);
	Результат.Вставить(ВРег("ОтображениеВыделенияИВыбор"), ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделенияИВыбор);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ИспользованиеТекущейСтрокиТаблицы.Авто);
	Результат.Вставить(ВРег("Choice"), ИспользованиеТекущейСтрокиТаблицы.Выбор);
	Результат.Вставить(ВРег("SelectionPresentation"), ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделения);
	Результат.Вставить(ВРег("SelectionPresentationAndChoice"), ИспользованиеТекущейСтрокиТаблицы.ОтображениеВыделенияИВыбор);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияИсторияВыбораПриВводе()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ИсторияВыбораПриВводе.Авто);
	Результат.Вставить(ВРег("НеИспользовать"), ИсторияВыбораПриВводе.НеИспользовать);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ИсторияВыбораПриВводе.Авто);
	Результат.Вставить(ВРег("DontUse"), ИсторияВыбораПриВводе.НеИспользовать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияНачальноеОтображениеДерева()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("НеРаскрывать"), НачальноеОтображениеДерева.НеРаскрывать);
	Результат.Вставить(ВРег("РаскрыватьВерхнийУровень"), НачальноеОтображениеДерева.РаскрыватьВерхнийУровень);
	Результат.Вставить(ВРег("РаскрыватьВсеУровни"), НачальноеОтображениеДерева.РаскрыватьВсеУровни);
	
	// английский
	Результат.Вставить(ВРег("NoExpand"), НачальноеОтображениеДерева.НеРаскрывать);
	Результат.Вставить(ВРег("ExpandTopLevel"), НачальноеОтображениеДерева.РаскрыватьВерхнийУровень);
	Результат.Вставить(ВРег("ExpandAllLevels"), НачальноеОтображениеДерева.РаскрыватьВсеУровни);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияНачальноеОтображениеСписка()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), НачальноеОтображениеСписка.Авто);
	Результат.Вставить(ВРег("Конец"), НачальноеОтображениеСписка.Конец);
	Результат.Вставить(ВРег("Начало"), НачальноеОтображениеСписка.Начало);
	
	// английский
	Результат.Вставить(ВРег("Auto"), НачальноеОтображениеСписка.Авто);
	Результат.Вставить(ВРег("End"), НачальноеОтображениеСписка.Конец);
	Результат.Вставить(ВРег("Beginning"), НачальноеОтображениеСписка.Начало);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОбновлениеТекстаРедактирования()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ОбновлениеТекстаРедактирования.Авто);
	Результат.Вставить(ВРег("Всегда"), ОбновлениеТекстаРедактирования.Всегда);
	Результат.Вставить(ВРег("НеИспользовать"), ОбновлениеТекстаРедактирования.НеИспользовать);
	Результат.Вставить(ВРег("ПриИзмененииЗначения"), ОбновлениеТекстаРедактирования.ПриИзмененииЗначения);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ОбновлениеТекстаРедактирования.Авто);
	Результат.Вставить(ВРег("Always"), ОбновлениеТекстаРедактирования.Всегда);
	Результат.Вставить(ВРег("DontUse"), ОбновлениеТекстаРедактирования.НеИспользовать);
	Результат.Вставить(ВРег("OnValueChange"), ОбновлениеТекстаРедактирования.ПриИзмененииЗначения);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОриентацияЭлементаФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Вертикально"), ОриентацияЭлементаФормы.Вертикально);
	Результат.Вставить(ВРег("Горизонтально"), ОриентацияЭлементаФормы.Горизонтально);
	
	// английский
	Результат.Вставить(ВРег("Vertical"), ОриентацияЭлементаФормы.Вертикально);
	Результат.Вставить(ВРег("Horizontal"), ОриентацияЭлементаФормы.Горизонтально);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеГруппыКнопок()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ОтображениеГруппыКнопок.Авто);
	Результат.Вставить(ВРег("Компактное"), ОтображениеГруппыКнопок.Компактное);
	Результат.Вставить(ВРег("Обычное"), ОтображениеГруппыКнопок.Обычное);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ОтображениеГруппыКнопок.Авто);
	Результат.Вставить(ВРег("Compact"), ОтображениеГруппыКнопок.Компактное);
	Результат.Вставить(ВРег("Usual"), ОтображениеГруппыКнопок.Обычное);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеКнопки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ОтображениеКнопки.Авто);
	Результат.Вставить(ВРег("Картинка"), ОтображениеКнопки.Картинка);
	Результат.Вставить(ВРег("КартинкаИТекст"), ОтображениеКнопки.КартинкаИТекст);
	Результат.Вставить(ВРег("Текст"), ОтображениеКнопки.Текст);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ОтображениеКнопки.Авто);
	Результат.Вставить(ВРег("Picture"), ОтображениеКнопки.Картинка);
	Результат.Вставить(ВРег("PictureAndText"), ОтображениеКнопки.КартинкаИТекст);
	Результат.Вставить(ВРег("Text"), ОтображениеКнопки.Текст);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеКнопкиВыбора()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ОтображениеКнопкиВыбора.Авто);
	Результат.Вставить(ВРег("ОтображатьВВыпадающемСписке"), ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке);
	Результат.Вставить(ВРег("ОтображатьВВыпадающемСпискеИВПолеВвода"), ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода);
	Результат.Вставить(ВРег("ОтображатьВПолеВвода"), ОтображениеКнопкиВыбора.ОтображатьВПолеВвода);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ОтображениеКнопкиВыбора.Авто);
	Результат.Вставить(ВРег("ShowInDropList"), ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСписке);
	Результат.Вставить(ВРег("ShowInDropListAndInInputField"), ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода);
	Результат.Вставить(ВРег("ShowInInputField"), ОтображениеКнопкиВыбора.ОтображатьВПолеВвода);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеОбычнойГруппы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Нет"), ОтображениеОбычнойГруппы.Нет);
	Результат.Вставить(ВРег("ОбычноеВыделение"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	Результат.Вставить(ВРег("СильноеВыделение"), ОтображениеОбычнойГруппы.СильноеВыделение);
	Результат.Вставить(ВРег("СлабоеВыделение"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	// английский
	Результат.Вставить(ВРег("None"), ОтображениеОбычнойГруппы.Нет);
	Результат.Вставить(ВРег("NormalSeparation"), ОтображениеОбычнойГруппы.ОбычноеВыделение);
	Результат.Вставить(ВРег("StrongSeparation"), ОтображениеОбычнойГруппы.СильноеВыделение);
	Результат.Вставить(ВРег("WeakSeparation"), ОтображениеОбычнойГруппы.СлабоеВыделение);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеПодсказки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ОтображениеПодсказки.Авто);
	Результат.Вставить(ВРег("Всплывающая"), ОтображениеПодсказки.Всплывающая);
	Результат.Вставить(ВРег("Кнопка"), ОтображениеПодсказки.Кнопка);
	Результат.Вставить(ВРег("Нет"), ОтображениеПодсказки.Нет);
	Результат.Вставить(ВРег("ОтображатьАвто"), ОтображениеПодсказки.ОтображатьАвто);
	Результат.Вставить(ВРег("ОтображатьСверху"), ОтображениеПодсказки.ОтображатьСверху);
	Результат.Вставить(ВРег("ОтображатьСлева"), ОтображениеПодсказки.ОтображатьСлева);
	Результат.Вставить(ВРег("ОтображатьСнизу"), ОтображениеПодсказки.ОтображатьСнизу);
	Результат.Вставить(ВРег("ОтображатьСправа"), ОтображениеПодсказки.ОтображатьСправа);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ОтображениеПодсказки.Авто);
	Результат.Вставить(ВРег("Balloon"), ОтображениеПодсказки.Всплывающая);
	Результат.Вставить(ВРег("Button"), ОтображениеПодсказки.Кнопка);
	Результат.Вставить(ВРег("None"), ОтображениеПодсказки.Нет);
	Результат.Вставить(ВРег("ShowAuto"), ОтображениеПодсказки.ОтображатьАвто);
	Результат.Вставить(ВРег("ShowTop"), ОтображениеПодсказки.ОтображатьСверху);
	Результат.Вставить(ВРег("ShowLeft"), ОтображениеПодсказки.ОтображатьСлева);
	Результат.Вставить(ВРег("ShowBottom"), ОтображениеПодсказки.ОтображатьСнизу);
	Результат.Вставить(ВРег("ShowRight"), ОтображениеПодсказки.ОтображатьСправа);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеПредупрежденияПриРедактировании()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ОтображениеПредупрежденияПриРедактировании.Авто);
	Результат.Вставить(ВРег("НеОтображать"), ОтображениеПредупрежденияПриРедактировании.НеОтображать);
	Результат.Вставить(ВРег("Отображать"), ОтображениеПредупрежденияПриРедактировании.Отображать);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ОтображениеПредупрежденияПриРедактировании.Авто);
	Результат.Вставить(ВРег("DontShow"), ОтображениеПредупрежденияПриРедактировании.НеОтображать);
	Результат.Вставить(ВРег("Show"), ОтображениеПредупрежденияПриРедактировании.Отображать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеРазметкиПолосыРегулирования()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("НеОтображать"), ОтображениеРазметкиПолосыРегулирования.НеОтображать);
	Результат.Вставить(ВРег("СверхуИлиСлева"), ОтображениеРазметкиПолосыРегулирования.СверхуИлиСлева);
	Результат.Вставить(ВРег("СнизуИлиСправа"), ОтображениеРазметкиПолосыРегулирования.СнизуИлиСправа);
	Результат.Вставить(ВРег("СОбоихСторон"), ОтображениеРазметкиПолосыРегулирования.СОбоихСторон);
	
	// английский
	Результат.Вставить(ВРег("DontShow"), ОтображениеРазметкиПолосыРегулирования.НеОтображать);
	Результат.Вставить(ВРег("TopLeft"), ОтображениеРазметкиПолосыРегулирования.СверхуИлиСлева);
	Результат.Вставить(ВРег("BottomRight"), ОтображениеРазметкиПолосыРегулирования.СнизуИлиСправа);
	Результат.Вставить(ВРег("BothSides"), ОтображениеРазметкиПолосыРегулирования.СОбоихСторон);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Дерево"), ОтображениеТаблицы.Дерево);
	Результат.Вставить(ВРег("ИерархическийСписок"), ОтображениеТаблицы.ИерархическийСписок);
	Результат.Вставить(ВРег("Список"), ОтображениеТаблицы.Список);
	
	// английский
	Результат.Вставить(ВРег("Tree"), ОтображениеТаблицы.Дерево);
	Результат.Вставить(ВРег("HierarchicalList"), ОтображениеТаблицы.ИерархическийСписок);
	Результат.Вставить(ВРег("List"), ОтображениеТаблицы.Список);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияОтображениеФигурыКнопки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ОтображениеФигурыКнопки.Авто);
	Результат.Вставить(ВРег("Всегда"), ОтображениеФигурыКнопки.Всегда);
	Результат.Вставить(ВРег("Нет"), ОтображениеФигурыКнопки.Нет);
	Результат.Вставить(ВРег("ПриАктивности"), ОтображениеФигурыКнопки.ПриАктивности);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ОтображениеФигурыКнопки.Авто);
	Результат.Вставить(ВРег("Always"), ОтображениеФигурыКнопки.Всегда);
	Результат.Вставить(ВРег("None"), ОтображениеФигурыКнопки.Нет);
	Результат.Вставить(ВРег("WhenActive"), ОтображениеФигурыКнопки.ПриАктивности);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоведениеОбычнойГруппы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоведениеОбычнойГруппы.Авто);
	Результат.Вставить(ВРег("Всплывающая"), ПоведениеОбычнойГруппы.Всплывающая);
	Результат.Вставить(ВРег("Обычное"), ПоведениеОбычнойГруппы.Обычное);
	Результат.Вставить(ВРег("Свертываемая"), ПоведениеОбычнойГруппы.Свертываемая);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоведениеОбычнойГруппы.Авто);
	Результат.Вставить(ВРег("PopUp"), ПоведениеОбычнойГруппы.Всплывающая);
	Результат.Вставить(ВРег("Usual"), ПоведениеОбычнойГруппы.Обычное);
	Результат.Вставить(ВРег("Collapsible"), ПоведениеОбычнойГруппы.Свертываемая);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПодсказкаАвтоЗаполненияПоляВвода()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("АдресЭлектроннойПочты"), ПодсказкаАвтоЗаполненияПоляВвода.АдресЭлектроннойПочты);
	Результат.Вставить(ВРег("Город"), ПодсказкаАвтоЗаполненияПоляВвода.Город);
	Результат.Вставить(ВРег("Имя"), ПодсказкаАвтоЗаполненияПоляВвода.Имя);
	Результат.Вставить(ВРег("ИмяПользователя"), ПодсказкаАвтоЗаполненияПоляВвода.ИмяПользователя);
	Результат.Вставить(ВРег("Индекс"), ПодсказкаАвтоЗаполненияПоляВвода.Индекс);
	Результат.Вставить(ВРег("НеИспользовать"), ПодсказкаАвтоЗаполненияПоляВвода.НеИспользовать);
	Результат.Вставить(ВРег("НовыйПароль"), ПодсказкаАвтоЗаполненияПоляВвода.НовыйПароль);
	Результат.Вставить(ВРег("НомерБанковскойКарты"), ПодсказкаАвтоЗаполненияПоляВвода.НомерБанковскойКарты);
	Результат.Вставить(ВРег("НомерТелефона"), ПодсказкаАвтоЗаполненияПоляВвода.НомерТелефона);
	Результат.Вставить(ВРег("ОдноразовыйКод"), ПодсказкаАвтоЗаполненияПоляВвода.ОдноразовыйКод);
	Результат.Вставить(ВРег("Отчество"), ПодсказкаАвтоЗаполненияПоляВвода.Отчество);
	Результат.Вставить(ВРег("Пароль"), ПодсказкаАвтоЗаполненияПоляВвода.Пароль);
	Результат.Вставить(ВРег("ПолноеИмя"), ПодсказкаАвтоЗаполненияПоляВвода.ПолноеИмя);
	Результат.Вставить(ВРег("ПрефиксИмени"), ПодсказкаАвтоЗаполненияПоляВвода.ПрефиксИмени);
	Результат.Вставить(ВРег("Регион"), ПодсказкаАвтоЗаполненияПоляВвода.Регион);
	Результат.Вставить(ВРег("Страна"), ПодсказкаАвтоЗаполненияПоляВвода.Страна);
	Результат.Вставить(ВРег("СуффиксИмени"), ПодсказкаАвтоЗаполненияПоляВвода.СуффиксИмени);
	Результат.Вставить(ВРег("Улица"), ПодсказкаАвтоЗаполненияПоляВвода.Улица);
	Результат.Вставить(ВРег("Фамилия"), ПодсказкаАвтоЗаполненияПоляВвода.Фамилия);
	
	// английский
	Результат.Вставить(ВРег("Email"), ПодсказкаАвтоЗаполненияПоляВвода.АдресЭлектроннойПочты);
	Результат.Вставить(ВРег("City"), ПодсказкаАвтоЗаполненияПоляВвода.Город);
	Результат.Вставить(ВРег("GivenName"), ПодсказкаАвтоЗаполненияПоляВвода.Имя);
	Результат.Вставить(ВРег("UserName"), ПодсказкаАвтоЗаполненияПоляВвода.ИмяПользователя);
	Результат.Вставить(ВРег("PostalCode"), ПодсказкаАвтоЗаполненияПоляВвода.Индекс);
	Результат.Вставить(ВРег("DontUse"), ПодсказкаАвтоЗаполненияПоляВвода.НеИспользовать);
	Результат.Вставить(ВРег("NewPassword"), ПодсказкаАвтоЗаполненияПоляВвода.НовыйПароль);
	Результат.Вставить(ВРег("CreditCardNumber"), ПодсказкаАвтоЗаполненияПоляВвода.НомерБанковскойКарты);
	Результат.Вставить(ВРег("PhoneNumber"), ПодсказкаАвтоЗаполненияПоляВвода.НомерТелефона);
	Результат.Вставить(ВРег("OneTimeCode"), ПодсказкаАвтоЗаполненияПоляВвода.ОдноразовыйКод);
	Результат.Вставить(ВРег("MiddleName"), ПодсказкаАвтоЗаполненияПоляВвода.Отчество);
	Результат.Вставить(ВРег("Password"), ПодсказкаАвтоЗаполненияПоляВвода.Пароль);
	Результат.Вставить(ВРег("FullName"), ПодсказкаАвтоЗаполненияПоляВвода.ПолноеИмя);
	Результат.Вставить(ВРег("NamePrefix"), ПодсказкаАвтоЗаполненияПоляВвода.ПрефиксИмени);
	Результат.Вставить(ВРег("Region"), ПодсказкаАвтоЗаполненияПоляВвода.Регион);
	Результат.Вставить(ВРег("Country"), ПодсказкаАвтоЗаполненияПоляВвода.Страна);
	Результат.Вставить(ВРег("NameSuffix"), ПодсказкаАвтоЗаполненияПоляВвода.СуффиксИмени);
	Результат.Вставить(ВРег("Street"), ПодсказкаАвтоЗаполненияПоляВвода.Улица);
	Результат.Вставить(ВРег("FamilyName"), ПодсказкаАвтоЗаполненияПоляВвода.Фамилия);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоискВТаблицеПриВводе()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоискВТаблицеПриВводе.Авто);
	Результат.Вставить(ВРег("Использовать"), ПоискВТаблицеПриВводе.Использовать);
	Результат.Вставить(ВРег("НеИспользовать"), ПоискВТаблицеПриВводе.НеИспользовать);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоискВТаблицеПриВводе.Авто);
	Результат.Вставить(ВРег("Use"), ПоискВТаблицеПриВводе.Использовать);
	Результат.Вставить(ВРег("DontUse"), ПоискВТаблицеПриВводе.НеИспользовать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПроверкаПравописанияПриВводеТекста()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПроверкаПравописанияПриВводеТекста.Авто);
	Результат.Вставить(ВРег("Использовать"), ПроверкаПравописанияПриВводеТекста.Использовать);
	Результат.Вставить(ВРег("НеИспользовать"), ПроверкаПравописанияПриВводеТекста.НеИспользовать);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПроверкаПравописанияПриВводеТекста.Авто);
	Результат.Вставить(ВРег("Use"), ПроверкаПравописанияПриВводеТекста.Использовать);
	Результат.Вставить(ВРег("DontUse"), ПроверкаПравописанияПриВводеТекста.НеИспользовать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоведениеПриНедоступностиОсновногоСервера()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоведениеПриНедоступностиОсновногоСервера.Авто);
	Результат.Вставить(ВРег("НеИзменятьПоведение"), ПоведениеПриНедоступностиОсновногоСервера.НеИзменятьПоведение);
	Результат.Вставить(ВРег("ОтключитьДоступность"), ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоведениеПриНедоступностиОсновногоСервера.Авто);
	Результат.Вставить(ВРег("DontChangeBehavior"), ПоведениеПриНедоступностиОсновногоСервера.НеИзменятьПоведение);
	Результат.Вставить(ВРег("MakeDisable"), ПоведениеПриНедоступностиОсновногоСервера.ОтключитьДоступность);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоведениеТаблицыПриСжатииПоГоризонтали()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоведениеТаблицыПриСжатииПоГоризонтали.Авто);
	Результат.Вставить(ВРег("ПереноситьЭлементыПоВажности"), ПоведениеТаблицыПриСжатииПоГоризонтали.ПереноситьЭлементыПоВажности);
	Результат.Вставить(ВРег("СкрыватьЭлементыПоВажности"), ПоведениеТаблицыПриСжатииПоГоризонтали.СкрыватьЭлементыПоВажности);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоведениеТаблицыПриСжатииПоГоризонтали.Авто);
	Результат.Вставить(ВРег("MoveItemsByImportance"), ПоведениеТаблицыПриСжатииПоГоризонтали.ПереноситьЭлементыПоВажности);
	Результат.Вставить(ВРег("HideItemsByImportance"), ПоведениеТаблицыПриСжатииПоГоризонтали.СкрыватьЭлементыПоВажности);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеЗаголовкаЭлементаФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеЗаголовкаЭлементаФормы.Авто);
	Результат.Вставить(ВРег("Верх"), ПоложениеЗаголовкаЭлементаФормы.Верх);
	Результат.Вставить(ВРег("Лево"), ПоложениеЗаголовкаЭлементаФормы.Лево);
	Результат.Вставить(ВРег("Нет"), ПоложениеЗаголовкаЭлементаФормы.Нет);
	Результат.Вставить(ВРег("Низ"), ПоложениеЗаголовкаЭлементаФормы.Низ);
	Результат.Вставить(ВРег("Право"), ПоложениеЗаголовкаЭлементаФормы.Право);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеЗаголовкаЭлементаФормы.Авто);
	Результат.Вставить(ВРег("Top"), ПоложениеЗаголовкаЭлементаФормы.Верх);
	Результат.Вставить(ВРег("Left"), ПоложениеЗаголовкаЭлементаФормы.Лево);
	Результат.Вставить(ВРег("None"), ПоложениеЗаголовкаЭлементаФормы.Нет);
	Результат.Вставить(ВРег("Bottom"), ПоложениеЗаголовкаЭлементаФормы.Низ);
	Результат.Вставить(ВРег("Right"), ПоложениеЗаголовкаЭлементаФормы.Право);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеКартинкиКнопкиФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеКартинкиКнопкиФормы.Авто);
	Результат.Вставить(ВРег("Лево"), ПоложениеКартинкиКнопкиФормы.Лево);
	Результат.Вставить(ВРег("Право"), ПоложениеКартинкиКнопкиФормы.Право);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеКартинкиКнопкиФормы.Авто);
	Результат.Вставить(ВРег("Left"), ПоложениеКартинкиКнопкиФормы.Лево);
	Результат.Вставить(ВРег("Right"), ПоложениеКартинкиКнопкиФормы.Право);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеКнопкиВКоманднойПанели()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеКнопкиВКоманднойПанели.Авто);
	Результат.Вставить(ВРег("ВДополнительномПодменю"), ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю);
	Результат.Вставить(ВРег("ВКоманднойПанели"), ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели);
	Результат.Вставить(ВРег("ВКоманднойПанелиИВДополнительномПодменю"), ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеКнопкиВКоманднойПанели.Авто);
	Результат.Вставить(ВРег("InAdditionalSubmenu"), ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю);
	Результат.Вставить(ВРег("InCommandBar"), ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели);
	Результат.Вставить(ВРег("InCommandBarAndInAdditionalSubmenu"), ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанелиИВДополнительномПодменю);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеКоманднойПанелиЭлементаФормы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеКоманднойПанелиЭлементаФормы.Авто);
	Результат.Вставить(ВРег("Верх"), ПоложениеКоманднойПанелиЭлементаФормы.Верх);
	Результат.Вставить(ВРег("Нет"), ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	Результат.Вставить(ВРег("Низ"), ПоложениеКоманднойПанелиЭлементаФормы.Низ);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеКоманднойПанелиЭлементаФормы.Авто);
	Результат.Вставить(ВРег("Top"), ПоложениеКоманднойПанелиЭлементаФормы.Верх);
	Результат.Вставить(ВРег("None"), ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	Результат.Вставить(ВРег("Bottom"), ПоложениеКоманднойПанелиЭлементаФормы.Низ);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеСостоянияПросмотра()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеСостоянияПросмотра.Авто);
	Результат.Вставить(ВРег("Верх"), ПоложениеСостоянияПросмотра.Верх);
	Результат.Вставить(ВРег("Нет"), ПоложениеСостоянияПросмотра.Нет);
	Результат.Вставить(ВРег("Низ"), ПоложениеСостоянияПросмотра.Низ);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеСостоянияПросмотра.Авто);
	Результат.Вставить(ВРег("Top"), ПоложениеСостоянияПросмотра.Верх);
	Результат.Вставить(ВРег("None"), ПоложениеСостоянияПросмотра.Нет);
	Результат.Вставить(ВРег("Bottom"), ПоложениеСостоянияПросмотра.Низ);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеСтрокиПоиска()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеСтрокиПоиска.Авто);
	Результат.Вставить(ВРег("Верх"), ПоложениеСтрокиПоиска.Верх);
	Результат.Вставить(ВРег("ЗаголовокФормы"), ПоложениеСтрокиПоиска.ЗаголовокФормы);
	Результат.Вставить(ВРег("КоманднаяПанель"), ПоложениеСтрокиПоиска.КоманднаяПанель);
	Результат.Вставить(ВРег("Нет"), ПоложениеСтрокиПоиска.Нет);
	Результат.Вставить(ВРег("Низ"), ПоложениеСтрокиПоиска.Низ);
	Результат.Вставить(ВРег("ПотянутьСверху"), ПоложениеСтрокиПоиска.ПотянутьСверху);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеСтрокиПоиска.Авто);
	Результат.Вставить(ВРег("Top"), ПоложениеСтрокиПоиска.Верх);
	Результат.Вставить(ВРег("FormCaption"), ПоложениеСтрокиПоиска.ЗаголовокФормы);
	Результат.Вставить(ВРег("CommandBar"), ПоложениеСтрокиПоиска.КоманднаяПанель);
	Результат.Вставить(ВРег("None"), ПоложениеСтрокиПоиска.Нет);
	Результат.Вставить(ВРег("Bottom"), ПоложениеСтрокиПоиска.Низ);
	Результат.Вставить(ВРег("PullFromTop"), ПоложениеСтрокиПоиска.ПотянутьСверху);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеТаблицыДиаграммыГанта()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеТаблицыДиаграммыГанта.Авто);
	Результат.Вставить(ВРег("Лево"), ПоложениеТаблицыДиаграммыГанта.Лево);
	Результат.Вставить(ВРег("Нет"), ПоложениеТаблицыДиаграммыГанта.Нет);
	Результат.Вставить(ВРег("Право"), ПоложениеТаблицыДиаграммыГанта.Право);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеТаблицыДиаграммыГанта.Авто);
	Результат.Вставить(ВРег("Left"), ПоложениеТаблицыДиаграммыГанта.Лево);
	Результат.Вставить(ВРег("None"), ПоложениеТаблицыДиаграммыГанта.Нет);
	Результат.Вставить(ВРег("Right"), ПоложениеТаблицыДиаграммыГанта.Право);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияПоложениеУправленияПоиском()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ПоложениеУправленияПоиском.Авто);
	Результат.Вставить(ВРег("КоманднаяПанель"), ПоложениеУправленияПоиском.КоманднаяПанель);
	Результат.Вставить(ВРег("Нет"), ПоложениеУправленияПоиском.Нет);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ПоложениеУправленияПоиском.Авто);
	Результат.Вставить(ВРег("CommandBar"), ПоложениеУправленияПоиском.КоманднаяПанель);
	Результат.Вставить(ВРег("None"), ПоложениеУправленияПоиском.Нет);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРазмерКартинки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("АвтоРазмер"), РазмерКартинки.АвтоРазмер);
	Результат.Вставить(ВРег("АвтоРазмерБезУчетаМасштаба"), РазмерКартинки.АвтоРазмерБезУчетаМасштаба);
	Результат.Вставить(ВРег("ПоРазмеруШрифта"), РазмерКартинки.ПоРазмеруШрифта);
	Результат.Вставить(ВРег("Пропорционально"), РазмерКартинки.Пропорционально);
	Результат.Вставить(ВРег("Растянуть"), РазмерКартинки.Растянуть);
	Результат.Вставить(ВРег("РеальныйРазмер"), РазмерКартинки.РеальныйРазмер);
	Результат.Вставить(ВРег("РеальныйРазмерБезУчетаМасштаба"), РазмерКартинки.РеальныйРазмерБезУчетаМасштаба);
	Результат.Вставить(ВРег("Черепица"), РазмерКартинки.Черепица);
	
	// английский
	Результат.Вставить(ВРег("AutoSize"), РазмерКартинки.АвтоРазмер);
	Результат.Вставить(ВРег("AutoSizeIgnoreScale"), РазмерКартинки.АвтоРазмерБезУчетаМасштаба);
	Результат.Вставить(ВРег("ByFontSize"), РазмерКартинки.ПоРазмеруШрифта);
	Результат.Вставить(ВРег("Proportionally"), РазмерКартинки.Пропорционально);
	Результат.Вставить(ВРег("Stretch"), РазмерКартинки.Растянуть);
	Результат.Вставить(ВРег("RealSize"), РазмерКартинки.РеальныйРазмер);
	Результат.Вставить(ВРег("RealSizeIgnoreScale"), РазмерКартинки.РеальныйРазмерБезУчетаМасштаба);
	Результат.Вставить(ВРег("Tile"), РазмерКартинки.Черепица);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимОтображенияВыделения()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Всегда"), РежимОтображенияВыделения.Всегда);
	Результат.Вставить(ВРег("НеОтображать"), РежимОтображенияВыделения.НеОтображать);
	Результат.Вставить(ВРег("ПриАктивности"), РежимОтображенияВыделения.ПриАктивности);
	Результат.Вставить(ВРег("ПриВыделенииНесколькихЯчеек"), РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеек);
	Результат.Вставить(ВРег("ПриВыделенииНесколькихЯчеекПриАктивности"), РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеекПриАктивности);
	
	// английский
	Результат.Вставить(ВРег("Always"), РежимОтображенияВыделения.Всегда);
	Результат.Вставить(ВРег("DontShow"), РежимОтображенияВыделения.НеОтображать);
	Результат.Вставить(ВРег("WhenActive"), РежимОтображенияВыделения.ПриАктивности);
	Результат.Вставить(ВРег("WhenMultipleCellsSelected"), РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеек);
	Результат.Вставить(ВРег("WhenMultipleCellsSelectedWhenActive"), РежимОтображенияВыделения.ПриВыделенииНесколькихЯчеекПриАктивности);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимОтображенияВыделенияРисунков()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), РежимОтображенияВыделенияРисунков.Авто);
	Результат.Вставить(ВРег("НеОтображать"), РежимОтображенияВыделенияРисунков.НеОтображать);
	Результат.Вставить(ВРег("Отображать"), РежимОтображенияВыделенияРисунков.Отображать);
	
	// английский
	Результат.Вставить(ВРег("Auto"), РежимОтображенияВыделенияРисунков.Авто);
	Результат.Вставить(ВРег("DontShow"), РежимОтображенияВыделенияРисунков.НеОтображать);
	Результат.Вставить(ВРег("Show"), РежимОтображенияВыделенияРисунков.Отображать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимАвтоОтображенияКнопкиОткрытия()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), РежимАвтоОтображенияКнопкиОткрытия.Авто);
	Результат.Вставить(ВРег("Всегда"), РежимАвтоОтображенияКнопкиОткрытия.Всегда);
	Результат.Вставить(ВРег("ТолькоДляЗаполненного"), РежимАвтоОтображенияКнопкиОткрытия.ТолькоДляЗаполненного);
	
	// английский
	Результат.Вставить(ВРег("Auto"), РежимАвтоОтображенияКнопкиОткрытия.Авто);
	Результат.Вставить(ВРег("Always"), РежимАвтоОтображенияКнопкиОткрытия.Всегда);
	Результат.Вставить(ВРег("FilledOnly"), РежимАвтоОтображенияКнопкиОткрытия.ТолькоДляЗаполненного);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимАвтоОтображенияКнопкиОчистки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("АвтоРазмер"), РежимАвтоОтображенияКнопкиОчистки.Авто);
	Результат.Вставить(ВРег("Всегда"), РежимАвтоОтображенияКнопкиОчистки.Всегда);
	Результат.Вставить(ВРег("ТолькоДляЗаполненного"), РежимАвтоОтображенияКнопкиОчистки.ТолькоДляЗаполненного);
	
	// английский
	Результат.Вставить(ВРег("Auto"), РежимАвтоОтображенияКнопкиОчистки.Авто);
	Результат.Вставить(ВРег("Always"), РежимАвтоОтображенияКнопкиОчистки.Всегда);
	Результат.Вставить(ВРег("FilledOnly"), РежимАвтоОтображенияКнопкиОчистки.ТолькоДляЗаполненного);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВводаСтрокТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("ВКонецОкна"), РежимВводаСтрокТаблицы.ВКонецОкна);
	Результат.Вставить(ВРег("ВКонецСписка"), РежимВводаСтрокТаблицы.ВКонецСписка);
	Результат.Вставить(ВРег("ПередТекущейСтрокой"), РежимВводаСтрокТаблицы.ПередТекущейСтрокой);
	Результат.Вставить(ВРег("ПослеТекущейСтроки"), РежимВводаСтрокТаблицы.ПослеТекущейСтроки);
	
	// английский
	Результат.Вставить(ВРег("EndOfWindow"), РежимВводаСтрокТаблицы.ВКонецОкна);
	Результат.Вставить(ВРег("EndOfList"), РежимВводаСтрокТаблицы.ВКонецСписка);
	Результат.Вставить(ВРег("BeforeCurrentRow"), РежимВводаСтрокТаблицы.ПередТекущейСтрокой);
	Результат.Вставить(ВРег("AfterCurrentRow"), РежимВводаСтрокТаблицы.ПослеТекущейСтроки);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыбораНезаполненного()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("ПриАктивизации"), РежимВыбораНезаполненного.ПриАктивизации);
	Результат.Вставить(ВРег("ПриНажатииEnter"), РежимВыбораНезаполненного.ПриНажатииEnter);
	
	// английский
	Результат.Вставить(ВРег("OnActivate"), РежимВыбораНезаполненного.ПриАктивизации);
	Результат.Вставить(ВРег("OnEnterPressed"), РежимВыбораНезаполненного.ПриНажатииEnter);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияДаты()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Интервал"), РежимВыделенияДаты.Интервал);
	Результат.Вставить(ВРег("Множественный"), РежимВыделенияДаты.Множественный);
	Результат.Вставить(ВРег("Одиночный"), РежимВыделенияДаты.Одиночный);
	
	// английский
	Результат.Вставить(ВРег("Interval"), РежимВыделенияДаты.Интервал);
	Результат.Вставить(ВРег("Multiple"), РежимВыделенияДаты.Множественный);
	Результат.Вставить(ВРег("Single"), РежимВыделенияДаты.Одиночный);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияЗначенийДиаграммыГанта()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), РежимВыделенияЗначенийДиаграммыГанта.Авто);
	Результат.Вставить(ВРег("Множественный"), РежимВыделенияЗначенийДиаграммыГанта.Множественный);
	Результат.Вставить(ВРег("Нет"), РежимВыделенияЗначенийДиаграммыГанта.Нет);
	Результат.Вставить(ВРег("Одиночный"), РежимВыделенияЗначенийДиаграммыГанта.Одиночный);
	
	// английский
	Результат.Вставить(ВРег("Auto"), РежимВыделенияЗначенийДиаграммыГанта.Авто);
	Результат.Вставить(ВРег("Multiple"), РежимВыделенияЗначенийДиаграммыГанта.Множественный);
	Результат.Вставить(ВРег("None"), РежимВыделенияЗначенийДиаграммыГанта.Нет);
	Результат.Вставить(ВРег("Single"), РежимВыделенияЗначенийДиаграммыГанта.Одиночный);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияИнтерваловДиаграммыГанта()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), РежимВыделенияИнтерваловДиаграммыГанта.Авто);
	Результат.Вставить(ВРег("Множественный"), РежимВыделенияИнтерваловДиаграммыГанта.Множественный);
	Результат.Вставить(ВРег("Нет"), РежимВыделенияИнтерваловДиаграммыГанта.Нет);
	Результат.Вставить(ВРег("Одиночный"), РежимВыделенияИнтерваловДиаграммыГанта.Одиночный);
	
	// английский
	Результат.Вставить(ВРег("Auto"), РежимВыделенияИнтерваловДиаграммыГанта.Авто);
	Результат.Вставить(ВРег("Multiple"), РежимВыделенияИнтерваловДиаграммыГанта.Множественный);
	Результат.Вставить(ВРег("None"), РежимВыделенияИнтерваловДиаграммыГанта.Нет);
	Результат.Вставить(ВРег("Single"), РежимВыделенияИнтерваловДиаграммыГанта.Одиночный);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияСтрокиТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Строка"), РежимВыделенияСтрокиТаблицы.Строка);
	Результат.Вставить(ВРег("Ячейка"), РежимВыделенияСтрокиТаблицы.Ячейка);
	
	// английский
	Результат.Вставить(ВРег("Row"), РежимВыделенияСтрокиТаблицы.Строка);
	Результат.Вставить(ВРег("Cell"), РежимВыделенияСтрокиТаблицы.Ячейка);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимВыделенияТаблицы()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Множественный"), РежимВыделенияТаблицы.Множественный);
	Результат.Вставить(ВРег("Одиночный"), РежимВыделенияТаблицы.Одиночный);
	
	// английский
	Результат.Вставить(ВРег("MultiRow"), РежимВыделенияТаблицы.Множественный);
	Результат.Вставить(ВРег("SingleRow"), РежимВыделенияТаблицы.Одиночный);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимМасштабированияПросмотра()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), РежимМасштабированияПросмотра.Авто);
	Результат.Вставить(ВРег("Крупный"), РежимМасштабированияПросмотра.Крупный);
	Результат.Вставить(ВРег("Обычный"), РежимМасштабированияПросмотра.Обычный);
	
	// английский
	Результат.Вставить(ВРег("Auto"), РежимМасштабированияПросмотра.Авто);
	Результат.Вставить(ВРег("Large"), РежимМасштабированияПросмотра.Крупный);
	Результат.Вставить(ВРег("Normal"), РежимМасштабированияПросмотра.Обычный);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияРежимСглаживанияИндикатора()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Плавный"), РежимСглаживанияИндикатора.Плавный);
	Результат.Вставить(ВРег("Прерывистый"), РежимСглаживанияИндикатора.Прерывистый);
	Результат.Вставить(ВРег("ПрерывистыйНаклонный"), РежимСглаживанияИндикатора.ПрерывистыйНаклонный);
	
	// английский
	Результат.Вставить(ВРег("Smooth"), РежимСглаживанияИндикатора.Плавный);
	Результат.Вставить(ВРег("Broken"), РежимСглаживанияИндикатора.Прерывистый);
	Результат.Вставить(ВРег("BrokenTilt"), РежимСглаживанияИндикатора.ПрерывистыйНаклонный);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСквозноеВыравнивание()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), СквозноеВыравнивание.Авто);
	Результат.Вставить(ВРег("Использовать"), СквозноеВыравнивание.Использовать);
	Результат.Вставить(ВРег("НеИспользовать"), СквозноеВыравнивание.НеИспользовать);
	
	// английский
	Результат.Вставить(ВРег("Auto"), СквозноеВыравнивание.Авто);
	Результат.Вставить(ВРег("Use"), СквозноеВыравнивание.Использовать);
	Результат.Вставить(ВРег("DontUse"), СквозноеВыравнивание.НеИспользовать);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСпециальныйРежимВводаТекста()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Email"), СпециальныйРежимВводаТекста.Email);
	Результат.Вставить(ВРег("URL"), СпециальныйРежимВводаТекста.URL);
	Результат.Вставить(ВРег("Авто"), СпециальныйРежимВводаТекста.Авто);
	Результат.Вставить(ВРег("Нет"), СпециальныйРежимВводаТекста.Нет);
	Результат.Вставить(ВРег("НомерТелефона"), СпециальныйРежимВводаТекста.НомерТелефона);
	Результат.Вставить(ВРег("Цифры"), СпециальныйРежимВводаТекста.Цифры);
	Результат.Вставить(ВРег("ЦифрыИПунктуация"), СпециальныйРежимВводаТекста.ЦифрыИПунктуация);
	
	// английский
	Результат.Вставить(ВРег("Auto"), СпециальныйРежимВводаТекста.Авто);
	Результат.Вставить(ВРег("None"), СпециальныйРежимВводаТекста.Нет);
	Результат.Вставить(ВРег("PhoneNumber"), СпециальныйРежимВводаТекста.НомерТелефона);
	Результат.Вставить(ВРег("Digits"), СпециальныйРежимВводаТекста.Цифры);
	Результат.Вставить(ВРег("DigitsAndPunctuation"), СпециальныйРежимВводаТекста.ЦифрыИПунктуация);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСпособЗапросаОбновления()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Нет"), СпособЗапросаОбновления.Нет);
	Результат.Вставить(ВРег("ПотянутьСверху"), СпособЗапросаОбновления.ПотянутьСверху);
	Результат.Вставить(ВРег("ПотянутьСверхуИлиСнизу"), СпособЗапросаОбновления.ПотянутьСверхуИлиСнизу);
	Результат.Вставить(ВРег("ПотянутьСнизу"), СпособЗапросаОбновления.ПотянутьСнизу);
	
	// английский
	Результат.Вставить(ВРег("None"), СпособЗапросаОбновления.Нет);
	Результат.Вставить(ВРег("PullFromTop"), СпособЗапросаОбновления.ПотянутьСверху);
	Результат.Вставить(ВРег("PullFromTopOrBottom"), СпособЗапросаОбновления.ПотянутьСверхуИлиСнизу);
	Результат.Вставить(ВРег("PullFromBottom"), СпособЗапросаОбновления.ПотянутьСнизу);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияСпособПеретаскиванияФайлов()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("КакСсылкаНаФайл"), СпособПеретаскиванияФайлов.КакСсылкаНаФайл);
	Результат.Вставить(ВРег("КакФайл"), СпособПеретаскиванияФайлов.КакФайл);
	
	// английский
	Результат.Вставить(ВРег("AsFileRef"), СпособПеретаскиванияФайлов.КакСсылкаНаФайл);
	Результат.Вставить(ВРег("AsFile"), СпособПеретаскиванияФайлов.КакФайл);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияТекстКнопкиВводаЭкраннойКлавиатуры()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ТекстКнопкиВводаЭкраннойКлавиатуры.Авто);
	Результат.Вставить(ВРег("Ввод"), ТекстКнопкиВводаЭкраннойКлавиатуры.Ввод);
	Результат.Вставить(ВРег("Готово"), ТекстКнопкиВводаЭкраннойКлавиатуры.Готово);
	Результат.Вставить(ВРег("Далее"), ТекстКнопкиВводаЭкраннойКлавиатуры.Далее);
	Результат.Вставить(ВРег("Найти"), ТекстКнопкиВводаЭкраннойКлавиатуры.Найти);
	Результат.Вставить(ВРег("Отправить"), ТекстКнопкиВводаЭкраннойКлавиатуры.Отправить);
	Результат.Вставить(ВРег("Перейти"), ТекстКнопкиВводаЭкраннойКлавиатуры.Перейти);
	Результат.Вставить(ВРег("Подключиться"), ТекстКнопкиВводаЭкраннойКлавиатуры.Подключиться);
	Результат.Вставить(ВРег("Продолжить"), ТекстКнопкиВводаЭкраннойКлавиатуры.Продолжить);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ТекстКнопкиВводаЭкраннойКлавиатуры.Авто);
	Результат.Вставить(ВРег("Return"), ТекстКнопкиВводаЭкраннойКлавиатуры.Ввод);
	Результат.Вставить(ВРег("Done"), ТекстКнопкиВводаЭкраннойКлавиатуры.Готово);
	Результат.Вставить(ВРег("Next"), ТекстКнопкиВводаЭкраннойКлавиатуры.Далее);
	Результат.Вставить(ВРег("Search"), ТекстКнопкиВводаЭкраннойКлавиатуры.Найти);
	Результат.Вставить(ВРег("Send"), ТекстКнопкиВводаЭкраннойКлавиатуры.Отправить);
	Результат.Вставить(ВРег("Go"), ТекстКнопкиВводаЭкраннойКлавиатуры.Перейти);
	Результат.Вставить(ВРег("Join"), ТекстКнопкиВводаЭкраннойКлавиатуры.Подключиться);
	Результат.Вставить(ВРег("Continue"), ТекстКнопкиВводаЭкраннойКлавиатуры.Продолжить);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияТипКурсоровТабличногоДокумента()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Обычные"), ТипКурсоровТабличногоДокумента.Обычные);
	Результат.Вставить(ВРег("Специальные"), ТипКурсоровТабличногоДокумента.Специальные);
	
	// английский
	Результат.Вставить(ВРег("Regular"), ТипКурсоровТабличногоДокумента.Обычные);
	Результат.Вставить(ВРег("Special"), ТипКурсоровТабличногоДокумента.Специальные);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияТипРамкиЭлементаУправления()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("БезРамки"), ТипРамкиЭлементаУправления.БезРамки);
	Результат.Вставить(ВРег("Вдавленная"), ТипРамкиЭлементаУправления.Вдавленная);
	Результат.Вставить(ВРег("Выпуклая"), ТипРамкиЭлементаУправления.Выпуклая);
	Результат.Вставить(ВРег("Двойная"), ТипРамкиЭлементаУправления.Двойная);
	Результат.Вставить(ВРег("ДвойноеПодчеркивание"), ТипРамкиЭлементаУправления.ДвойноеПодчеркивание);
	Результат.Вставить(ВРег("Одинарная"), ТипРамкиЭлементаУправления.Одинарная);
	Результат.Вставить(ВРег("Подчеркивание"), ТипРамкиЭлементаУправления.Подчеркивание);
	Результат.Вставить(ВРег("Скругленная"), ТипРамкиЭлементаУправления.Скругленная);
	Результат.Вставить(ВРег("ЧертаСверху"), ТипРамкиЭлементаУправления.ЧертаСверху);
	
	// английский
	Результат.Вставить(ВРег("WithoutBorder"), ТипРамкиЭлементаУправления.БезРамки);
	Результат.Вставить(ВРег("Indented"), ТипРамкиЭлементаУправления.Вдавленная);
	Результат.Вставить(ВРег("Embossed"), ТипРамкиЭлементаУправления.Выпуклая);
	Результат.Вставить(ВРег("Double"), ТипРамкиЭлементаУправления.Двойная);
	Результат.Вставить(ВРег("DoubleUnderline"), ТипРамкиЭлементаУправления.ДвойноеПодчеркивание);
	Результат.Вставить(ВРег("Single"), ТипРамкиЭлементаУправления.Одинарная);
	Результат.Вставить(ВРег("Underline"), ТипРамкиЭлементаУправления.Подчеркивание);
	Результат.Вставить(ВРег("Rounded"), ТипРамкиЭлементаУправления.Скругленная);
	Результат.Вставить(ВРег("Overline"), ТипРамкиЭлементаУправления.ЧертаСверху);
	
	Возврат Результат;
КонецФункции

Функция ЗначенияФигураКнопки()
	Результат = Новый Соответствие;
	
	// русский
	Результат.Вставить(ВРег("Авто"), ФигураКнопки.Авто);
	Результат.Вставить(ВРег("Обычная"), ФигураКнопки.Обычная);
	Результат.Вставить(ВРег("Овал"), ФигураКнопки.Овал);
	
	// английский
	Результат.Вставить(ВРег("Auto"), ФигураКнопки.Авто);
	Результат.Вставить(ВРег("Usual"), ФигураКнопки.Обычная);
	Результат.Вставить(ВРег("Oval"), ФигураКнопки.Овал);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
