#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт 
	ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование общего модуля ""МФСлужебный""")
			.ДобавитьТест("Версия");
	;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Версия

Процедура Версия() Экспорт 
	// Дано
	ВерсияКонфигурации = Метаданные.Версия;
	ВерсияИзМодуля = МФСлужебный.Версия();
	
	// Когда
	
	// Тогда
	
	ЮТест.ОжидаетЧто(ВерсияИзМодуля)
		.Равно(ВерсияКонфигурации)
	;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
