//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

&НаКлиенте
Перем ИменаПараметров;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИменаПараметров = Обработки.МФГенерацияАвтотестов.ИменаПараметровДляРаботыСРасширением();
	
	Для Каждого ИмяПараметра Из ИменаПараметров Цикл
		ЗначениеПоля = Неопределено;
		Если Параметры.Свойство(ИмяПараметра, ЗначениеПоля) Тогда
			ЭтаФорма[ИмяПараметра] = ЗначениеПоля;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидИнформационнойБазыПриИзменении(Элемент)
	УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьПараметры(Команда)
	РезультатЗакрытияФормы = Новый Структура;
	Для Каждого ИмяПараметра Из ИменаПараметров Цикл
		РезультатЗакрытияФормы.Вставить(ИмяПараметра, ЭтаФорма[ИмяПараметра]);
	КонецЦикла;
	Закрыть(РезультатЗакрытияФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементов()
	Элементы.СтрокаСоединенияКСуществующейИБ.Видимость = (ВидИнформационнойБазы = 1);
	Элементы.ПользовательСуществующейИБ.Видимость = (ВидИнформационнойБазы = 1);
	Элементы.ПарольПользователяСуществующейИБ.Видимость = (ВидИнформационнойБазы = 1);
КонецПроцедуры

#КонецОбласти
