//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
// Раздел содержит процедуры-обработчики событий формы: ПриСозданииНаСервере, ПриОткрытии и т.п.
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Раздел содержит процедуры-обработчики элементов, расположенных в основной части формы 
// (все, что не связано с таблицами на форме).
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
// В разделах размещаются процедуры-обработчики таблиц формы и элементов таблиц. Для процедур-обработчиков 
// каждой таблицы должен быть создан свой раздел.
#КонецОбласти

#Область ОбработчикиКомандФормы
// Раздел содержит процедуры-обработчики команд формы (имена которых задаются в свойстве Действие команд формы).
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Раздел содержит процедуры и функции, составляющие внутреннюю реализацию общего модуля. В тех случаях, 
// когда общий модуль является частью некоторой функциональной подсистемы, включающей в себя несколько 
// объектов метаданных, в этом разделе также могут быть размещены служебные экспортные процедуры и функции, 
// предназначенные только для вызова из других объектов данной подсистемы.
#КонецОбласти
