//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп
		.ФреймворкТестирования()
		.ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование кнопки формы")
			.ДобавитьТест("КнопкаФормыГиперссылка", "Тестирование элемента КнопкаФормы вида ""Гиперссылка""")
			.ДобавитьТест("КнопкаФормыГиперссылкаКоманднойПанели", "Тестирование элемента КнопкаФормы вида ""ГиперссылкаКоманднойПанели""")
			.ДобавитьТест("КнопкаФормыКнопкаКоманднойПанели", "Тестирование элемента КнопкаФормы вида ""КнопкаКоманднойПанели""")
			.ДобавитьТест("КнопкаФормыОбычнаяКнопка", "Тестирование элемента КнопкаФормы вида ""ОбычнаяКнопка""")
	;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура КнопкаФормыГиперссылка() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Гиперссылка");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеКнопкиФормы";
	ИмяТестируемогоРеквизита = "КнопкаФормы_ВидГиперссылка";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура КнопкаФормыГиперссылкаКоманднойПанели() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ГиперссылкаКоманднойПанели");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеКнопкиФормы";
	ИмяТестируемогоРеквизита = "КнопкаФормы_ВидГиперссылкаКоманднойПанели";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура КнопкаФормыКнопкаКоманднойПанели() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "КнопкаКоманднойПанели");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеКнопкиФормы";
	ИмяТестируемогоРеквизита = "КнопкаФормы_ВидКнопкаКоманднойПанели";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура КнопкаФормыОбычнаяКнопка() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ОбычнаяКнопка");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеКнопкиФормы";
	ИмяТестируемогоРеквизита = "КнопкаФормы_ВидОбычнаяКнопка";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти
