//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбработкаОписанияОшибки() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Порядок", Новый Массив);
	Результат.Вставить("ОписанияПолей", Новый Структура);
	
	// BSLLS:LineLength-off
	ДобавитьПолеОписанияОшибки(Результат, "НомерСтрокиМакета", "Номер строки макета:", МФГенераторПротоколаПовтИсп.ВыводВТойЖеСтроке());
	ДобавитьПолеОписанияОшибки(Результат, "СтрокаМакета", "Строка макета:", МФГенераторПротоколаПовтИсп.ВыводВНовойСтроке());
	ДобавитьПолеОписанияОшибки(Результат, "ИмяМодуля", "Имя модуля:", МФГенераторПротоколаПовтИсп.ВыводВТойЖеСтроке());
	ДобавитьПолеОписанияОшибки(Результат, "НомерСтроки", "Номер строки:", МФГенераторПротоколаПовтИсп.ВыводВТойЖеСтроке());
	ДобавитьПолеОписанияОшибки(Результат, "ИсходнаяСтрока", "Исходная строка:", МФГенераторПротоколаПовтИсп.ВыводВНовойСтроке());
	ДобавитьПолеОписанияОшибки(Результат, "Код", "Код:", МФГенераторПротоколаПовтИсп.ВыводВТойЖеСтроке());
	ДобавитьПолеОписанияОшибки(Результат, "Описание", "Описание:", МФГенераторПротоколаПовтИсп.ВыводВНовойСтроке());
	ДобавитьПолеОписанияОшибки(Результат, "ДополнительнаяИнформация", "Дополнительная информация:", МФГенераторПротоколаПовтИсп.ВыводВНовойСтроке());
	// BSLLS:LineLength-on
	
	Возврат Результат;
КонецФункции

Функция ВыводВНовойСтроке() Экспорт
	Возврат "ВНовойСтроке";
КонецФункции

Функция ВыводВТойЖеСтроке() Экспорт
	Возврат "ВыводВТойЖеСтроке";
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеОписанияОшибки(ОбработкаОписанияОшибки, ИмяПоля, ПредставлениеПоля, Вывод)
	Если Не ОбработкаОписанияОшибки.ОписанияПолей.Свойство(ИмяПоля) Тогда
		ОбработкаОписанияОшибки.Порядок.Добавить(ИмяПоля);
	КонецЕсли;
	ОписаниеПоля = Новый Структура;
	ОписаниеПоля.Вставить("Вывод", Вывод);
	ОписаниеПоля.Вставить("Представление", ПредставлениеПоля);
	ОбработкаОписанияОшибки.ОписанияПолей.Вставить(ИмяПоля, ОписаниеПоля);
КонецПроцедуры

#КонецОбласти
