//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеИмениФормыКоллекцииМетаданных() Экспорт
	Результат = Новый Структура;
	
	ДобавитьСоответствие(Результат, "ОбщаяФорма", Метаданные.ОбщиеФормы, Истина);
	
	ДобавитьСоответствие(Результат, "Справочник", Метаданные.Справочники);
	ДобавитьСоответствие(Результат, "Документ", Метаданные.Документы);
	ДобавитьСоответствие(Результат, "ЖурналДокументов", Метаданные.ЖурналыДокументов);
	ДобавитьСоответствие(Результат, "Перечисление", Метаданные.Перечисления);
	ДобавитьСоответствие(Результат, "Отчет", Метаданные.Отчеты);
	ДобавитьСоответствие(Результат, "Обработка", Метаданные.Обработки);
	ДобавитьСоответствие(Результат, "ПланВидовХарактеристик", Метаданные.ПланыВидовХарактеристик);
	ДобавитьСоответствие(Результат, "ПланСчетов", Метаданные.ПланыСчетов);
	ДобавитьСоответствие(Результат, "ПланВидовРасчета", Метаданные.ПланыВидовРасчета);
	ДобавитьСоответствие(Результат, "РегистрСведений", Метаданные.РегистрыСведений);
	ДобавитьСоответствие(Результат, "РегистрНакопления", Метаданные.РегистрыНакопления);
	ДобавитьСоответствие(Результат, "РегистрБухгалтерии", Метаданные.РегистрыБухгалтерии);
	ДобавитьСоответствие(Результат, "РегистрРасчета", Метаданные.РегистрыРасчета);
	ДобавитьСоответствие(Результат, "БизнесПроцесс", Метаданные.БизнесПроцессы);
	ДобавитьСоответствие(Результат, "Задача", Метаданные.Задачи);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСоответствие(Соответствие, Ключ, Коллекция, ЭтоОбщий = Ложь)
	Описание = Новый Структура;
	Описание.Вставить("Коллекция", Коллекция);
	Описание.Вставить("ЭтоОбщий", ЭтоОбщий);
	
	Соответствие.Вставить(Ключ, Описание);
КонецПроцедуры

#КонецОбласти
