//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция Идентификаторы() Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("РЕКВИЗИТ");
	
	Возврат Идентификаторы;
КонецФункции

// TODO: Добавить возможность расширения типов реквизита, в случае когда реквизит предопределен на форме (issue: #27)

// TODO 2024-11-19: Добавить возможность создания реквизитов: ТаблицаЗначений, ДинамическийСписок и т.д. (issue: #28)

// Обработчик строки, описывающий реквизит
//
// Параметры:
//  ОписаниеМодификаций - Структура - См. подробнее МодификацияФормСлужебный.НовыйОписаниеМодификаций()
//  Поля - Массив - значения полей из строки описания модификации формы. Ожидается 2 элемента массива:
//    * [0] - Идентификатор строки. Может содержать значения из массива, возвращаемого функцией Идентификаторы().
//    * [1] - Имя реквизита. 
//
// Пример строки:
//  РЕКВИЗИТ	Реквизит1
//
Процедура Обработать(ОписаниеМодификаций, Поля) Экспорт
	МинимальноеКоличествоПолей = 2;
	КоличествоПолей = Поля.Количество();
	МФОбработкаСтрокСлужебный.ПроверитьКоличествоПолейСтроки(КоличествоПолей, МинимальноеКоличествоПолей);
	
	СоставПолейСтроки = МФОбработкаСтрокСлужебный.СоставПолейСтроки(Поля, "Имя");
	
	Описание = Новый Структура;
	Описание.Вставить("ИмяРеквизита", СоставПолейСтроки.Имя);
	Описание.Вставить("ТипыРеквизита", Новый Соответствие);
	
	ОписаниеМодификаций.Реквизиты.Вставить(СоставПолейСтроки.Идентификатор, Описание);
КонецПроцедуры

#КонецОбласти
