//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьДанныеФормыДляТестирования(Форма, ОписаниеМодификаций) Экспорт
	АдресДанныхДляТестирования = Форма.Параметры[
		МФТестированиеКлиентСерверПовтИсп.ИмяПараметраАдресДанныхДляТестирования()
	];
	ДанныеДляТестирования = Новый Структура;
	
	РеквизитыДляТестирования = Новый Соответствие;
	
	РеквизитыФормы = Форма.ПолучитьРеквизиты();
	Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
		ДобавитьРеквизитДляТестирования(РеквизитыДляТестирования, РеквизитФормы);
		
		Если РеквизитФормы.ТипЗначения.СодержитТип(Тип("ТаблицаЗначений")) Тогда
			ВременнаяТаблица = Форма[РеквизитФормы.Имя].Выгрузить();
			ОбработатьТаблицуЗначенийДляТестирования(ВременнаяТаблица, РеквизитыДляТестирования, РеквизитФормы.Имя);
		Иначе
			Для Каждого ТипЗначенияРеквизита Из РеквизитФормы.ТипЗначения.Типы() Цикл
				ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначенияРеквизита);
				Если ОбъектМетаданных = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				// TODO 2026-01-21: Избавиться от Попытки
				Попытка
					ТабличныеЧасти = ОбъектМетаданных.ТабличныеЧасти;
				Исключение
					Продолжить;
				КонецПопытки;
				
				Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
					Попытка
						ВременнаяТаблица = Форма[РеквизитФормы.Имя][ТабличнаяЧасть.Имя].Выгрузить();
					Исключение
						Продолжить;
					КонецПопытки;
					ОбработатьТаблицуЗначенийДляТестирования(
						ВременнаяТаблица,
						РеквизитыДляТестирования,
						СтрШаблон("%1.%2", РеквизитФормы.Имя, ТабличнаяЧасть.Имя)
					);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	СвойстваЭлементовНедоступныеНаКлиенте = Новый Структура;
	Для Каждого ЭлементФормы Из ОписаниеМодификаций.Элементы Цикл
		СвойстваНедоступныеНаКлиенте = МФОбъектыФормыПовтИсп
			.ОписанияСвойствЭлементовФормы()
			.Получить(ЭлементФормы.Значение.ТипЭлемента)
			.СвойстваНедоступныеНаКлиенте
		;
		Если СвойстваНедоступныеНаКлиенте.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияСвойств = Новый Структура;
		ЗначениеСвойства = Неопределено;
		Для Каждого ИмяСвойства Из СвойстваНедоступныеНаКлиенте Цикл
			Если Не ЭлементФормы.Значение.СвойстваОбъекта.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
				Продолжить;
			КонецЕсли;
			ЗначенияСвойств.Вставить(ИмяСвойства, ЗначениеСвойства);
		КонецЦикла;
		Если ЗначенияСвойств.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваЭлементовНедоступныеНаКлиенте.Вставить(ЭлементФормы.Ключ, ЗначенияСвойств);
	КонецЦикла;
	
	СвойстваКомандНедоступныеНаКлиенте = Новый Структура;
	Для Каждого КомандаФормы Из ОписаниеМодификаций.Команды Цикл
		СвойстваНедоступныеНаКлиенте = МФОбъектыФормыПовтИсп
			.ОписанияСвойствКомандФормы()
			.СвойстваНедоступныеНаКлиенте
		;
		Если СвойстваНедоступныеНаКлиенте.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначенияСвойств = Новый Структура;
		ЗначениеСвойства = Неопределено;
		Для Каждого ИмяСвойства Из СвойстваНедоступныеНаКлиенте Цикл
			Если Не КомандаФормы.Значение.СвойстваОбъекта.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
				Продолжить;
			КонецЕсли;
			ЗначенияСвойств.Вставить(ИмяСвойства, ЗначениеСвойства);
		КонецЦикла;
		Если ЗначенияСвойств.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваКомандНедоступныеНаКлиенте.Вставить(КомандаФормы.Ключ, ЗначенияСвойств);
	КонецЦикла;
	
	ДанныеДляТестирования.Вставить("Реквизиты", РеквизитыДляТестирования);
	ДанныеДляТестирования.Вставить("СвойстваЭлементовНедоступныеНаКлиенте", СвойстваЭлементовНедоступныеНаКлиенте);
	ДанныеДляТестирования.Вставить("СвойстваКомандНедоступныеНаКлиенте", СвойстваКомандНедоступныеНаКлиенте);
	ПоместитьВоВременноеХранилище(ДанныеДляТестирования, АдресДанныхДляТестирования);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРеквизитДляТестирования(РеквизитыДляТестирования, РеквизитФормы)
	РеквизитДляТестирования = НовыйРеквизитДляТестирования();
	ЗаполнитьЗначенияСвойств(РеквизитДляТестирования, РеквизитФормы);
	Ключ = РеквизитФормы.Имя;
	Если Не ПустаяСтрока(РеквизитФормы.Путь) Тогда
		Ключ = СтрШаблон("%1.%2", СокрЛП(РеквизитФормы.Путь), Ключ);
	КонецЕсли;
	РеквизитыДляТестирования.Вставить(Ключ, РеквизитДляТестирования);
КонецПроцедуры

Процедура ОбработатьТаблицуЗначенийДляТестирования(ВременнаяТаблица, РеквизитыДляТестирования, ИмяРеквизитаФормы)
	Для Каждого КолонкаВременнойТаблицы Из ВременнаяТаблица.Колонки Цикл
		РеквизитДляТестирования = НовыйРеквизитДляТестирования();
		ЗаполнитьЗначенияСвойств(РеквизитДляТестирования, КолонкаВременнойТаблицы);
		РеквизитДляТестирования.Путь = ИмяРеквизитаФормы;
		РеквизитДляТестирования.Вставить("Имя", КолонкаВременнойТаблицы.Имя);
		ДобавитьРеквизитДляТестирования(РеквизитыДляТестирования, РеквизитДляТестирования);
	КонецЦикла;
КонецПроцедуры

Функция НовыйРеквизитДляТестирования()
	Результат = Новый Структура;
	
	Результат.Вставить("Заголовок", Неопределено);
	Результат.Вставить("Путь", Неопределено);
	Результат.Вставить("СохраняемыеДанные", Неопределено);
	Результат.Вставить("ТипЗначения", Неопределено);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
