//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеИдентификаторовИТиповЭлементовФормы() Экспорт
	Результат = Новый Соответствие;
	
	Для Каждого Обработчик Из МФОбъектыФормыПовтИсп.ОбработчикиТиповЭлементовФормы() Цикл
		ТипЭлемента = Обработчик.ТипЭлементаФормы();
		Идентификаторы = Обработчик.Идентификаторы();
		Для Каждого Идентификатор Из Идентификаторы Цикл
			Результат.Вставить(Идентификатор, ТипЭлемента);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ОписанияСвойствЭлементовФормы() Экспорт
	Результат = Новый Соответствие;
	
	СинонимыСвойствЭлементов = СинонимыСвойствОбъектов();
	
	Для Каждого Обработчик Из МФОбъектыФормыПовтИсп.ОбработчикиТиповЭлементовФормы() Цикл
		ОписанияСвойств = ОписанияСвойствОбъектовФормы(Обработчик, СинонимыСвойствЭлементов);
		
		Результат.Вставить(Обработчик.ТипЭлементаФормы(), ОписанияСвойств);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция ОписанияСвойствКомандФормы() Экспорт
	Результат = ОписанияСвойствОбъектовФормы(МФКомандаФормы, СинонимыСвойствОбъектов());
	
	Возврат Результат;
КонецФункции

#Область ТолькоДляВызоваИзЭтогоМодуля

Функция ОбработчикиТиповЭлементовФормы() Экспорт
	Результат = Новый Массив;
	
	Результат.Добавить(МФГруппаФормы);
	Результат.Добавить(МФДекорацияФормы);
	Результат.Добавить(МФКнопкаФормы);
	Результат.Добавить(МФПолеФормы);
	Результат.Добавить(МФТаблицаФормы);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписанияСвойствОбъектовФормы(Обработчик, СинонимыСвойствЭлементов)
	Результат = МФОбъектыФормыСлужебный.НовыйОписаниеСвойствОбъектаФормы();
	
	ЗависимостиСвойств = Обработчик.ЗависимостиСвойств();
	
	Обработчик.ЗаполнитьРазделОсновные(Результат, СинонимыСвойствЭлементов, ЗависимостиСвойств);
	Обработчик.ЗаполнитьРазделПредставление(Результат, СинонимыСвойствЭлементов, ЗависимостиСвойств);
	Обработчик.ЗаполнитьРазделДанные(Результат, СинонимыСвойствЭлементов, ЗависимостиСвойств);
	Обработчик.ЗаполнитьРазделИспользование(Результат, СинонимыСвойствЭлементов, ЗависимостиСвойств);
	Обработчик.ЗаполнитьРазделОформление(Результат, СинонимыСвойствЭлементов, ЗависимостиСвойств);
	Обработчик.ЗаполнитьРазделРасположение(Результат, СинонимыСвойствЭлементов, ЗависимостиСвойств);
	Обработчик.ЗаполнитьРазделСобытия(Результат, СинонимыСвойствЭлементов, ЗависимостиСвойств);
	Обработчик.ЗаполнитьОбязательныеСвойства(Результат);
	Обработчик.ЗаполнитьСвойстваНедоступныеНаКлиенте(Результат, СинонимыСвойствЭлементов);
	
	Для Каждого СоответствиеСвойства Из Результат.СоответствиеСвойств Цикл
		Синоним = СоответствиеСвойства.Ключ;
		ОбязательноеСвойство = СоответствиеСвойства.Значение;
		ОписаниеОбязательногоСвойства = Результат.ОбязательныеСвойства.Получить(ОбязательноеСвойство);
		Если ОписаниеОбязательногоСвойства = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеОбязательногоСвойства.Синонимы.Добавить(Синоним);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// УДАЛИТЬ ИЗ РЕЛИЗА: НАЧАЛО БЛОКА
// При внесении изменений в эту функцию необходимо обновить функцию в расширении с юнит-тестами
// УДАЛИТЬ ИЗ РЕЛИЗА: КОНЕЦ БЛОКА
Функция СинонимыСвойствОбъектов()
	Результат = Новый Структура;
	Макет = ПолучитьОбщийМакет("МФСинонимыСвойствОбъектов");
	
	РазделительПолей = ";";
	Для Индекс = 2 По Макет.КоличествоСтрок() Цикл
		СтрокаМакета = СокрЛП(Макет.ПолучитьСтроку(Индекс));
		Если
			ПустаяСтрока(СтрокаМакета)
			Или (Лев(СтрокаМакета, 1) = "#")
		Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеСвойства = СтрРазделить(СтрокаМакета, РазделительПолей);
		Ключ = ОписаниеСвойства[0];
		Синонимы = Новый Массив;
		Для Сч = 1 По ОписаниеСвойства.Количество() - 1 Цикл
			Синонимы.Добавить(ОписаниеСвойства[Сч]);
		КонецЦикла;
		Значение = СтрСоединить(Синонимы, ",");
		Результат.Вставить(Ключ, Значение);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

#КонецОбласти
