//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп
		.ФреймворкТестирования()
		.ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование группы формы")
			.ДобавитьТест("ГруппаФормыГруппаКнопок", "Тестирование элемента ГруппаФормы вида ""ГруппаКнопок""")
			.ДобавитьТест("ГруппаФормыГруппаКолонок", "Тестирование элемента ГруппаФормы вида ""ГруппаКолонок""")
			.ДобавитьТест("ГруппаФормыКоманднаяПанель", "Тестирование элемента ГруппаФормы вида ""КоманднаяПанель""")
			.ДобавитьТест("ГруппаФормыКонтекстноеМеню", "Тестирование элемента ГруппаФормы вида ""КонтекстноеМеню""")
			.ДобавитьТест("ГруппаФормыОбычнаяГруппа", "Тестирование элемента ГруппаФормы вида ""ОбычнаяГруппа""")
			.ДобавитьТест("ГруппаФормыПодменю", "Тестирование элемента ГруппаФормы вида ""Подменю""")
			.ДобавитьТест("ГруппаФормыСтраницы", "Тестирование элемента ГруппаФормы вида ""Страницы""")
			.ДобавитьТест("ГруппаФормыСтраница", "Тестирование элемента ГруппаФормы вида ""Страница""")
	;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Процедура ГруппаФормыГруппаКнопок() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ГруппаКнопок");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидГруппаКнопок";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ГруппаФормыГруппаКолонок() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ГруппаКолонок");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидГруппаКолонок";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ГруппаФормыКоманднаяПанель() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "КоманднаяПанель");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидКоманднаяПанель";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ГруппаФормыКонтекстноеМеню() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "КонтекстноеМеню");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ДекорацияКонтекстноеМенюКонтекстноеМеню";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ГруппаФормыОбычнаяГруппа() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ОбычнаяГруппа");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидОбычнаяГруппа";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ГруппаФормыПодменю() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Подменю");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидПодменю";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ГруппаФормыСтраницы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Страницы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидСтраницы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура ГруппаФормыСтраница() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Страница");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидСтраница";
	
	ТестированиеСлужебныйКлиент.ПротестироватьЭлементФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти
