//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура ИсполняемыеСценарии() Экспорт 
	МФТестированиеКлиентСерверПовтИсп
		.ФреймворкТестирования()
		.ЮТТесты
		.ДобавитьТестовыйНабор("Тестирование свойств группы формы")
			.ДобавитьТест("СвойстваГруппыФормыГруппаКнопок", "Свойства элемента ГруппаФормы вида ""ГруппаКнопок""")
			.ДобавитьТест("СвойстваГруппыФормыГруппаКолонок", "Свойства элемента ГруппаФормы вида ""ГруппаКолонок""")
			.ДобавитьТест("СвойстваГруппыФормыКоманднаяПанель", "Свойства элемента ГруппаФормы вида ""КоманднаяПанель""")
			.ДобавитьТест("СвойстваГруппыФормыКонтекстноеМеню", "Свойства элемента ГруппаФормы вида ""КонтекстноеМеню""")
			.ДобавитьТест("СвойстваГруппыФормыОбычнаяГруппа", "Свойства элемента ГруппаФормы вида ""ОбычнаяГруппа""")
			.ДобавитьТест("СвойстваГруппыФормыПодменю", "Свойства элемента ГруппаФормы вида ""Подменю""")
			.ДобавитьТест("СвойстваГруппыФормыСтраницы", "Свойства элемента ГруппаФормы вида ""Страницы""")
			.ДобавитьТест("СвойстваГруппыФормыСтраница", "Свойства элемента ГруппаФормы вида ""Страница""")
		.ДобавитьТестовыйНабор("Тестирование событий группы формы")
			.ДобавитьТест("СобытияГруппыФормыГруппаКнопок", "События элемента ГруппаФормы вида ""ГруппаКнопок""")
			.ДобавитьТест("СобытияГруппыФормыГруппаКолонок", "События элемента ГруппаФормы вида ""ГруппаКолонок""")
			.ДобавитьТест("СобытияГруппыФормыКоманднаяПанель", "События элемента ГруппаФормы вида ""КоманднаяПанель""")
			.ДобавитьТест("СобытияГруппыФормыКонтекстноеМеню", "События элемента ГруппаФормы вида ""КонтекстноеМеню""")
			.ДобавитьТест("СобытияГруппыФормыОбычнаяГруппа", "События элемента ГруппаФормы вида ""ОбычнаяГруппа""")
			.ДобавитьТест("СобытияГруппыФормыПодменю", "События элемента ГруппаФормы вида ""Подменю""")
			.ДобавитьТест("СобытияГруппыФормыСтраницы", "События элемента ГруппаФормы вида ""Страницы""")
			.ДобавитьТест("СобытияГруппыФормыСтраница", "События элемента ГруппаФормы вида ""Страница""")
	;
КонецПроцедуры

#Область ТестированиеСвойств

Процедура СвойстваГруппыФормыГруппаКнопок() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ГруппаКнопок");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидГруппаКнопок";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваГруппыФормыГруппаКолонок() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ГруппаКолонок");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидГруппаКолонок";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваГруппыФормыКоманднаяПанель() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "КоманднаяПанель");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидКоманднаяПанель";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваГруппыФормыКонтекстноеМеню() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "КонтекстноеМеню");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ДекорацияКонтекстноеМенюКонтекстноеМеню";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваГруппыФормыОбычнаяГруппа() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ОбычнаяГруппа");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидОбычнаяГруппа";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваГруппыФормыПодменю() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Подменю");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидПодменю";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваГруппыФормыСтраницы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Страницы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидСтраницы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СвойстваГруппыФормыСтраница() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Страница");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидСтраница";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСвойстваЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти

#Область ТестированиеСобытий

Процедура СобытияГруппыФормыГруппаКнопок() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ГруппаКнопок");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидГруппаКнопок";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияГруппыФормыГруппаКолонок() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ГруппаКолонок");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидГруппаКолонок";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияГруппыФормыКоманднаяПанель() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "КоманднаяПанель");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидКоманднаяПанель";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияГруппыФормыКонтекстноеМеню() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "КонтекстноеМеню");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ДекорацияКонтекстноеМенюКонтекстноеМеню";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияГруппыФормыОбычнаяГруппа() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "ОбычнаяГруппа");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидОбычнаяГруппа";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияГруппыФормыПодменю() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Подменю");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидПодменю";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияГруппыФормыСтраницы() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Страницы");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидСтраницы";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

Процедура СобытияГруппыФормыСтраница() Экспорт
	Зависимость = ТестированиеСлужебныйКлиент.Зависимость("Вид", "Страница");
	ИмяТестируемойФормы = "ОбщаяФорма.ТестированиеГруппыФормы";
	ИмяТестируемогоРеквизита = "ГруппаФормы_ВидСтраница";
	
	ТестированиеСлужебныйКлиент.ПротестироватьСобытияЭлементаФормы(ИмяТестируемойФормы, ИмяТестируемогоРеквизита, Зависимость);
КонецПроцедуры

#КонецОбласти
