//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Функция Идентификаторы() Экспорт
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("СВЯЗЬПАРАМЕТРАВЫБОРА");
	
	Возврат Идентификаторы;
КонецФункции

// Обработчик строки, описывающий элемент связи параметров выбора
//
// Параметры:
//  ОписаниеМодификаций - Структура - См. подробнее МФСлужебный.НовыйОписаниеМодификаций()
//  Поля - Массив - значения полей из строки описания модификации формы. Ожидается 5 элементов массива:
//    * [0] - Идентификатор строки. Может содержать значения из массива, возвращаемого функцией Идентификаторы().
//    * [1] - Имя набора связей параметров выбора.
//    * [2] - Имя связи параметра выбора. Например, "Отбор.Владелец". См. дополнительно справку по объекту
//            "СвязьПараметраВыбора".
//    * [3] - Путь к данным. См. дополнительно справку по объекту "СвязьПараметраВыбора".
//    * [4] - Способ изменения связанного значения при изменении ведущего значения:
//            - НеИзменять
//            - Очищать
//            См. дополнительно справку по объекту "СвязьПараметраВыбора".
//
// Пример строки:
// СВЯЗЬПАРАМЕТРАВЫБОРА	Реквизит1	Булево
//
Процедура Обработать(ОписаниеМодификаций, Поля) Экспорт
	МинимальноеКоличествоПолей = 3;
	КоличествоПолей = Поля.Количество();
	МФОбработкаСтрокСлужебный.ПроверитьКоличествоПолейСтроки(КоличествоПолей, МинимальноеКоличествоПолей);
	
	СоставПолейСтроки = МФОбработкаСтрокСлужебный.СоставПолейСтроки(Поля, "Имя,ИмяСвязи,ПутьКДанным,ИзменениеЗначения");
	Если Не ОписаниеМодификаций.СвязиПараметровВыбора.Свойство(СоставПолейСтроки.Идентификатор) Тогда
		// BSLLS:NestedFunctionInParameters-off
		ТекстИсключения = СтрШаблон(
			НСтр("ru='Отсутствует описание связей параметров выбора с именем ""%1""'"), 
			СоставПолейСтроки.Имя
		);
		// BSLLS:NestedFunctionInParameters-on
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Описание = Новый Структура;
	Описание.Вставить("ИмяСвязи", СоставПолейСтроки.ИмяСвязи);
	Описание.Вставить("ПутьКДанным", СоставПолейСтроки.ПутьКДанным);
	ЗначениеПараметра = МФПовтИсп
		.ЗначенияСтандартныхПеречислений()
		.Значения
		.Получить(Тип("РежимИзмененияСвязанногоЗначения"))
		.Получить(МФОбработкаСтрокСлужебный.Идентификатор(СоставПолейСтроки.ИзменениеЗначения))
	;
	Если ЗначениеПараметра = Неопределено Тогда
		// BSLLS:NestedFunctionInParameters-off
		ТекстИсключения = СтрШаблон(
			НСтр("ru='Неизвестное значение ""%1"" параметра ""Изменение значения"" в описании элемента ""%2"" связей параметра выбора ""%3""'"), 
			СоставПолейСтроки.ИзменениеЗначение,
			СоставПолейСтроки.ИмяСвязи,
			СоставПолейСтроки.Имя
		);
		// BSLLS:NestedFunctionInParameters-on
		
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Описание.Вставить("ИзменениеЗначения", ЗначениеПараметра);
	ОписаниеМодификаций
		.СвязиПараметровВыбора[СоставПолейСтроки.Идентификатор]
		.Состав
		.Вставить(
			МФОбработкаСтрокСлужебный.Идентификатор(СоставПолейСтроки.ИмяСвязи),
			Описание
		)
	;
КонецПроцедуры

#КонецОбласти
