//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2025-2026 Alexey A. Stepanenko 
//    * alexey.stepanenko@gmail.com
//    * TG: @AlexeyStepanenko
//    * https://github.com/alexey-stepanenko
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИменаПараметровГенерацииРасширения() Экспорт
	Результат = Новый Массив;
	
	Результат.Добавить("ПутьКФайлуЗапуска1С");
	Результат.Добавить("ВидИнформационнойБазы");
	Результат.Добавить("СтрокаСоединенияКСуществующейИБ");
	Результат.Добавить("ПользовательСуществующейИБ");
	Результат.Добавить("ПарольПользователяСуществующейИБ");
	Результат.Добавить("ИмяРасширения");
	Результат.Добавить("ВерсияРасширения");
	
	Возврат СтрСоединить(Результат, ",");
КонецФункции

Функция ИменаСвойствГенерацииРасширения() Экспорт;
	Результат = Новый Массив;
	
	Результат.Добавить("ИмяРасширения");
	Результат.Добавить("ВерсияРасширения");
	Результат.Добавить("ПолныйПутьКФайлуРасширения");
	Результат.Добавить("ФормироватьМодулиСТестами");
	Результат.Добавить("ФормироватьМодулиЯдраТестирования");
	
	Возврат СтрСоединить(Результат, ",");
КонецФункции

Функция СвойстваРасширения(ДвоичныеДанные) Экспорт
	Результат = Новый Структура("Имя, Версия");
	Попытка
		РасширениеСТестами = РасширенияКонфигурации.Создать(ДвоичныеДанные);
		Результат.Имя = РасширениеСТестами.Имя;
		Результат.Версия = РасширениеСТестами.Версия;
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
